[
	{
		"id": "altair",
		"name": "Altair",
		"description": "Altair is a declarative statistical visualization library for Python, based on Vega and Vega-Lite. It is designed for quick and effective data exploration and analysis. Users specify the visual encodings and data transformations in a concise syntax, and Altair automatically handles rendering. Altair enforces a strict separation between data and its representation, promoting clean code and reproducible analysis. It’s highly recommended for notebooks and teaching purposes.",
		"category": "Analytics",
		"license": "BSD-3-Clause",
		"cost": "Free",
		"size": "1.1 MB",
		"version": "5.1.0",
		"stars": 8500,
		"last_updated": "2024",
		"os": "Cross-platform",
		"tags": [
			"Visualization",
			"Declarative",
			"Statistics",
			"Python",
			"Data Exploration"
		],
		"source": "https://altair-viz.github.io"
	},
	{
		"id": "aws-quicksight",
		"name": "Amazon QuickSight",
		"description": "Amazon QuickSight is a cloud-powered business intelligence service by AWS that allows creating and publishing interactive dashboards. It connects to various AWS services and databases and supports machine learning insights, forecasting, and natural language querying. It’s scalable and suitable for organizations using AWS infrastructure.",
		"category": "Analytics",
		"license": "Commercial",
		"cost": "Starts at $5/user/month",
		"size": "Cloud-based",
		"version": "2024",
		"stars": 3900,
		"last_updated": "2024",
		"os": "Cross-platform",
		"tags": [
			"AWS",
			"Dashboard",
			"ML Insights",
			"BI",
			"Cloud"
		],
		"source": "https://aws.amazon.com/quicksight/"
	},
	{
		"id": "bokeh",
		"name": "Bokeh",
		"description": "Bokeh is an interactive visualization library that targets modern web browsers for presentation. It provides elegant, concise construction of versatile graphics and delivers high-performance interactivity over large or streaming datasets. Bokeh is used to build complex statistical plots quickly and intuitively. It can generate standalone HTML files or integrate with Flask/Django apps, making it useful for embedding dashboards and interactive reports. With support for linked brushing and streaming data, it is ideal for real-time analytics systems.",
		"category": "Analytics",
		"license": "BSD-3-Clause",
		"cost": "Free",
		"size": "18 MB",
		"version": "3.3.4",
		"stars": 18000,
		"last_updated": "2024",
		"os": "Cross-platform",
		"tags": [
			"Python",
			"Visualization",
			"Interactive",
			"Streaming",
			"Charts"
		],
		"source": "https://bokeh.org"
	},
	{
		"id": "chartio",
		"name": "Chartio (Archived)",
		"description": "Chartio was a powerful cloud-based BI tool designed for intuitive drag-and-drop dashboard creation. It supported a wide range of data sources and complex SQL queries with ease. Though discontinued, it was praised for usability and paved the way for modern embedded analytics platforms.",
		"category": "Analytics",
		"license": "Commercial",
		"cost": "Discontinued",
		"size": "Cloud-based",
		"version": "2022",
		"stars": 2800,
		"last_updated": "2022",
		"os": "Cross-platform",
		"tags": [
			"BI",
			"Dashboards",
			"SQL",
			"Cloud",
			"Archived"
		],
		"source": "https://chartio.com"
	},
	{
		"id": "cubejs",
		"name": "Cube.js",
		"description": "Cube.js is an open-source headless BI tool for building custom analytics applications. It acts as a data modeling layer that connects to data warehouses and exposes metrics via APIs for frontend consumption. Developers use Cube.js to embed charts and dashboards in custom applications with complete control over the UI and business logic.",
		"category": "Analytics",
		"license": "Apache-2.0",
		"cost": "Free (Cloud available)",
		"size": "40 MB",
		"version": "0.34.55",
		"stars": 16000,
		"last_updated": "2024",
		"os": "Cross-platform",
		"tags": [
			"Headless BI",
			"API",
			"Data Modeling",
			"Embedded Analytics"
		],
		"source": "https://cube.dev"
	},
	{
		"id": "dash",
		"name": "Dash",
		"description": "Dash is a Python framework for building data-driven, interactive web applications. Developed by Plotly, it allows users to create beautiful dashboards using pure Python without needing to know JavaScript or front-end frameworks. Dash is particularly useful in analytics, where data scientists and analysts can deploy ML models, charts, and interactive tables as web apps. It integrates tightly with Plotly for visualizations and Flask for backend routing.",
		"category": "Analytics",
		"license": "MIT",
		"cost": "Free (Pro available)",
		"size": "30 MB",
		"version": "2.16.0",
		"stars": 19000,
		"last_updated": "2024",
		"os": "Cross-platform",
		"tags": [
			"Dashboard",
			"Web App",
			"Visualization",
			"Python",
			"Data Science"
		],
		"source": "https://dash.plotly.com"
	},
	{
		"id": "databricks",
		"name": "Databricks",
		"description": "Databricks is a unified analytics platform built around Apache Spark. It offers collaborative notebooks, data lake integration, ML model management, and support for SQL, Python, R, and Scala. Databricks simplifies big data processing, analytics, and AI model deployment on the cloud, making it a top choice for large-scale enterprise use cases.",
		"category": "Analytics",
		"license": "Commercial",
		"cost": "Pay-as-you-go",
		"size": "Cloud-based",
		"version": "2024",
		"stars": 10000,
		"last_updated": "2024",
		"os": "Cross-platform",
		"tags": [
			"Spark",
			"Data Lake",
			"ML",
			"Big Data",
			"Cloud"
		],
		"source": "https://databricks.com"
	},
	{
		"id": "dataiku",
		"name": "Dataiku",
		"description": "Dataiku is a collaborative data science and machine learning platform for building and deploying models at scale. It offers visual tools, notebooks, AutoML, and MLOps features for teams to manage workflows end-to-end. It’s commonly used in enterprises for data preparation, model training, and integration into production systems.",
		"category": "Analytics",
		"license": "Commercial",
		"cost": "Custom pricing",
		"size": "Cloud or On-prem",
		"version": "12.0",
		"stars": 2700,
		"last_updated": "2024",
		"os": "Cross-platform",
		"tags": [
			"ML",
			"AutoML",
			"Data Prep",
			"MLOps",
			"Enterprise"
		],
		"source": "https://www.dataiku.com"
	},
	{
		"id": "datawrapper",
		"name": "Datawrapper",
		"description": "Datawrapper is an online tool that enables users to create charts, maps, and tables without writing code. It’s widely used by journalists, data teams, and communication professionals to publish responsive visualizations. With customizable templates, export options, and accessibility features, it’s a go-to solution for publishing clean and readable charts on the web.",
		"category": "Analytics",
		"license": "Commercial",
		"cost": "Free with paid plans",
		"size": "Web-based",
		"version": "2024",
		"stars": 2900,
		"last_updated": "2024",
		"os": "Cross-platform",
		"tags": [
			"Charts",
			"Maps",
			"Visualization",
			"Publishing",
			"No-Code"
		],
		"source": "https://www.datawrapper.de"
	},
	{
		"id": "deeplearning-keras",
		"name": "Keras",
		"description": "Keras is a deep learning API written in Python and running on top of TensorFlow. It simplifies the process of building neural networks and is widely adopted in academia and industry for quick experimentation. Keras offers user-friendly APIs, modular architecture, and seamless multi-GPU training support, making it ideal for analytics and AI development workflows.",
		"category": "Analytics",
		"license": "Apache-2.0",
		"cost": "Free",
		"size": "10 MB",
		"version": "2.15.0",
		"stars": 58000,
		"last_updated": "2024",
		"os": "Cross-platform",
		"tags": [
			"Deep Learning",
			"Neural Networks",
			"TensorFlow",
			"AI",
			"Python"
		],
		"source": "https://keras.io"
	},
	{
		"id": "deepnote",
		"name": "Deepnote",
		"description": "Deepnote is a collaborative data science notebook designed for teams. It supports real-time collaboration, SQL cells, environment management, and integrations with cloud data warehouses. Deepnote is commonly used in data-driven teams to combine code, rich text, and visualizations into interactive documents.",
		"category": "Analytics",
		"license": "Commercial",
		"cost": "Free with paid plans",
		"size": "Cloud-based",
		"version": "2024",
		"stars": 3100,
		"last_updated": "2024",
		"os": "Cross-platform",
		"tags": [
			"Notebooks",
			"Collaboration",
			"Data Science",
			"SQL",
			"Visualization"
		],
		"source": "https://deepnote.com"
	},
	{
		"id": "domo",
		"name": "Domo",
		"description": "Domo is a cloud-native business intelligence platform designed to provide real-time insights across business functions. It allows for integration of multiple data sources, custom app development, and interactive dashboard creation. Domo includes features like alerting, mobile access, embedded analytics, and powerful sharing options. It's primarily used by enterprises for executive dashboards and collaborative analytics.",
		"category": "Analytics",
		"license": "Commercial",
		"cost": "Custom pricing",
		"size": "Cloud-based",
		"version": "2024",
		"stars": 3200,
		"last_updated": "2024",
		"os": "Cross-platform",
		"tags": [
			"Business Intelligence",
			"Cloud",
			"Mobile",
			"Dashboards",
			"Collaboration"
		],
		"source": "https://www.domo.com"
	},
	{
		"id": "duckdb",
		"name": "DuckDB",
		"description": "DuckDB is an in-process SQL OLAP database management system. Designed for analytical workloads, it excels at complex queries over large datasets and integrates directly into applications via Python, R, or C++ APIs. DuckDB is lightweight, embeddable, and highly performant — often referred to as the SQLite for analytics.",
		"category": "Analytics",
		"license": "MIT",
		"cost": "Free",
		"size": "12 MB",
		"version": "0.10.2",
		"stars": 11000,
		"last_updated": "2024",
		"os": "Cross-platform",
		"tags": [
			"SQL",
			"OLAP",
			"In-Memory",
			"Embedded",
			"Analytics"
		],
		"source": "https://duckdb.org"
	},
	{
		"id": "dvc",
		"name": "DVC",
		"description": "DVC (Data Version Control) is an open-source tool for versioning datasets and machine learning models. It integrates with Git and allows teams to manage large data files, track experiments, and build reproducible data pipelines. DVC is particularly useful for collaborative ML workflows where tracking data changes and results is critical.",
		"category": "Analytics",
		"license": "Apache-2.0",
		"cost": "Free (Enterprise available)",
		"size": "30 MB",
		"version": "3.46.0",
		"stars": 12000,
		"last_updated": "2024",
		"os": "Cross-platform",
		"tags": [
			"Version Control",
			"ML",
			"Experiment Tracking",
			"Pipelines",
			"Git"
		],
		"source": "https://dvc.org"
	},
	{
		"id": "gooddata",
		"name": "GoodData",
		"description": "GoodData is a business intelligence platform that allows for the creation of scalable, embedded analytics and dashboards. It provides a headless BI engine with declarative metrics, semantic modeling, and a GraphQL API. GoodData is popular for building data products and integrating analytics into SaaS apps and portals.",
		"category": "Analytics",
		"license": "Commercial",
		"cost": "Free tier available",
		"size": "Cloud-based",
		"version": "2024",
		"stars": 1200,
		"last_updated": "2024",
		"os": "Cross-platform",
		"tags": [
			"Embedded BI",
			"GraphQL",
			"Headless",
			"Dashboards",
			"SaaS"
		],
		"source": "https://www.gooddata.com"
	},
	{
		"id": "grafana",
		"name": "Grafana",
		"description": "Grafana is an open-source analytics and interactive visualization web application. It provides charts, graphs, and alerts for the web when connected to supported data sources. Grafana is most commonly used for monitoring applications and systems, especially when used with time-series databases like Prometheus, InfluxDB, or Graphite. It's highly customizable with plugins and supports complex querying with templating features.",
		"category": "Analytics",
		"license": "AGPL-3.0",
		"cost": "Free (Cloud/Enterprise available)",
		"size": "100 MB",
		"version": "10.2.1",
		"stars": 57000,
		"last_updated": "2024",
		"os": "Cross-platform",
		"tags": [
			"Monitoring",
			"Dashboards",
			"Time-Series",
			"Metrics",
			"Visualization"
		],
		"source": "https://grafana.com"
	},
	{
		"id": "h2o",
		"name": "H2O.ai",
		"description": "H2O is an open-source machine learning and predictive analytics platform that supports distributed computing. It provides scalable algorithms for classification, regression, and clustering. H2O supports R, Python, and REST APIs, and it powers AutoML workflows for building models efficiently across large datasets. It's used in industries like finance, healthcare, and marketing.",
		"category": "Analytics",
		"license": "Apache-2.0",
		"cost": "Free",
		"size": "200 MB",
		"version": "3.42.0.2",
		"stars": 6300,
		"last_updated": "2024",
		"os": "Cross-platform",
		"tags": [
			"Machine Learning",
			"AutoML",
			"Big Data",
			"R",
			"Python"
		],
		"source": "https://www.h2o.ai"
	},
	{
		"id": "hex",
		"name": "Hex",
		"description": "Hex is a modern data platform that allows users to explore, analyze, and share data in collaborative notebooks. It combines SQL, Python, and no-code cells to build powerful, interactive data stories and dashboards. Built for teams, Hex supports branching, real-time collaboration, and publishing with interactive controls. It’s used by data science and analytics teams for prototyping and delivering insights fast.",
		"category": "Analytics",
		"license": "Commercial",
		"cost": "Custom pricing",
		"size": "Cloud-based",
		"version": "2024",
		"stars": 2400,
		"last_updated": "2024",
		"os": "Cross-platform",
		"tags": [
			"Notebooks",
			"Python",
			"SQL",
			"Collaboration",
			"Dashboards"
		],
		"source": "https://hex.tech"
	},
	{
		"id": "holoviews",
		"name": "HoloViews",
		"description": "HoloViews is a Python library for data exploration and visualization. It allows users to build complex, interactive plots with minimal code by linking data directly to visual elements. HoloViews integrates tightly with Pandas and supports backends like Bokeh and Matplotlib. It’s well-suited for scientific computing, dashboards, and working with large datasets in notebooks.",
		"category": "Analytics",
		"license": "BSD-3-Clause",
		"cost": "Free",
		"size": "4 MB",
		"version": "1.18.3",
		"stars": 2500,
		"last_updated": "2024",
		"os": "Cross-platform",
		"tags": [
			"Visualization",
			"Python",
			"Bokeh",
			"Notebook",
			"Data Exploration"
		],
		"source": "https://holoviews.org"
	},
	{
		"id": "jetbrains-datalore",
		"name": "JetBrains Datalore",
		"description": "Datalore is a collaborative data science platform by JetBrains for analyzing and visualizing data in Python. It features smart coding assistance, real-time collaboration, version control, and support for SQL and Python notebooks. It’s suitable for teams working on data analysis, exploration, and machine learning with seamless deployment via the web.",
		"category": "Analytics",
		"license": "Commercial",
		"cost": "Free plan available",
		"size": "Cloud-based",
		"version": "2024",
		"stars": 1800,
		"last_updated": "2024",
		"os": "Cross-platform",
		"tags": [
			"Python",
			"Notebook",
			"Collaboration",
			"JetBrains",
			"Analytics"
		],
		"source": "https://datalore.jetbrains.com"
	},
	{
		"id": "kibana",
		"name": "Kibana",
		"description": "Kibana is a data visualization dashboard for Elasticsearch. It provides powerful visual exploration and analysis tools for log and time-series analytics, application monitoring, and operational intelligence use cases. Users can build histograms, line graphs, pie charts, and maps. Kibana integrates tightly with the ELK stack (Elasticsearch, Logstash, Kibana) and is often used for observability and security analytics.",
		"category": "Analytics",
		"license": "Elastic License",
		"cost": "Free (with Elastic Stack)",
		"size": "300 MB",
		"version": "8.12.0",
		"stars": 18000,
		"last_updated": "2024",
		"os": "Cross-platform",
		"tags": [
			"Log Analysis",
			"Monitoring",
			"Elasticsearch",
			"Dashboards",
			"Security"
		],
		"source": "https://www.elastic.co/kibana"
	},
	{
		"id": "knime",
		"name": "KNIME",
		"description": "KNIME is an open-source platform for data analytics, reporting, and integration. It provides a visual workflow interface to create end-to-end data pipelines, including preprocessing, modeling, and visualization. KNIME supports integrations with Python, R, Spark, and various machine learning libraries. It is popular in research, finance, and pharmaceutical industries for its no-code and extensible architecture.",
		"category": "Analytics",
		"license": "GPL-3.0",
		"cost": "Free (Server edition available)",
		"size": "300 MB",
		"version": "5.2.1",
		"stars": 5200,
		"last_updated": "2024",
		"os": "Cross-platform",
		"tags": [
			"Visual Programming",
			"Data Science",
			"Workflow",
			"ETL",
			"ML"
		],
		"source": "https://www.knime.com"
	},
	{
		"id": "lightdash",
		"name": "Lightdash",
		"description": "Lightdash is an open-source BI and analytics platform built on top of dbt. It lets analysts turn dbt projects into fully-featured BI dashboards with metrics, visualizations, and sharing features. Designed to keep analytics in code, Lightdash allows for real-time data exploration and democratizes access to insights while maintaining developer best practices.",
		"category": "Analytics",
		"license": "MIT",
		"cost": "Free (Cloud available)",
		"size": "90 MB",
		"version": "1.7.0",
		"stars": 4400,
		"last_updated": "2024",
		"os": "Cross-platform",
		"tags": [
			"dbt",
			"Metrics Layer",
			"Open-source",
			"Dashboard",
			"BI"
		],
		"source": "https://lightdash.com"
	},
	{
		"id": "looker",
		"name": "Looker",
		"description": "Looker is a modern data platform and business intelligence tool acquired by Google Cloud. It allows companies to analyze and explore data through a web-based interface using LookML, a modeling language for describing relationships and metrics in SQL. Looker integrates seamlessly with BigQuery, Snowflake, Redshift, and other databases, and it's commonly used to deliver embedded analytics and data-driven workflows.",
		"category": "Analytics",
		"license": "Commercial",
		"cost": "Custom pricing",
		"size": "Cloud-based",
		"version": "2024",
		"stars": 6500,
		"last_updated": "2024",
		"os": "Cross-platform",
		"tags": [
			"Business Intelligence",
			"LookML",
			"Google Cloud",
			"Modeling",
			"Embedded Analytics"
		],
		"source": "https://looker.com"
	},
	{
		"id": "looker",
		"name": "Looker",
		"description": "Looker is a modern business intelligence platform acquired by Google Cloud. It provides a centralized semantic modeling layer via LookML and allows users to build consistent dashboards, reports, and explore real-time data. Looker integrates deeply with cloud data warehouses and is widely used for scalable, governed analytics.",
		"category": "Analytics",
		"license": "Commercial",
		"cost": "Custom pricing",
		"size": "Cloud-based",
		"version": "2024",
		"stars": 4800,
		"last_updated": "2024",
		"os": "Cross-platform",
		"tags": [
			"Google Cloud",
			"Modeling",
			"BI",
			"Dashboard",
			"Analytics"
		],
		"source": "https://looker.com"
	},
	{
		"id": "matplotlib",
		"name": "Matplotlib",
		"description": "Matplotlib is a widely used Python library for creating static, interactive, and animated visualizations. It provides a flexible API for embedding plots into applications and supports output in various formats such as PNG, PDF, SVG, and interactive figures via GUI toolkits. With its MATLAB-like interface, it’s a preferred library for scientists and engineers creating publication-quality figures. It integrates seamlessly with Pandas and NumPy, and supports a wide range of chart types including histograms, scatter plots, bar charts, and more.",
		"category": "Analytics",
		"license": "PSF-based",
		"cost": "Free",
		"size": "34 MB",
		"version": "3.8.0",
		"stars": 17000,
		"last_updated": "2023",
		"os": "Cross-platform",
		"tags": [
			"Python",
			"Visualization",
			"Charts",
			"Graphs",
			"Plotting"
		],
		"source": "https://matplotlib.org"
	},
	{
		"id": "metabase",
		"name": "Metabase",
		"description": "Metabase is an open-source business intelligence tool that helps users ask questions about data and visualize results without writing SQL. It provides an intuitive GUI for querying databases and creating dashboards and charts. Metabase is ideal for teams who want quick access to insights, and it supports embedding analytics in external apps. It works with a variety of databases including PostgreSQL, MySQL, MongoDB, and more.",
		"category": "Analytics",
		"license": "AGPL-3.0",
		"cost": "Free (Pro available)",
		"size": "200 MB",
		"version": "0.47.6",
		"stars": 35000,
		"last_updated": "2024",
		"os": "Cross-platform",
		"tags": [
			"Business Intelligence",
			"Dashboard",
			"SQL",
			"Charts",
			"Self-Service"
		],
		"source": "https://www.metabase.com"
	},
	{
		"id": "metabase",
		"name": "Metabase",
		"description": "Metabase is an open-source BI tool that enables users to easily ask questions about their data and share insights via dashboards. It features a no-code interface, customizable SQL queries, and automated email reports. Metabase is popular with startups and engineering teams for quick self-service analytics.",
		"category": "Analytics",
		"license": "AGPL-3.0",
		"cost": "Free (Enterprise available)",
		"size": "300 MB",
		"version": "0.48.5",
		"stars": 35000,
		"last_updated": "2024",
		"os": "Cross-platform",
		"tags": [
			"BI",
			"Open-source",
			"Dashboards",
			"SQL",
			"Reports"
		],
		"source": "https://www.metabase.com"
	},
	{
		"id": "mlflow",
		"name": "MLflow",
		"description": "MLflow is an open-source platform for managing the machine learning lifecycle, including experimentation, reproducibility, and deployment. It provides components for tracking experiments, packaging code into reproducible runs, and sharing and deploying models. MLflow supports any ML library and integrates with tools like Databricks, Sagemaker, and Kubernetes.",
		"category": "Analytics",
		"license": "Apache-2.0",
		"cost": "Free",
		"size": "80 MB",
		"version": "2.11.1",
		"stars": 17000,
		"last_updated": "2024",
		"os": "Cross-platform",
		"tags": [
			"ML",
			"Experiment Tracking",
			"Deployment",
			"Model Registry"
		],
		"source": "https://mlflow.org"
	},
	{
		"id": "mode",
		"name": "Mode Analytics",
		"description": "Mode is a collaborative analytics platform combining SQL, Python, R, and drag-and-drop reporting tools. It’s designed for fast data exploration and delivery of polished dashboards. With built-in notebook capabilities and automatic data refreshes, Mode enables teams to iterate quickly and share live reports with business stakeholders. It supports versioning, scheduling, and role-based permissions for data governance.",
		"category": "Analytics",
		"license": "Commercial",
		"cost": "Custom pricing",
		"size": "Cloud-based",
		"version": "2024",
		"stars": 3200,
		"last_updated": "2024",
		"os": "Cross-platform",
		"tags": [
			"SQL",
			"Python",
			"Dashboards",
			"Reports",
			"Collaboration"
		],
		"source": "https://mode.com"
	},
	{
		"id": "numpy",
		"name": "NumPy",
		"description": "NumPy is the fundamental package for scientific computing in Python. It provides support for large, multi-dimensional arrays and matrices, along with a comprehensive suite of mathematical functions. NumPy forms the basis for many Python data science libraries, such as Pandas, SciPy, and scikit-learn. It includes capabilities for linear algebra, Fourier transform, and random number generation, making it an essential tool in analytics, especially when performance and memory efficiency are crucial.",
		"category": "Analytics",
		"license": "BSD-3-Clause",
		"cost": "Free",
		"size": "7 MB",
		"version": "1.26.0",
		"stars": 25000,
		"last_updated": "2023",
		"os": "Cross-platform",
		"tags": [
			"Python",
			"Array",
			"Scientific Computing",
			"Math",
			"Data Processing"
		],
		"source": "https://numpy.org"
	},
	{
		"id": "observable",
		"name": "Observable",
		"description": "Observable is a web-based platform for building live, interactive data visualizations using JavaScript and D3. It promotes exploratory analysis and rapid prototyping through reactive notebooks. Widely used by data journalists, developers, and educators, Observable helps teams turn complex data into compelling visual stories.",
		"category": "Analytics",
		"license": "Commercial",
		"cost": "Free (Pro available)",
		"size": "Web-based",
		"version": "2024",
		"stars": 8100,
		"last_updated": "2024",
		"os": "Cross-platform",
		"tags": [
			"Visualization",
			"Notebook",
			"D3.js",
			"JavaScript",
			"Interactive"
		],
		"source": "https://observablehq.com"
	},
	{
		"id": "pandas",
		"name": "Pandas",
		"description": "Pandas is a powerful, open-source Python library for data analysis and manipulation. It provides data structures like Series and DataFrames that are ideal for handling structured data. Pandas supports a wide range of operations including filtering, aggregation, merging, reshaping, and time-series analysis. It's widely used in data science, finance, economics, and statistics. The library integrates well with NumPy, SciPy, and Matplotlib, making it a foundational tool for data analysis in Python.",
		"category": "Analytics",
		"license": "BSD-3-Clause",
		"cost": "Free",
		"size": "12 MB",
		"version": "2.1.1",
		"stars": 40000,
		"last_updated": "2023",
		"os": "Cross-platform",
		"tags": [
			"Python",
			"Data Analysis",
			"DataFrames",
			"ETL",
			"Time Series"
		],
		"source": "https://pandas.pydata.org"
	},
	{
		"id": "periscope",
		"name": "Periscope Data (by Sisense)",
		"description": "Periscope Data, now part of Sisense, is a platform that connects data from various sources and enables advanced analytics via SQL, Python, and R. It allows data teams to build dashboards and deliver insights efficiently. It’s popular for engineering and analytics teams who want powerful querying with custom scripts and advanced visualizations.",
		"category": "Analytics",
		"license": "Commercial",
		"cost": "Custom pricing",
		"size": "Cloud-based",
		"version": "2024",
		"stars": 1900,
		"last_updated": "2024",
		"os": "Cross-platform",
		"tags": [
			"SQL",
			"Python",
			"Dashboards",
			"Embedded Analytics",
			"Sisense"
		],
		"source": "https://www.sisense.com/product/periscope-data"
	},
	{
		"id": "plotly",
		"name": "Plotly",
		"description": "Plotly is an open-source graphing library that enables the creation of interactive, publication-quality graphs online. It supports more than 40 unique chart types including 3D charts, statistical graphs, and geographic maps. Plotly is often used in analytics dashboards and data science applications, particularly for visual storytelling. It integrates seamlessly with popular Python tools like Pandas and Jupyter Notebooks, and it can also be used with R, Julia, and JavaScript. Plotly's interactivity and wide range of charts make it ideal for building analytics interfaces.",
		"category": "Analytics",
		"license": "MIT",
		"cost": "Free",
		"size": "25 MB",
		"version": "5.18.0",
		"stars": 14000,
		"last_updated": "2024",
		"os": "Cross-platform",
		"tags": [
			"Visualization",
			"Charts",
			"Python",
			"Dashboard",
			"Data Science"
		],
		"source": "https://plotly.com/python/"
	},
	{
		"id": "polars",
		"name": "Polars",
		"description": "Polars is a fast, multi-threaded DataFrame library written in Rust with Python bindings. Designed for performance and efficiency, Polars excels with large datasets and supports both eager and lazy APIs. It’s increasingly seen as a modern alternative to Pandas for analytical workloads, especially when scalability and speed are priorities.",
		"category": "Analytics",
		"license": "MIT",
		"cost": "Free",
		"size": "4 MB",
		"version": "0.20.8",
		"stars": 21000,
		"last_updated": "2024",
		"os": "Cross-platform",
		"tags": [
			"DataFrame",
			"Rust",
			"Python",
			"Fast",
			"Big Data"
		],
		"source": "https://pola.rs"
	},
	{
		"id": "powerbi",
		"name": "Microsoft Power BI",
		"description": "Power BI is a suite of business analytics tools by Microsoft that delivers insights throughout an organization. It enables users to connect to hundreds of data sources, simplify data preparation, and drive ad hoc analysis. With Power BI, anyone can create interactive dashboards and reports with rich visualizations. It integrates deeply with Microsoft 365 and Azure services and is widely used in enterprise settings.",
		"category": "Analytics",
		"license": "Commercial",
		"cost": "$10/user/month",
		"size": "Varies",
		"version": "Cloud",
		"stars": 12000,
		"last_updated": "2024",
		"os": "Cross-platform",
		"tags": [
			"Business Intelligence",
			"Visualization",
			"Reports",
			"Microsoft",
			"Enterprise"
		],
		"source": "https://powerbi.microsoft.com"
	},
	{
		"id": "powerbi",
		"name": "Power BI",
		"description": "Power BI by Microsoft is a powerful analytics service that enables users to visualize and share insights from data. It supports integrations with Excel, Azure, and hundreds of other services. Power BI offers robust data modeling, custom visuals, and self-service BI features for both individuals and enterprises.",
		"category": "Analytics",
		"license": "Commercial",
		"cost": "From $10/user/month",
		"size": "550 MB",
		"version": "2024",
		"stars": 6500,
		"last_updated": "2024",
		"os": "Cross-platform",
		"tags": [
			"Microsoft",
			"BI",
			"Visualization",
			"Data Modeling",
			"Dashboard"
		],
		"source": "https://powerbi.microsoft.com"
	},
	{
		"id": "preset",
		"name": "Preset",
		"description": "Preset is a modern cloud-native business intelligence platform built on Apache Superset. It offers managed Superset with team collaboration, single sign-on, row-level security, and streamlined dashboard publishing. Designed for modern data teams, Preset lets users build metrics and dashboards with powerful analytics from cloud warehouses.",
		"category": "Analytics",
		"license": "Commercial",
		"cost": "Free tier available",
		"size": "Cloud-based",
		"version": "2024",
		"stars": 4700,
		"last_updated": "2024",
		"os": "Cross-platform",
		"tags": [
			"BI",
			"Apache Superset",
			"Managed",
			"Dashboards",
			"Cloud"
		],
		"source": "https://preset.io"
	},
	{
		"id": "qlik",
		"name": "Qlik Sense",
		"description": "Qlik Sense is a self-service data analytics platform that empowers users to create flexible, interactive visualizations and dashboards. With its associative data engine and AI-powered insight suggestions, Qlik provides advanced capabilities for data exploration. Qlik supports direct connectivity to numerous data sources and enables drag-and-drop analytics for business users, with a focus on enterprise scalability and governance.",
		"category": "Analytics",
		"license": "Commercial",
		"cost": "Custom pricing",
		"size": "400 MB",
		"version": "2024",
		"stars": 5500,
		"last_updated": "2024",
		"os": "Cross-platform",
		"tags": [
			"BI",
			"Self-Service",
			"AI",
			"Associative Engine",
			"Visualization"
		],
		"source": "https://www.qlik.com"
	},
	{
		"id": "qlik-sense",
		"name": "Qlik Sense",
		"description": "Qlik Sense is Qlik's modern self-service analytics platform built on an associative engine. It allows users to freely explore data without being restricted to predefined hierarchies. With AI-powered insights and drag-and-drop visualization tools, Qlik Sense helps business users and analysts uncover trends and relationships quickly.",
		"category": "Analytics",
		"license": "Commercial",
		"cost": "Custom pricing",
		"size": "Cloud or On-prem",
		"version": "2024",
		"stars": 4900,
		"last_updated": "2024",
		"os": "Cross-platform",
		"tags": [
			"BI",
			"Associative Engine",
			"AI",
			"Self-Service",
			"Visualization"
		],
		"source": "https://www.qlik.com/us/products/qlik-sense"
	},
	{
		"id": "qlikview",
		"name": "QlikView",
		"description": "QlikView is Qlik's classic analytics platform known for in-memory data processing and associative data modeling. It enables rapid dashboard development, robust scripting, and interactive visualizations. Although succeeded by Qlik Sense, QlikView remains in use across enterprises that rely on highly customized BI applications.",
		"category": "Analytics",
		"license": "Commercial",
		"cost": "Custom pricing",
		"size": "Varies",
		"version": "12.80",
		"stars": 4300,
		"last_updated": "2023",
		"os": "Cross-platform",
		"tags": [
			"BI",
			"Associative Model",
			"Dashboards",
			"In-Memory",
			"Qlik"
		],
		"source": "https://www.qlik.com/us/products/qlikview"
	},
	{
		"id": "redash",
		"name": "Redash",
		"description": "Redash is an open-source tool designed for querying databases, visualizing results, and creating dashboards that enable organizations to make data-driven decisions. It supports over 30 data sources and allows users to share queries, visualizations, and dashboards with teammates. Redash’s SQL editor is powerful, with autocomplete and parameterization, and is frequently used in data engineering and analytics teams.",
		"category": "Analytics",
		"license": "BSD-2-Clause",
		"cost": "Free (Hosted available)",
		"size": "180 MB",
		"version": "10.1.0",
		"stars": 23000,
		"last_updated": "2023",
		"os": "Cross-platform",
		"tags": [
			"Data Query",
			"SQL",
			"Dashboards",
			"Visualization",
			"Collaboration"
		],
		"source": "https://redash.io"
	},
	{
		"id": "redash",
		"name": "Redash",
		"description": "Redash is an open-source tool designed to query databases, visualize results, and share dashboards. It supports SQL and NoSQL databases, allowing teams to collaborate around live data. Redash is lightweight and easy to deploy, making it popular in startups and teams that value simplicity and self-hosted analytics.",
		"category": "Analytics",
		"license": "BSD-2-Clause",
		"cost": "Free",
		"size": "150 MB",
		"version": "10.1.0",
		"stars": 24000,
		"last_updated": "2023",
		"os": "Cross-platform",
		"tags": [
			"SQL",
			"Visualization",
			"Dashboard",
			"Open-source",
			"Data Query"
		],
		"source": "https://redash.io"
	},
	{
		"id": "sagemaker",
		"name": "Amazon SageMaker",
		"description": "Amazon SageMaker is a fully managed service that provides every developer and data scientist with tools to build, train, and deploy machine learning models quickly. It includes built-in algorithms, AutoML, model monitoring, and integration with Jupyter and AWS services. It's widely used in enterprise ML pipelines for scalable training and hosting.",
		"category": "Analytics",
		"license": "Commercial",
		"cost": "Pay-as-you-go",
		"size": "Cloud-based",
		"version": "2024",
		"stars": 6200,
		"last_updated": "2024",
		"os": "Cross-platform",
		"tags": [
			"ML",
			"AWS",
			"Model Training",
			"Deployment",
			"AutoML"
		],
		"source": "https://aws.amazon.com/sagemaker/"
	},
	{
		"id": "scikit-learn",
		"name": "Scikit-learn",
		"description": "Scikit-learn is a robust machine learning library for Python that provides simple and efficient tools for data mining and analysis. Built on top of NumPy, SciPy, and Matplotlib, it offers a consistent interface for various supervised and unsupervised learning algorithms, such as classification, regression, clustering, dimensionality reduction, and model selection. It's widely adopted in academia and industry for prototyping ML models and conducting analytical research.",
		"category": "Analytics",
		"license": "BSD-3-Clause",
		"cost": "Free",
		"size": "20 MB",
		"version": "1.4.1",
		"stars": 55000,
		"last_updated": "2024",
		"os": "Cross-platform",
		"tags": [
			"Python",
			"Machine Learning",
			"Data Mining",
			"Modeling",
			"ML"
		],
		"source": "https://scikit-learn.org"
	},
	{
		"id": "seaborn",
		"name": "Seaborn",
		"description": "Seaborn is a Python visualization library based on Matplotlib that provides a high-level interface for drawing attractive and informative statistical graphics. It integrates well with Pandas data structures and supports themes, color palettes, and complex visualization types such as violin plots, heatmaps, and pair plots. Seaborn is particularly known for its ability to create visualizations directly from DataFrames and automatically perform statistical aggregation, making it a go-to tool for quick data exploration.",
		"category": "Analytics",
		"license": "BSD-3-Clause",
		"cost": "Free",
		"size": "2.5 MB",
		"version": "0.12.2",
		"stars": 11000,
		"last_updated": "2023",
		"os": "Cross-platform",
		"tags": [
			"Python",
			"Visualization",
			"Statistical Graphics",
			"Data Analysis"
		],
		"source": "https://seaborn.pydata.org"
	},
	{
		"id": "snowplow",
		"name": "Snowplow Analytics",
		"description": "Snowplow is an open-source event data platform that enables businesses to collect rich behavioral data from applications and websites. It processes this data in real time and streams it to data warehouses like Redshift and BigQuery. Snowplow is often used for building robust analytics pipelines with granular tracking and custom data modeling.",
		"category": "Analytics",
		"license": "Apache-2.0",
		"cost": "Free (Commercial available)",
		"size": "Varies by deployment",
		"version": "2.0",
		"stars": 6700,
		"last_updated": "2024",
		"os": "Cross-platform",
		"tags": [
			"Event Tracking",
			"Behavioral Analytics",
			"ETL",
			"Data Warehouse"
		],
		"source": "https://snowplow.io"
	},
	{
		"id": "soda",
		"name": "Soda",
		"description": "Soda is a data quality and observability platform that helps detect anomalies, monitor freshness, and ensure trust in data pipelines. It provides a declarative language (SodaCL) to define data checks and integrates with modern data stacks like Snowflake, Redshift, and dbt. Soda helps data teams catch issues before they impact stakeholders or dashboards.",
		"category": "Analytics",
		"license": "Commercial",
		"cost": "Free (Pro available)",
		"size": "Cloud-based",
		"version": "2024",
		"stars": 1400,
		"last_updated": "2024",
		"os": "Cross-platform",
		"tags": [
			"Data Quality",
			"Observability",
			"Testing",
			"Pipelines",
			"Monitoring"
		],
		"source": "https://soda.io"
	},
	{
		"id": "statsmodels",
		"name": "Statsmodels",
		"description": "Statsmodels is a Python module that provides classes and functions for the estimation of many different statistical models, as well as for conducting statistical tests and data exploration. It's especially strong in econometrics, time-series analysis, linear regression, generalized linear models, and ANOVA. It's used widely in academic and professional statistics communities for hypothesis testing and exploring data relationships. The library integrates closely with Pandas and NumPy.",
		"category": "Analytics",
		"license": "BSD-3-Clause",
		"cost": "Free",
		"size": "9 MB",
		"version": "0.14.1",
		"stars": 8200,
		"last_updated": "2024",
		"os": "Cross-platform",
		"tags": [
			"Python",
			"Statistics",
			"Econometrics",
			"Regression",
			"GLM"
		],
		"source": "https://www.statsmodels.org"
	},
	{
		"id": "superset",
		"name": "Apache Superset",
		"description": "Apache Superset is a modern, enterprise-ready business intelligence web application. It allows users to explore and visualize their data using a rich set of visualizations, all from a no-code interface. Superset supports SQL-based querying, integration with most SQL-speaking databases, and powerful access control and dashboard features. It's a highly scalable platform designed for data analysts and business users to derive insights without relying on developers.",
		"category": "Analytics",
		"license": "Apache-2.0",
		"cost": "Free",
		"size": "150 MB",
		"version": "3.1.1",
		"stars": 54000,
		"last_updated": "2024",
		"os": "Cross-platform",
		"tags": [
			"Business Intelligence",
			"Visualization",
			"SQL",
			"Dashboard",
			"Web App"
		],
		"source": "https://superset.apache.org"
	},
	{
		"id": "superset",
		"name": "Apache Superset",
		"description": "Apache Superset is a modern data exploration and visualization platform. It supports a wide array of charts, an intuitive UI, and works seamlessly with SQL-based databases. Designed for scalability and flexibility, it empowers teams to analyze data and create dashboards without heavy engineering effort.",
		"category": "Analytics",
		"license": "Apache-2.0",
		"cost": "Free",
		"size": "200 MB",
		"version": "3.0.0",
		"stars": 54000,
		"last_updated": "2024",
		"os": "Cross-platform",
		"tags": [
			"Visualization",
			"BI",
			"Dashboard",
			"Open-source",
			"SQL"
		],
		"source": "https://superset.apache.org"
	},
	{
		"id": "tableau",
		"name": "Tableau",
		"description": "Tableau is a leading commercial analytics platform that enables users to visualize and understand data. With a drag-and-drop interface, users can connect to data sources, build dashboards, and create dynamic, interactive reports. Tableau supports extensive customization and analytics features and is widely adopted across industries for enterprise-level business intelligence and reporting.",
		"category": "Analytics",
		"license": "Commercial",
		"cost": "$70/user/month",
		"size": "500 MB",
		"version": "2024.1",
		"stars": 16000,
		"last_updated": "2024",
		"os": "Cross-platform",
		"tags": [
			"BI",
			"Data Visualization",
			"Reports",
			"Enterprise",
			"Dashboards"
		],
		"source": "https://www.tableau.com"
	},
	{
		"id": "tableau",
		"name": "Tableau",
		"description": "Tableau is a leading data visualization and business intelligence platform used to transform raw data into interactive and shareable dashboards. It supports a wide variety of data sources and offers both desktop and cloud versions. Tableau is widely adopted in enterprises for its powerful visual analytics and intuitive interface.",
		"category": "Analytics",
		"license": "Commercial",
		"cost": "From $70/user/month",
		"size": "1.5 GB",
		"version": "2024.1",
		"stars": 6100,
		"last_updated": "2024",
		"os": "Cross-platform",
		"tags": [
			"BI",
			"Visualization",
			"Dashboards",
			"Enterprise",
			"Analytics"
		],
		"source": "https://www.tableau.com"
	},
	{
		"id": "tibble",
		"name": "tibble",
		"description": "Tibble is a modern reimagining of data frames in R, part of the tidyverse. It provides a cleaner and more consistent experience for working with tabular data. Tibbles retain the feel of data frames but avoid many of their historic quirks, offering better printing, stricter subsetting rules, and improved performance with tidy tools.",
		"category": "Analytics",
		"license": "MIT",
		"cost": "Free",
		"size": "1.5 MB",
		"version": "3.2.1",
		"stars": 1000,
		"last_updated": "2024",
		"os": "Cross-platform",
		"tags": [
			"R",
			"Data Frame",
			"Tidyverse",
			"Tabular Data",
			"Wrangling"
		],
		"source": "https://tibble.tidyverse.org"
	},
	{
		"id": "toucan",
		"name": "Toucan Toco",
		"description": "Toucan Toco is a modern data storytelling platform that enables non-technical users to create interactive visual dashboards. It focuses on guided analytics and user-centric storytelling rather than complex data exploration. Used by companies for operational reporting, it supports embedding and mobile access.",
		"category": "Analytics",
		"license": "Commercial",
		"cost": "Custom pricing",
		"size": "Cloud-based",
		"version": "2024",
		"stars": 900,
		"last_updated": "2024",
		"os": "Cross-platform",
		"tags": [
			"Data Storytelling",
			"Dashboard",
			"Mobile",
			"Reporting",
			"BI"
		],
		"source": "https://toucantoco.com"
	},
	{
		"id": "trifacta",
		"name": "Trifacta",
		"description": "Trifacta, now part of Google Cloud Dataprep, is a data wrangling platform that helps analysts and engineers clean, structure, and enrich raw data for analysis. It offers a visual interface with intelligent suggestions and transformations. Trifacta reduces the time spent on data preparation and integrates well with cloud-based data warehouses like BigQuery and Snowflake.",
		"category": "Analytics",
		"license": "Commercial",
		"cost": "Custom pricing",
		"size": "Cloud-based",
		"version": "2024",
		"stars": 2100,
		"last_updated": "2024",
		"os": "Cross-platform",
		"tags": [
			"Data Cleaning",
			"Wrangling",
			"Cloud",
			"ETL",
			"Preparation"
		],
		"source": "https://www.trifacta.com"
	},
	{
		"id": "visualizejs",
		"name": "Visualize.js",
		"description": "Visualize.js is an embeddable JavaScript framework provided by TIBCO Jaspersoft to integrate reports, dashboards, and visualizations into web applications. It connects directly to Jaspersoft's analytics server and supports custom interaction, filtering, and rendering of complex data visualizations in real time.",
		"category": "Analytics",
		"license": "Commercial",
		"cost": "Custom pricing",
		"size": "150 MB",
		"version": "2024",
		"stars": 1200,
		"last_updated": "2024",
		"os": "Cross-platform",
		"tags": [
			"Embedded BI",
			"JavaScript",
			"Dashboard",
			"Jaspersoft",
			"Visualization"
		],
		"source": "https://community.jaspersoft.com/project/visualizejs"
	},
	{
		"id": "weaviate",
		"name": "Weaviate",
		"description": "Weaviate is an open-source vector database built for machine learning and semantic search use cases. It allows storing, indexing, and querying data using vectors, enabling advanced analytics like similarity search and recommendation systems. Weaviate supports hybrid search (keyword + vector), integrates with transformers, and is used for building intelligent apps on top of unstructured data.",
		"category": "Analytics",
		"license": "BSD-3-Clause",
		"cost": "Free (Cloud available)",
		"size": "200 MB",
		"version": "1.24.7",
		"stars": 8700,
		"last_updated": "2024",
		"os": "Cross-platform",
		"tags": [
			"Vector DB",
			"Semantic Search",
			"ML",
			"Recommendation",
			"Analytics"
		],
		"source": "https://weaviate.io"
	},
	{
		"id": "zebrac",
		"name": "Zebra BI",
		"description": "Zebra BI provides visual and financial reporting components for Microsoft Power BI and Excel. It enables creation of IBCS-compliant reports with waterfall, variance, and small multiple charts, often used in finance and performance reporting. Zebra BI is especially popular in enterprises for financial storytelling and actionable insights.",
		"category": "Analytics",
		"license": "Commercial",
		"cost": "From €4/user/month",
		"size": "Add-on",
		"version": "2024",
		"stars": 1100,
		"last_updated": "2024",
		"os": "Cross-platform",
		"tags": [
			"Finance",
			"Power BI",
			"Reporting",
			"IBCS",
			"Excel"
		],
		"source": "https://zebrabi.com"
	}
]