[
    {
        "id": "altair",
        "name": "Altair",
        "description": "Altair is a declarative statistical visualization library for Python, based on Vega and Vega-Lite. It is designed for quick and effective data exploration and analysis. Users specify the visual encodings and data transformations in a concise syntax, and Altair automatically handles rendering. Altair enforces a strict separation between data and its representation, promoting clean code and reproducible analysis. It’s highly recommended for notebooks and teaching purposes.",
        "category": "Analytics",
        "license": "BSD-3-Clause",
        "cost": "Free",
        "size": "1.1 MB",
        "version": "5.1.0",
        "stars": 8500,
        "last_updated": "2024",
        "os": "Cross-platform",
        "tags": [
            "Visualization",
            "Declarative",
            "Statistics",
            "Python",
            "Data Exploration"
        ],
        "source": "https://altair-viz.github.io"
    },
    {
        "id": "aws-quicksight",
        "name": "Amazon QuickSight",
        "description": "Amazon QuickSight is a cloud-powered business intelligence service by AWS that allows creating and publishing interactive dashboards. It connects to various AWS services and databases and supports machine learning insights, forecasting, and natural language querying. It’s scalable and suitable for organizations using AWS infrastructure.",
        "category": "Analytics",
        "license": "Commercial",
        "cost": "Starts at $5/user/month",
        "size": "Cloud-based",
        "version": "2024",
        "stars": 3900,
        "last_updated": "2024",
        "os": "Cross-platform",
        "tags": [
            "AWS",
            "Dashboard",
            "ML Insights",
            "BI",
            "Cloud"
        ],
        "source": "https://aws.amazon.com/quicksight/"
    },
    {
        "id": "bokeh",
        "name": "Bokeh",
        "description": "Bokeh is an interactive visualization library that targets modern web browsers for presentation. It provides elegant, concise construction of versatile graphics and delivers high-performance interactivity over large or streaming datasets. Bokeh is used to build complex statistical plots quickly and intuitively. It can generate standalone HTML files or integrate with Flask/Django apps, making it useful for embedding dashboards and interactive reports. With support for linked brushing and streaming data, it is ideal for real-time analytics systems.",
        "category": "Analytics",
        "license": "BSD-3-Clause",
        "cost": "Free",
        "size": "18 MB",
        "version": "3.3.4",
        "stars": 18000,
        "last_updated": "2024",
        "os": "Cross-platform",
        "tags": [
            "Python",
            "Visualization",
            "Interactive",
            "Streaming",
            "Charts"
        ],
        "source": "https://bokeh.org"
    },
    {
        "id": "chartio",
        "name": "Chartio (Archived)",
        "description": "Chartio was a powerful cloud-based BI tool designed for intuitive drag-and-drop dashboard creation. It supported a wide range of data sources and complex SQL queries with ease. Though discontinued, it was praised for usability and paved the way for modern embedded analytics platforms.",
        "category": "Analytics",
        "license": "Commercial",
        "cost": "Discontinued",
        "size": "Cloud-based",
        "version": "2022",
        "stars": 2800,
        "last_updated": "2022",
        "os": "Cross-platform",
        "tags": [
            "BI",
            "Dashboards",
            "SQL",
            "Cloud",
            "Archived"
        ],
        "source": "https://chartio.com"
    },
    {
        "id": "cubejs",
        "name": "Cube.js",
        "description": "Cube.js is an open-source headless BI tool for building custom analytics applications. It acts as a data modeling layer that connects to data warehouses and exposes metrics via APIs for frontend consumption. Developers use Cube.js to embed charts and dashboards in custom applications with complete control over the UI and business logic.",
        "category": "Analytics",
        "license": "Apache-2.0",
        "cost": "Free (Cloud available)",
        "size": "40 MB",
        "version": "0.34.55",
        "stars": 16000,
        "last_updated": "2024",
        "os": "Cross-platform",
        "tags": [
            "Headless BI",
            "API",
            "Data Modeling",
            "Embedded Analytics"
        ],
        "source": "https://cube.dev"
    },
    {
        "id": "dash",
        "name": "Dash",
        "description": "Dash is a Python framework for building data-driven, interactive web applications. Developed by Plotly, it allows users to create beautiful dashboards using pure Python without needing to know JavaScript or front-end frameworks. Dash is particularly useful in analytics, where data scientists and analysts can deploy ML models, charts, and interactive tables as web apps. It integrates tightly with Plotly for visualizations and Flask for backend routing.",
        "category": "Analytics",
        "license": "MIT",
        "cost": "Free (Pro available)",
        "size": "30 MB",
        "version": "2.16.0",
        "stars": 19000,
        "last_updated": "2024",
        "os": "Cross-platform",
        "tags": [
            "Dashboard",
            "Web App",
            "Visualization",
            "Python",
            "Data Science"
        ],
        "source": "https://dash.plotly.com"
    },
    {
        "id": "databricks",
        "name": "Databricks",
        "description": "Databricks is a unified analytics platform built around Apache Spark. It offers collaborative notebooks, data lake integration, ML model management, and support for SQL, Python, R, and Scala. Databricks simplifies big data processing, analytics, and AI model deployment on the cloud, making it a top choice for large-scale enterprise use cases.",
        "category": "Analytics",
        "license": "Commercial",
        "cost": "Pay-as-you-go",
        "size": "Cloud-based",
        "version": "2024",
        "stars": 10000,
        "last_updated": "2024",
        "os": "Cross-platform",
        "tags": [
            "Spark",
            "Data Lake",
            "ML",
            "Big Data",
            "Cloud"
        ],
        "source": "https://databricks.com"
    },
    {
        "id": "dataiku",
        "name": "Dataiku",
        "description": "Dataiku is a collaborative data science and machine learning platform for building and deploying models at scale. It offers visual tools, notebooks, AutoML, and MLOps features for teams to manage workflows end-to-end. It’s commonly used in enterprises for data preparation, model training, and integration into production systems.",
        "category": "Analytics",
        "license": "Commercial",
        "cost": "Custom pricing",
        "size": "Cloud or On-prem",
        "version": "12.0",
        "stars": 2700,
        "last_updated": "2024",
        "os": "Cross-platform",
        "tags": [
            "ML",
            "AutoML",
            "Data Prep",
            "MLOps",
            "Enterprise"
        ],
        "source": "https://www.dataiku.com"
    },
    {
        "id": "datawrapper",
        "name": "Datawrapper",
        "description": "Datawrapper is an online tool that enables users to create charts, maps, and tables without writing code. It’s widely used by journalists, data teams, and communication professionals to publish responsive visualizations. With customizable templates, export options, and accessibility features, it’s a go-to solution for publishing clean and readable charts on the web.",
        "category": "Analytics",
        "license": "Commercial",
        "cost": "Free with paid plans",
        "size": "Web-based",
        "version": "2024",
        "stars": 2900,
        "last_updated": "2024",
        "os": "Cross-platform",
        "tags": [
            "Charts",
            "Maps",
            "Visualization",
            "Publishing",
            "No-Code"
        ],
        "source": "https://www.datawrapper.de"
    },
    {
        "id": "deeplearning-keras",
        "name": "Keras",
        "description": "Keras is a deep learning API written in Python and running on top of TensorFlow. It simplifies the process of building neural networks and is widely adopted in academia and industry for quick experimentation. Keras offers user-friendly APIs, modular architecture, and seamless multi-GPU training support, making it ideal for analytics and AI development workflows.",
        "category": "Analytics",
        "license": "Apache-2.0",
        "cost": "Free",
        "size": "10 MB",
        "version": "2.15.0",
        "stars": 58000,
        "last_updated": "2024",
        "os": "Cross-platform",
        "tags": [
            "Deep Learning",
            "Neural Networks",
            "TensorFlow",
            "AI",
            "Python"
        ],
        "source": "https://keras.io"
    },
    {
        "id": "deepnote",
        "name": "Deepnote",
        "description": "Deepnote is a collaborative data science notebook designed for teams. It supports real-time collaboration, SQL cells, environment management, and integrations with cloud data warehouses. Deepnote is commonly used in data-driven teams to combine code, rich text, and visualizations into interactive documents.",
        "category": "Analytics",
        "license": "Commercial",
        "cost": "Free with paid plans",
        "size": "Cloud-based",
        "version": "2024",
        "stars": 3100,
        "last_updated": "2024",
        "os": "Cross-platform",
        "tags": [
            "Notebooks",
            "Collaboration",
            "Data Science",
            "SQL",
            "Visualization"
        ],
        "source": "https://deepnote.com"
    },
    {
        "id": "domo",
        "name": "Domo",
        "description": "Domo is a cloud-native business intelligence platform designed to provide real-time insights across business functions. It allows for integration of multiple data sources, custom app development, and interactive dashboard creation. Domo includes features like alerting, mobile access, embedded analytics, and powerful sharing options. It's primarily used by enterprises for executive dashboards and collaborative analytics.",
        "category": "Analytics",
        "license": "Commercial",
        "cost": "Custom pricing",
        "size": "Cloud-based",
        "version": "2024",
        "stars": 3200,
        "last_updated": "2024",
        "os": "Cross-platform",
        "tags": [
            "Business Intelligence",
            "Cloud",
            "Mobile",
            "Dashboards",
            "Collaboration"
        ],
        "source": "https://www.domo.com"
    },
    {
        "id": "duckdb",
        "name": "DuckDB",
        "description": "DuckDB is an in-process SQL OLAP database management system. Designed for analytical workloads, it excels at complex queries over large datasets and integrates directly into applications via Python, R, or C++ APIs. DuckDB is lightweight, embeddable, and highly performant — often referred to as the SQLite for analytics.",
        "category": "Analytics",
        "license": "MIT",
        "cost": "Free",
        "size": "12 MB",
        "version": "0.10.2",
        "stars": 11000,
        "last_updated": "2024",
        "os": "Cross-platform",
        "tags": [
            "SQL",
            "OLAP",
            "In-Memory",
            "Embedded",
            "Analytics"
        ],
        "source": "https://duckdb.org"
    },
    {
        "id": "dvc",
        "name": "DVC",
        "description": "DVC (Data Version Control) is an open-source tool for versioning datasets and machine learning models. It integrates with Git and allows teams to manage large data files, track experiments, and build reproducible data pipelines. DVC is particularly useful for collaborative ML workflows where tracking data changes and results is critical.",
        "category": "Analytics",
        "license": "Apache-2.0",
        "cost": "Free (Enterprise available)",
        "size": "30 MB",
        "version": "3.46.0",
        "stars": 12000,
        "last_updated": "2024",
        "os": "Cross-platform",
        "tags": [
            "Version Control",
            "ML",
            "Experiment Tracking",
            "Pipelines",
            "Git"
        ],
        "source": "https://dvc.org"
    },
    {
        "id": "gooddata",
        "name": "GoodData",
        "description": "GoodData is a business intelligence platform that allows for the creation of scalable, embedded analytics and dashboards. It provides a headless BI engine with declarative metrics, semantic modeling, and a GraphQL API. GoodData is popular for building data products and integrating analytics into SaaS apps and portals.",
        "category": "Analytics",
        "license": "Commercial",
        "cost": "Free tier available",
        "size": "Cloud-based",
        "version": "2024",
        "stars": 1200,
        "last_updated": "2024",
        "os": "Cross-platform",
        "tags": [
            "Embedded BI",
            "GraphQL",
            "Headless",
            "Dashboards",
            "SaaS"
        ],
        "source": "https://www.gooddata.com"
    },
    {
        "id": "grafana",
        "name": "Grafana",
        "description": "Grafana is an open-source analytics and interactive visualization web application. It provides charts, graphs, and alerts for the web when connected to supported data sources. Grafana is most commonly used for monitoring applications and systems, especially when used with time-series databases like Prometheus, InfluxDB, or Graphite. It's highly customizable with plugins and supports complex querying with templating features.",
        "category": "Analytics",
        "license": "AGPL-3.0",
        "cost": "Free (Cloud/Enterprise available)",
        "size": "100 MB",
        "version": "10.2.1",
        "stars": 57000,
        "last_updated": "2024",
        "os": "Cross-platform",
        "tags": [
            "Monitoring",
            "Dashboards",
            "Time-Series",
            "Metrics",
            "Visualization"
        ],
        "source": "https://grafana.com"
    },
    {
        "id": "h2o",
        "name": "H2O.ai",
        "description": "H2O is an open-source machine learning and predictive analytics platform that supports distributed computing. It provides scalable algorithms for classification, regression, and clustering. H2O supports R, Python, and REST APIs, and it powers AutoML workflows for building models efficiently across large datasets. It's used in industries like finance, healthcare, and marketing.",
        "category": "Analytics",
        "license": "Apache-2.0",
        "cost": "Free",
        "size": "200 MB",
        "version": "3.42.0.2",
        "stars": 6300,
        "last_updated": "2024",
        "os": "Cross-platform",
        "tags": [
            "Machine Learning",
            "AutoML",
            "Big Data",
            "R",
            "Python"
        ],
        "source": "https://www.h2o.ai"
    },
    {
        "id": "hex",
        "name": "Hex",
        "description": "Hex is a modern data platform that allows users to explore, analyze, and share data in collaborative notebooks. It combines SQL, Python, and no-code cells to build powerful, interactive data stories and dashboards. Built for teams, Hex supports branching, real-time collaboration, and publishing with interactive controls. It’s used by data science and analytics teams for prototyping and delivering insights fast.",
        "category": "Analytics",
        "license": "Commercial",
        "cost": "Custom pricing",
        "size": "Cloud-based",
        "version": "2024",
        "stars": 2400,
        "last_updated": "2024",
        "os": "Cross-platform",
        "tags": [
            "Notebooks",
            "Python",
            "SQL",
            "Collaboration",
            "Dashboards"
        ],
        "source": "https://hex.tech"
    },
    {
        "id": "holoviews",
        "name": "HoloViews",
        "description": "HoloViews is a Python library for data exploration and visualization. It allows users to build complex, interactive plots with minimal code by linking data directly to visual elements. HoloViews integrates tightly with Pandas and supports backends like Bokeh and Matplotlib. It’s well-suited for scientific computing, dashboards, and working with large datasets in notebooks.",
        "category": "Analytics",
        "license": "BSD-3-Clause",
        "cost": "Free",
        "size": "4 MB",
        "version": "1.18.3",
        "stars": 2500,
        "last_updated": "2024",
        "os": "Cross-platform",
        "tags": [
            "Visualization",
            "Python",
            "Bokeh",
            "Notebook",
            "Data Exploration"
        ],
        "source": "https://holoviews.org"
    },
    {
        "id": "jetbrains-datalore",
        "name": "JetBrains Datalore",
        "description": "Datalore is a collaborative data science platform by JetBrains for analyzing and visualizing data in Python. It features smart coding assistance, real-time collaboration, version control, and support for SQL and Python notebooks. It’s suitable for teams working on data analysis, exploration, and machine learning with seamless deployment via the web.",
        "category": "Analytics",
        "license": "Commercial",
        "cost": "Free plan available",
        "size": "Cloud-based",
        "version": "2024",
        "stars": 1800,
        "last_updated": "2024",
        "os": "Cross-platform",
        "tags": [
            "Python",
            "Notebook",
            "Collaboration",
            "JetBrains",
            "Analytics"
        ],
        "source": "https://datalore.jetbrains.com"
    },
    {
        "id": "kibana",
        "name": "Kibana",
        "description": "Kibana is a data visualization dashboard for Elasticsearch. It provides powerful visual exploration and analysis tools for log and time-series analytics, application monitoring, and operational intelligence use cases. Users can build histograms, line graphs, pie charts, and maps. Kibana integrates tightly with the ELK stack (Elasticsearch, Logstash, Kibana) and is often used for observability and security analytics.",
        "category": "Analytics",
        "license": "Elastic License",
        "cost": "Free (with Elastic Stack)",
        "size": "300 MB",
        "version": "8.12.0",
        "stars": 18000,
        "last_updated": "2024",
        "os": "Cross-platform",
        "tags": [
            "Log Analysis",
            "Monitoring",
            "Elasticsearch",
            "Dashboards",
            "Security"
        ],
        "source": "https://www.elastic.co/kibana"
    },
    {
        "id": "knime",
        "name": "KNIME",
        "description": "KNIME is an open-source platform for data analytics, reporting, and integration. It provides a visual workflow interface to create end-to-end data pipelines, including preprocessing, modeling, and visualization. KNIME supports integrations with Python, R, Spark, and various machine learning libraries. It is popular in research, finance, and pharmaceutical industries for its no-code and extensible architecture.",
        "category": "Analytics",
        "license": "GPL-3.0",
        "cost": "Free (Server edition available)",
        "size": "300 MB",
        "version": "5.2.1",
        "stars": 5200,
        "last_updated": "2024",
        "os": "Cross-platform",
        "tags": [
            "Visual Programming",
            "Data Science",
            "Workflow",
            "ETL",
            "ML"
        ],
        "source": "https://www.knime.com"
    },
    {
        "id": "lightdash",
        "name": "Lightdash",
        "description": "Lightdash is an open-source BI and analytics platform built on top of dbt. It lets analysts turn dbt projects into fully-featured BI dashboards with metrics, visualizations, and sharing features. Designed to keep analytics in code, Lightdash allows for real-time data exploration and democratizes access to insights while maintaining developer best practices.",
        "category": "Analytics",
        "license": "MIT",
        "cost": "Free (Cloud available)",
        "size": "90 MB",
        "version": "1.7.0",
        "stars": 4400,
        "last_updated": "2024",
        "os": "Cross-platform",
        "tags": [
            "dbt",
            "Metrics Layer",
            "Open-source",
            "Dashboard",
            "BI"
        ],
        "source": "https://lightdash.com"
    },
    {
        "id": "looker",
        "name": "Looker",
        "description": "Looker is a modern data platform and business intelligence tool acquired by Google Cloud. It allows companies to analyze and explore data through a web-based interface using LookML, a modeling language for describing relationships and metrics in SQL. Looker integrates seamlessly with BigQuery, Snowflake, Redshift, and other databases, and it's commonly used to deliver embedded analytics and data-driven workflows.",
        "category": "Analytics",
        "license": "Commercial",
        "cost": "Custom pricing",
        "size": "Cloud-based",
        "version": "2024",
        "stars": 6500,
        "last_updated": "2024",
        "os": "Cross-platform",
        "tags": [
            "Business Intelligence",
            "LookML",
            "Google Cloud",
            "Modeling",
            "Embedded Analytics"
        ],
        "source": "https://looker.com"
    },
    {
        "id": "looker",
        "name": "Looker",
        "description": "Looker is a modern business intelligence platform acquired by Google Cloud. It provides a centralized semantic modeling layer via LookML and allows users to build consistent dashboards, reports, and explore real-time data. Looker integrates deeply with cloud data warehouses and is widely used for scalable, governed analytics.",
        "category": "Analytics",
        "license": "Commercial",
        "cost": "Custom pricing",
        "size": "Cloud-based",
        "version": "2024",
        "stars": 4800,
        "last_updated": "2024",
        "os": "Cross-platform",
        "tags": [
            "Google Cloud",
            "Modeling",
            "BI",
            "Dashboard",
            "Analytics"
        ],
        "source": "https://looker.com"
    },
    {
        "id": "matplotlib",
        "name": "Matplotlib",
        "description": "Matplotlib is a widely used Python library for creating static, interactive, and animated visualizations. It provides a flexible API for embedding plots into applications and supports output in various formats such as PNG, PDF, SVG, and interactive figures via GUI toolkits. With its MATLAB-like interface, it’s a preferred library for scientists and engineers creating publication-quality figures. It integrates seamlessly with Pandas and NumPy, and supports a wide range of chart types including histograms, scatter plots, bar charts, and more.",
        "category": "Analytics",
        "license": "PSF-based",
        "cost": "Free",
        "size": "34 MB",
        "version": "3.8.0",
        "stars": 17000,
        "last_updated": "2023",
        "os": "Cross-platform",
        "tags": [
            "Python",
            "Visualization",
            "Charts",
            "Graphs",
            "Plotting"
        ],
        "source": "https://matplotlib.org"
    },
    {
        "id": "metabase",
        "name": "Metabase",
        "description": "Metabase is an open-source business intelligence tool that helps users ask questions about data and visualize results without writing SQL. It provides an intuitive GUI for querying databases and creating dashboards and charts. Metabase is ideal for teams who want quick access to insights, and it supports embedding analytics in external apps. It works with a variety of databases including PostgreSQL, MySQL, MongoDB, and more.",
        "category": "Analytics",
        "license": "AGPL-3.0",
        "cost": "Free (Pro available)",
        "size": "200 MB",
        "version": "0.47.6",
        "stars": 35000,
        "last_updated": "2024",
        "os": "Cross-platform",
        "tags": [
            "Business Intelligence",
            "Dashboard",
            "SQL",
            "Charts",
            "Self-Service"
        ],
        "source": "https://www.metabase.com"
    },
    {
        "id": "metabase",
        "name": "Metabase",
        "description": "Metabase is an open-source BI tool that enables users to easily ask questions about their data and share insights via dashboards. It features a no-code interface, customizable SQL queries, and automated email reports. Metabase is popular with startups and engineering teams for quick self-service analytics.",
        "category": "Analytics",
        "license": "AGPL-3.0",
        "cost": "Free (Enterprise available)",
        "size": "300 MB",
        "version": "0.48.5",
        "stars": 35000,
        "last_updated": "2024",
        "os": "Cross-platform",
        "tags": [
            "BI",
            "Open-source",
            "Dashboards",
            "SQL",
            "Reports"
        ],
        "source": "https://www.metabase.com"
    },
    {
        "id": "mlflow",
        "name": "MLflow",
        "description": "MLflow is an open-source platform for managing the machine learning lifecycle, including experimentation, reproducibility, and deployment. It provides components for tracking experiments, packaging code into reproducible runs, and sharing and deploying models. MLflow supports any ML library and integrates with tools like Databricks, Sagemaker, and Kubernetes.",
        "category": "Analytics",
        "license": "Apache-2.0",
        "cost": "Free",
        "size": "80 MB",
        "version": "2.11.1",
        "stars": 17000,
        "last_updated": "2024",
        "os": "Cross-platform",
        "tags": [
            "ML",
            "Experiment Tracking",
            "Deployment",
            "Model Registry"
        ],
        "source": "https://mlflow.org"
    },
    {
        "id": "mode",
        "name": "Mode Analytics",
        "description": "Mode is a collaborative analytics platform combining SQL, Python, R, and drag-and-drop reporting tools. It’s designed for fast data exploration and delivery of polished dashboards. With built-in notebook capabilities and automatic data refreshes, Mode enables teams to iterate quickly and share live reports with business stakeholders. It supports versioning, scheduling, and role-based permissions for data governance.",
        "category": "Analytics",
        "license": "Commercial",
        "cost": "Custom pricing",
        "size": "Cloud-based",
        "version": "2024",
        "stars": 3200,
        "last_updated": "2024",
        "os": "Cross-platform",
        "tags": [
            "SQL",
            "Python",
            "Dashboards",
            "Reports",
            "Collaboration"
        ],
        "source": "https://mode.com"
    },
    {
        "id": "numpy",
        "name": "NumPy",
        "description": "NumPy is the fundamental package for scientific computing in Python. It provides support for large, multi-dimensional arrays and matrices, along with a comprehensive suite of mathematical functions. NumPy forms the basis for many Python data science libraries, such as Pandas, SciPy, and scikit-learn. It includes capabilities for linear algebra, Fourier transform, and random number generation, making it an essential tool in analytics, especially when performance and memory efficiency are crucial.",
        "category": "Analytics",
        "license": "BSD-3-Clause",
        "cost": "Free",
        "size": "7 MB",
        "version": "1.26.0",
        "stars": 25000,
        "last_updated": "2023",
        "os": "Cross-platform",
        "tags": [
            "Python",
            "Array",
            "Scientific Computing",
            "Math",
            "Data Processing"
        ],
        "source": "https://numpy.org"
    },
    {
        "id": "observable",
        "name": "Observable",
        "description": "Observable is a web-based platform for building live, interactive data visualizations using JavaScript and D3. It promotes exploratory analysis and rapid prototyping through reactive notebooks. Widely used by data journalists, developers, and educators, Observable helps teams turn complex data into compelling visual stories.",
        "category": "Analytics",
        "license": "Commercial",
        "cost": "Free (Pro available)",
        "size": "Web-based",
        "version": "2024",
        "stars": 8100,
        "last_updated": "2024",
        "os": "Cross-platform",
        "tags": [
            "Visualization",
            "Notebook",
            "D3.js",
            "JavaScript",
            "Interactive"
        ],
        "source": "https://observablehq.com"
    },
    {
        "id": "pandas",
        "name": "Pandas",
        "description": "Pandas is a powerful, open-source Python library for data analysis and manipulation. It provides data structures like Series and DataFrames that are ideal for handling structured data. Pandas supports a wide range of operations including filtering, aggregation, merging, reshaping, and time-series analysis. It's widely used in data science, finance, economics, and statistics. The library integrates well with NumPy, SciPy, and Matplotlib, making it a foundational tool for data analysis in Python.",
        "category": "Analytics",
        "license": "BSD-3-Clause",
        "cost": "Free",
        "size": "12 MB",
        "version": "2.1.1",
        "stars": 40000,
        "last_updated": "2023",
        "os": "Cross-platform",
        "tags": [
            "Python",
            "Data Analysis",
            "DataFrames",
            "ETL",
            "Time Series"
        ],
        "source": "https://pandas.pydata.org"
    },
    {
        "id": "periscope",
        "name": "Periscope Data (by Sisense)",
        "description": "Periscope Data, now part of Sisense, is a platform that connects data from various sources and enables advanced analytics via SQL, Python, and R. It allows data teams to build dashboards and deliver insights efficiently. It’s popular for engineering and analytics teams who want powerful querying with custom scripts and advanced visualizations.",
        "category": "Analytics",
        "license": "Commercial",
        "cost": "Custom pricing",
        "size": "Cloud-based",
        "version": "2024",
        "stars": 1900,
        "last_updated": "2024",
        "os": "Cross-platform",
        "tags": [
            "SQL",
            "Python",
            "Dashboards",
            "Embedded Analytics",
            "Sisense"
        ],
        "source": "https://www.sisense.com/product/periscope-data"
    },
    {
        "id": "plotly",
        "name": "Plotly",
        "description": "Plotly is an open-source graphing library that enables the creation of interactive, publication-quality graphs online. It supports more than 40 unique chart types including 3D charts, statistical graphs, and geographic maps. Plotly is often used in analytics dashboards and data science applications, particularly for visual storytelling. It integrates seamlessly with popular Python tools like Pandas and Jupyter Notebooks, and it can also be used with R, Julia, and JavaScript. Plotly's interactivity and wide range of charts make it ideal for building analytics interfaces.",
        "category": "Analytics",
        "license": "MIT",
        "cost": "Free",
        "size": "25 MB",
        "version": "5.18.0",
        "stars": 14000,
        "last_updated": "2024",
        "os": "Cross-platform",
        "tags": [
            "Visualization",
            "Charts",
            "Python",
            "Dashboard",
            "Data Science"
        ],
        "source": "https://plotly.com/python/"
    },
    {
        "id": "polars",
        "name": "Polars",
        "description": "Polars is a fast, multi-threaded DataFrame library written in Rust with Python bindings. Designed for performance and efficiency, Polars excels with large datasets and supports both eager and lazy APIs. It’s increasingly seen as a modern alternative to Pandas for analytical workloads, especially when scalability and speed are priorities.",
        "category": "Analytics",
        "license": "MIT",
        "cost": "Free",
        "size": "4 MB",
        "version": "0.20.8",
        "stars": 21000,
        "last_updated": "2024",
        "os": "Cross-platform",
        "tags": [
            "DataFrame",
            "Rust",
            "Python",
            "Fast",
            "Big Data"
        ],
        "source": "https://pola.rs"
    },
    {
        "id": "powerbi",
        "name": "Microsoft Power BI",
        "description": "Power BI is a suite of business analytics tools by Microsoft that delivers insights throughout an organization. It enables users to connect to hundreds of data sources, simplify data preparation, and drive ad hoc analysis. With Power BI, anyone can create interactive dashboards and reports with rich visualizations. It integrates deeply with Microsoft 365 and Azure services and is widely used in enterprise settings.",
        "category": "Analytics",
        "license": "Commercial",
        "cost": "$10/user/month",
        "size": "Varies",
        "version": "Cloud",
        "stars": 12000,
        "last_updated": "2024",
        "os": "Cross-platform",
        "tags": [
            "Business Intelligence",
            "Visualization",
            "Reports",
            "Microsoft",
            "Enterprise"
        ],
        "source": "https://powerbi.microsoft.com"
    },
    {
        "id": "powerbi",
        "name": "Power BI",
        "description": "Power BI by Microsoft is a powerful analytics service that enables users to visualize and share insights from data. It supports integrations with Excel, Azure, and hundreds of other services. Power BI offers robust data modeling, custom visuals, and self-service BI features for both individuals and enterprises.",
        "category": "Analytics",
        "license": "Commercial",
        "cost": "From $10/user/month",
        "size": "550 MB",
        "version": "2024",
        "stars": 6500,
        "last_updated": "2024",
        "os": "Cross-platform",
        "tags": [
            "Microsoft",
            "BI",
            "Visualization",
            "Data Modeling",
            "Dashboard"
        ],
        "source": "https://powerbi.microsoft.com"
    },
    {
        "id": "preset",
        "name": "Preset",
        "description": "Preset is a modern cloud-native business intelligence platform built on Apache Superset. It offers managed Superset with team collaboration, single sign-on, row-level security, and streamlined dashboard publishing. Designed for modern data teams, Preset lets users build metrics and dashboards with powerful analytics from cloud warehouses.",
        "category": "Analytics",
        "license": "Commercial",
        "cost": "Free tier available",
        "size": "Cloud-based",
        "version": "2024",
        "stars": 4700,
        "last_updated": "2024",
        "os": "Cross-platform",
        "tags": [
            "BI",
            "Apache Superset",
            "Managed",
            "Dashboards",
            "Cloud"
        ],
        "source": "https://preset.io"
    },
    {
        "id": "qlik",
        "name": "Qlik Sense",
        "description": "Qlik Sense is a self-service data analytics platform that empowers users to create flexible, interactive visualizations and dashboards. With its associative data engine and AI-powered insight suggestions, Qlik provides advanced capabilities for data exploration. Qlik supports direct connectivity to numerous data sources and enables drag-and-drop analytics for business users, with a focus on enterprise scalability and governance.",
        "category": "Analytics",
        "license": "Commercial",
        "cost": "Custom pricing",
        "size": "400 MB",
        "version": "2024",
        "stars": 5500,
        "last_updated": "2024",
        "os": "Cross-platform",
        "tags": [
            "BI",
            "Self-Service",
            "AI",
            "Associative Engine",
            "Visualization"
        ],
        "source": "https://www.qlik.com"
    },
    {
        "id": "qlik-sense",
        "name": "Qlik Sense",
        "description": "Qlik Sense is Qlik's modern self-service analytics platform built on an associative engine. It allows users to freely explore data without being restricted to predefined hierarchies. With AI-powered insights and drag-and-drop visualization tools, Qlik Sense helps business users and analysts uncover trends and relationships quickly.",
        "category": "Analytics",
        "license": "Commercial",
        "cost": "Custom pricing",
        "size": "Cloud or On-prem",
        "version": "2024",
        "stars": 4900,
        "last_updated": "2024",
        "os": "Cross-platform",
        "tags": [
            "BI",
            "Associative Engine",
            "AI",
            "Self-Service",
            "Visualization"
        ],
        "source": "https://www.qlik.com/us/products/qlik-sense"
    },
    {
        "id": "qlikview",
        "name": "QlikView",
        "description": "QlikView is Qlik's classic analytics platform known for in-memory data processing and associative data modeling. It enables rapid dashboard development, robust scripting, and interactive visualizations. Although succeeded by Qlik Sense, QlikView remains in use across enterprises that rely on highly customized BI applications.",
        "category": "Analytics",
        "license": "Commercial",
        "cost": "Custom pricing",
        "size": "Varies",
        "version": "12.80",
        "stars": 4300,
        "last_updated": "2023",
        "os": "Cross-platform",
        "tags": [
            "BI",
            "Associative Model",
            "Dashboards",
            "In-Memory",
            "Qlik"
        ],
        "source": "https://www.qlik.com/us/products/qlikview"
    },
    {
        "id": "redash",
        "name": "Redash",
        "description": "Redash is an open-source tool designed for querying databases, visualizing results, and creating dashboards that enable organizations to make data-driven decisions. It supports over 30 data sources and allows users to share queries, visualizations, and dashboards with teammates. Redash’s SQL editor is powerful, with autocomplete and parameterization, and is frequently used in data engineering and analytics teams.",
        "category": "Analytics",
        "license": "BSD-2-Clause",
        "cost": "Free (Hosted available)",
        "size": "180 MB",
        "version": "10.1.0",
        "stars": 23000,
        "last_updated": "2023",
        "os": "Cross-platform",
        "tags": [
            "Data Query",
            "SQL",
            "Dashboards",
            "Visualization",
            "Collaboration"
        ],
        "source": "https://redash.io"
    },
    {
        "id": "redash",
        "name": "Redash",
        "description": "Redash is an open-source tool designed to query databases, visualize results, and share dashboards. It supports SQL and NoSQL databases, allowing teams to collaborate around live data. Redash is lightweight and easy to deploy, making it popular in startups and teams that value simplicity and self-hosted analytics.",
        "category": "Analytics",
        "license": "BSD-2-Clause",
        "cost": "Free",
        "size": "150 MB",
        "version": "10.1.0",
        "stars": 24000,
        "last_updated": "2023",
        "os": "Cross-platform",
        "tags": [
            "SQL",
            "Visualization",
            "Dashboard",
            "Open-source",
            "Data Query"
        ],
        "source": "https://redash.io"
    },
    {
        "id": "sagemaker",
        "name": "Amazon SageMaker",
        "description": "Amazon SageMaker is a fully managed service that provides every developer and data scientist with tools to build, train, and deploy machine learning models quickly. It includes built-in algorithms, AutoML, model monitoring, and integration with Jupyter and AWS services. It's widely used in enterprise ML pipelines for scalable training and hosting.",
        "category": "Analytics",
        "license": "Commercial",
        "cost": "Pay-as-you-go",
        "size": "Cloud-based",
        "version": "2024",
        "stars": 6200,
        "last_updated": "2024",
        "os": "Cross-platform",
        "tags": [
            "ML",
            "AWS",
            "Model Training",
            "Deployment",
            "AutoML"
        ],
        "source": "https://aws.amazon.com/sagemaker/"
    },
    {
        "id": "scikit-learn",
        "name": "Scikit-learn",
        "description": "Scikit-learn is a robust machine learning library for Python that provides simple and efficient tools for data mining and analysis. Built on top of NumPy, SciPy, and Matplotlib, it offers a consistent interface for various supervised and unsupervised learning algorithms, such as classification, regression, clustering, dimensionality reduction, and model selection. It's widely adopted in academia and industry for prototyping ML models and conducting analytical research.",
        "category": "Analytics",
        "license": "BSD-3-Clause",
        "cost": "Free",
        "size": "20 MB",
        "version": "1.4.1",
        "stars": 55000,
        "last_updated": "2024",
        "os": "Cross-platform",
        "tags": [
            "Python",
            "Machine Learning",
            "Data Mining",
            "Modeling",
            "ML"
        ],
        "source": "https://scikit-learn.org"
    },
    {
        "id": "seaborn",
        "name": "Seaborn",
        "description": "Seaborn is a Python visualization library based on Matplotlib that provides a high-level interface for drawing attractive and informative statistical graphics. It integrates well with Pandas data structures and supports themes, color palettes, and complex visualization types such as violin plots, heatmaps, and pair plots. Seaborn is particularly known for its ability to create visualizations directly from DataFrames and automatically perform statistical aggregation, making it a go-to tool for quick data exploration.",
        "category": "Analytics",
        "license": "BSD-3-Clause",
        "cost": "Free",
        "size": "2.5 MB",
        "version": "0.12.2",
        "stars": 11000,
        "last_updated": "2023",
        "os": "Cross-platform",
        "tags": [
            "Python",
            "Visualization",
            "Statistical Graphics",
            "Data Analysis"
        ],
        "source": "https://seaborn.pydata.org"
    },
    {
        "id": "snowplow",
        "name": "Snowplow Analytics",
        "description": "Snowplow is an open-source event data platform that enables businesses to collect rich behavioral data from applications and websites. It processes this data in real time and streams it to data warehouses like Redshift and BigQuery. Snowplow is often used for building robust analytics pipelines with granular tracking and custom data modeling.",
        "category": "Analytics",
        "license": "Apache-2.0",
        "cost": "Free (Commercial available)",
        "size": "Varies by deployment",
        "version": "2.0",
        "stars": 6700,
        "last_updated": "2024",
        "os": "Cross-platform",
        "tags": [
            "Event Tracking",
            "Behavioral Analytics",
            "ETL",
            "Data Warehouse"
        ],
        "source": "https://snowplow.io"
    },
    {
        "id": "soda",
        "name": "Soda",
        "description": "Soda is a data quality and observability platform that helps detect anomalies, monitor freshness, and ensure trust in data pipelines. It provides a declarative language (SodaCL) to define data checks and integrates with modern data stacks like Snowflake, Redshift, and dbt. Soda helps data teams catch issues before they impact stakeholders or dashboards.",
        "category": "Analytics",
        "license": "Commercial",
        "cost": "Free (Pro available)",
        "size": "Cloud-based",
        "version": "2024",
        "stars": 1400,
        "last_updated": "2024",
        "os": "Cross-platform",
        "tags": [
            "Data Quality",
            "Observability",
            "Testing",
            "Pipelines",
            "Monitoring"
        ],
        "source": "https://soda.io"
    },
    {
        "id": "statsmodels",
        "name": "Statsmodels",
        "description": "Statsmodels is a Python module that provides classes and functions for the estimation of many different statistical models, as well as for conducting statistical tests and data exploration. It's especially strong in econometrics, time-series analysis, linear regression, generalized linear models, and ANOVA. It's used widely in academic and professional statistics communities for hypothesis testing and exploring data relationships. The library integrates closely with Pandas and NumPy.",
        "category": "Analytics",
        "license": "BSD-3-Clause",
        "cost": "Free",
        "size": "9 MB",
        "version": "0.14.1",
        "stars": 8200,
        "last_updated": "2024",
        "os": "Cross-platform",
        "tags": [
            "Python",
            "Statistics",
            "Econometrics",
            "Regression",
            "GLM"
        ],
        "source": "https://www.statsmodels.org"
    },
    {
        "id": "superset",
        "name": "Apache Superset",
        "description": "Apache Superset is a modern, enterprise-ready business intelligence web application. It allows users to explore and visualize their data using a rich set of visualizations, all from a no-code interface. Superset supports SQL-based querying, integration with most SQL-speaking databases, and powerful access control and dashboard features. It's a highly scalable platform designed for data analysts and business users to derive insights without relying on developers.",
        "category": "Analytics",
        "license": "Apache-2.0",
        "cost": "Free",
        "size": "150 MB",
        "version": "3.1.1",
        "stars": 54000,
        "last_updated": "2024",
        "os": "Cross-platform",
        "tags": [
            "Business Intelligence",
            "Visualization",
            "SQL",
            "Dashboard",
            "Web App"
        ],
        "source": "https://superset.apache.org"
    },
    {
        "id": "superset",
        "name": "Apache Superset",
        "description": "Apache Superset is a modern data exploration and visualization platform. It supports a wide array of charts, an intuitive UI, and works seamlessly with SQL-based databases. Designed for scalability and flexibility, it empowers teams to analyze data and create dashboards without heavy engineering effort.",
        "category": "Analytics",
        "license": "Apache-2.0",
        "cost": "Free",
        "size": "200 MB",
        "version": "3.0.0",
        "stars": 54000,
        "last_updated": "2024",
        "os": "Cross-platform",
        "tags": [
            "Visualization",
            "BI",
            "Dashboard",
            "Open-source",
            "SQL"
        ],
        "source": "https://superset.apache.org"
    },
    {
        "id": "tableau",
        "name": "Tableau",
        "description": "Tableau is a leading commercial analytics platform that enables users to visualize and understand data. With a drag-and-drop interface, users can connect to data sources, build dashboards, and create dynamic, interactive reports. Tableau supports extensive customization and analytics features and is widely adopted across industries for enterprise-level business intelligence and reporting.",
        "category": "Analytics",
        "license": "Commercial",
        "cost": "$70/user/month",
        "size": "500 MB",
        "version": "2024.1",
        "stars": 16000,
        "last_updated": "2024",
        "os": "Cross-platform",
        "tags": [
            "BI",
            "Data Visualization",
            "Reports",
            "Enterprise",
            "Dashboards"
        ],
        "source": "https://www.tableau.com"
    },
    {
        "id": "tableau",
        "name": "Tableau",
        "description": "Tableau is a leading data visualization and business intelligence platform used to transform raw data into interactive and shareable dashboards. It supports a wide variety of data sources and offers both desktop and cloud versions. Tableau is widely adopted in enterprises for its powerful visual analytics and intuitive interface.",
        "category": "Analytics",
        "license": "Commercial",
        "cost": "From $70/user/month",
        "size": "1.5 GB",
        "version": "2024.1",
        "stars": 6100,
        "last_updated": "2024",
        "os": "Cross-platform",
        "tags": [
            "BI",
            "Visualization",
            "Dashboards",
            "Enterprise",
            "Analytics"
        ],
        "source": "https://www.tableau.com"
    },
    {
        "id": "tibble",
        "name": "tibble",
        "description": "Tibble is a modern reimagining of data frames in R, part of the tidyverse. It provides a cleaner and more consistent experience for working with tabular data. Tibbles retain the feel of data frames but avoid many of their historic quirks, offering better printing, stricter subsetting rules, and improved performance with tidy tools.",
        "category": "Analytics",
        "license": "MIT",
        "cost": "Free",
        "size": "1.5 MB",
        "version": "3.2.1",
        "stars": 1000,
        "last_updated": "2024",
        "os": "Cross-platform",
        "tags": [
            "R",
            "Data Frame",
            "Tidyverse",
            "Tabular Data",
            "Wrangling"
        ],
        "source": "https://tibble.tidyverse.org"
    },
    {
        "id": "toucan",
        "name": "Toucan Toco",
        "description": "Toucan Toco is a modern data storytelling platform that enables non-technical users to create interactive visual dashboards. It focuses on guided analytics and user-centric storytelling rather than complex data exploration. Used by companies for operational reporting, it supports embedding and mobile access.",
        "category": "Analytics",
        "license": "Commercial",
        "cost": "Custom pricing",
        "size": "Cloud-based",
        "version": "2024",
        "stars": 900,
        "last_updated": "2024",
        "os": "Cross-platform",
        "tags": [
            "Data Storytelling",
            "Dashboard",
            "Mobile",
            "Reporting",
            "BI"
        ],
        "source": "https://toucantoco.com"
    },
    {
        "id": "trifacta",
        "name": "Trifacta",
        "description": "Trifacta, now part of Google Cloud Dataprep, is a data wrangling platform that helps analysts and engineers clean, structure, and enrich raw data for analysis. It offers a visual interface with intelligent suggestions and transformations. Trifacta reduces the time spent on data preparation and integrates well with cloud-based data warehouses like BigQuery and Snowflake.",
        "category": "Analytics",
        "license": "Commercial",
        "cost": "Custom pricing",
        "size": "Cloud-based",
        "version": "2024",
        "stars": 2100,
        "last_updated": "2024",
        "os": "Cross-platform",
        "tags": [
            "Data Cleaning",
            "Wrangling",
            "Cloud",
            "ETL",
            "Preparation"
        ],
        "source": "https://www.trifacta.com"
    },
    {
        "id": "visualizejs",
        "name": "Visualize.js",
        "description": "Visualize.js is an embeddable JavaScript framework provided by TIBCO Jaspersoft to integrate reports, dashboards, and visualizations into web applications. It connects directly to Jaspersoft's analytics server and supports custom interaction, filtering, and rendering of complex data visualizations in real time.",
        "category": "Analytics",
        "license": "Commercial",
        "cost": "Custom pricing",
        "size": "150 MB",
        "version": "2024",
        "stars": 1200,
        "last_updated": "2024",
        "os": "Cross-platform",
        "tags": [
            "Embedded BI",
            "JavaScript",
            "Dashboard",
            "Jaspersoft",
            "Visualization"
        ],
        "source": "https://community.jaspersoft.com/project/visualizejs"
    },
    {
        "id": "weaviate",
        "name": "Weaviate",
        "description": "Weaviate is an open-source vector database built for machine learning and semantic search use cases. It allows storing, indexing, and querying data using vectors, enabling advanced analytics like similarity search and recommendation systems. Weaviate supports hybrid search (keyword + vector), integrates with transformers, and is used for building intelligent apps on top of unstructured data.",
        "category": "Analytics",
        "license": "BSD-3-Clause",
        "cost": "Free (Cloud available)",
        "size": "200 MB",
        "version": "1.24.7",
        "stars": 8700,
        "last_updated": "2024",
        "os": "Cross-platform",
        "tags": [
            "Vector DB",
            "Semantic Search",
            "ML",
            "Recommendation",
            "Analytics"
        ],
        "source": "https://weaviate.io"
    },
    {
        "id": "zebrac",
        "name": "Zebra BI",
        "description": "Zebra BI provides visual and financial reporting components for Microsoft Power BI and Excel. It enables creation of IBCS-compliant reports with waterfall, variance, and small multiple charts, often used in finance and performance reporting. Zebra BI is especially popular in enterprises for financial storytelling and actionable insights.",
        "category": "Analytics",
        "license": "Commercial",
        "cost": "From €4/user/month",
        "size": "Add-on",
        "version": "2024",
        "stars": 1100,
        "last_updated": "2024",
        "os": "Cross-platform",
        "tags": [
            "Finance",
            "Power BI",
            "Reporting",
            "IBCS",
            "Excel"
        ],
        "source": "https://zebrabi.com"
    },
    {
        "id": "recharts",
        "name": "Recharts",
        "description": "Recharts is a composable charting library built on React components using D3 under the hood. It provides a simple and declarative syntax to build charts like line, bar, pie, radar, and more. Recharts is ideal for embedding analytics directly in modern web apps and offers responsive layouts, tooltips, and full control through component customization.",
        "category": "Analytics",
        "license": "MIT",
        "cost": "Free",
        "size": "1.2 MB",
        "version": "2.8.0",
        "stars": 21000,
        "last_updated": "03/11/2024",
        "os": "Cross-platform",
        "tags": [
            "React",
            "Charts",
            "Visualization",
            "JavaScript",
            "D3"
        ],
        "source": "https://recharts.org"
    },
    {
        "id": "victory",
        "name": "Victory",
        "description": "Victory is a modular charting library for React and React Native that provides beautiful, customizable, and interactive data visualizations. It supports animations, themes, tooltips, and responsive design, making it popular for building dynamic analytics interfaces in JavaScript-based apps.",
        "category": "Analytics",
        "license": "MIT",
        "cost": "Free",
        "size": "2.4 MB",
        "version": "36.6.8",
        "stars": 10500,
        "last_updated": "02/18/2024",
        "os": "Cross-platform",
        "tags": [
            "React",
            "Visualization",
            "Charts",
            "JavaScript",
            "Analytics"
        ],
        "source": "https://formidable.com/open-source/victory/"
    },
    {
        "id": "echarts",
        "name": "Apache ECharts",
        "description": "Apache ECharts is a powerful, interactive charting and visualization library written in JavaScript. With a highly extensible architecture, it supports complex visualizations including heatmaps, scatter plots, geographic maps, and 3D charts. ECharts is especially suited for dashboards with large datasets and advanced visual storytelling.",
        "category": "Analytics",
        "license": "Apache-2.0",
        "cost": "Free",
        "size": "5.1 MB",
        "version": "5.5.0",
        "stars": 56000,
        "last_updated": "04/22/2024",
        "os": "Cross-platform",
        "tags": [
            "Charts",
            "JavaScript",
            "3D",
            "Maps",
            "Dashboard"
        ],
        "source": "https://echarts.apache.org"
    },
    {
        "id": "danfojs",
        "name": "Danfo.js",
        "description": "Danfo.js is a JavaScript library modeled after Pandas that provides high-level APIs for data manipulation and analysis in the browser or Node.js. It supports structures like DataFrame and Series and is ideal for client-side analytics tasks such as filtering, grouping, and statistical summaries.",
        "category": "Analytics",
        "license": "MIT",
        "cost": "Free",
        "size": "3.5 MB",
        "version": "1.4.0",
        "stars": 3900,
        "last_updated": "01/10/2024",
        "os": "Cross-platform",
        "tags": [
            "JavaScript",
            "DataFrame",
            "ETL",
            "Browser",
            "Node.js"
        ],
        "source": "https://danfo.jsdata.org"
    },
    {
        "id": "vega",
        "name": "Vega",
        "description": "Vega is a declarative language and JavaScript library for creating, sharing, and exploring interactive visualizations. It allows users to describe visual appearances and behaviors in JSON, enabling dynamic dashboards and analytics tools without writing complex JavaScript logic.",
        "category": "Analytics",
        "license": "BSD-3-Clause",
        "cost": "Free",
        "size": "1.8 MB",
        "version": "5.25.0",
        "stars": 10500,
        "last_updated": "02/05/2024",
        "os": "Cross-platform",
        "tags": [
            "Visualization",
            "Declarative",
            "JSON",
            "Interactive",
            "Analytics"
        ],
        "source": "https://vega.github.io/vega/"
    },
    {
        "id": "vega-lite",
        "name": "Vega-Lite",
        "description": "Vega-Lite is a lightweight grammar of interactive graphics, built on top of Vega. It simplifies the creation of visualizations by allowing analysts to specify what they want using a concise JSON syntax. Ideal for quick exploration and integration in notebook-style analytics tools.",
        "category": "Analytics",
        "license": "BSD-3-Clause",
        "cost": "Free",
        "size": "1.1 MB",
        "version": "5.10.0",
        "stars": 11800,
        "last_updated": "03/01/2024",
        "os": "Cross-platform",
        "tags": [
            "Charts",
            "Declarative",
            "Grammar",
            "Visualization",
            "Interactive"
        ],
        "source": "https://vega.github.io/vega-lite/"
    },
    {
        "id": "arquero",
        "name": "Arquero",
        "description": "Arquero is a JavaScript library for query processing and transformation of data tables. Designed for fast in-browser analytics, Arquero supports filtering, grouping, reshaping, joins, and window functions, making it ideal for interactive notebooks and client-side analytics pipelines.",
        "category": "Analytics",
        "license": "BSD-3-Clause",
        "cost": "Free",
        "size": "850 KB",
        "version": "1.10.1",
        "stars": 1300,
        "last_updated": "01/22/2024",
        "os": "Cross-platform",
        "tags": [
            "JavaScript",
            "DataFrames",
            "Transformations",
            "ETL",
            "Browser"
        ],
        "source": "https://uwdata.github.io/arquero/"
    },
    {
        "id": "plotnine",
        "name": "Plotnine",
        "description": "Plotnine is a Python data visualization library based on the grammar of graphics, similar to ggplot2 in R. It is built on top of Matplotlib and Pandas, providing a concise syntax to create complex statistical plots, especially useful in exploratory data analysis and reproducible research.",
        "category": "Analytics",
        "license": "MIT",
        "cost": "Free",
        "size": "2.9 MB",
        "version": "0.12.4",
        "stars": 3100,
        "last_updated": "04/04/2024",
        "os": "Cross-platform",
        "tags": [
            "Python",
            "ggplot2",
            "Grammar of Graphics",
            "Statistics",
            "EDA"
        ],
        "source": "https://plotnine.readthedocs.io"
    },
    {
        "id": "visx",
        "name": "VisX",
        "description": "VisX is a collection of low-level visualization primitives for React, built by Airbnb. It combines the power of D3 with the flexibility of React components, allowing developers to build custom analytics visualizations with performance and modularity in mind.",
        "category": "Analytics",
        "license": "MIT",
        "cost": "Free",
        "size": "2.3 MB",
        "version": "3.4.0",
        "stars": 18000,
        "last_updated": "02/12/2024",
        "os": "Cross-platform",
        "tags": [
            "React",
            "D3",
            "JavaScript",
            "Charts",
            "Custom Visualization"
        ],
        "source": "https://airbnb.io/visx"
    },
    {
        "id": "rawgraphs",
        "name": "RAWGraphs",
        "description": "RAWGraphs is an open-source web-based tool that turns spreadsheet data into customizable vector-based visualizations. Built on D3.js, it supports unconventional charts like bump charts, circular dendrograms, and stream graphs. It's widely used by designers and journalists for creating polished and unconventional data stories.",
        "category": "Analytics",
        "license": "BSD-3-Clause",
        "cost": "Free",
        "size": "Web-based",
        "version": "2.0.0",
        "stars": 6700,
        "last_updated": "03/26/2024",
        "os": "Cross-platform",
        "tags": [
            "D3",
            "Charts",
            "Design",
            "Visualization",
            "Web App"
        ],
        "source": "https://rawgraphs.io"
    },
    {
        "id": "perspective",
        "name": "Perspective",
        "description": "Perspective is a high-performance analytics and data visualization engine originally developed by JP Morgan. It allows streaming data to be transformed and visualized in pivot-table form in the browser or desktop. It supports WebAssembly, parallel processing, and is highly customizable for real-time dashboards.",
        "category": "Analytics",
        "license": "Apache-2.0",
        "cost": "Free",
        "size": "5.2 MB",
        "version": "1.7.3",
        "stars": 6900,
        "last_updated": "03/15/2024",
        "os": "Cross-platform",
        "tags": [
            "Streaming",
            "Pivot",
            "WebAssembly",
            "Visualization",
            "Real-time"
        ],
        "source": "https://github.com/finos/perspective"
    },
    {
        "id": "kepler",
        "name": "Kepler.gl",
        "description": "Kepler.gl is a powerful open-source geospatial analysis tool created by Uber. It enables large-scale interactive visual exploration of location data directly in the browser. Users can import CSVs, apply filters, and generate 3D visualizations and time-based animations without coding.",
        "category": "Analytics",
        "license": "MIT",
        "cost": "Free",
        "size": "10 MB",
        "version": "2.6.4",
        "stars": 9600,
        "last_updated": "04/14/2024",
        "os": "Cross-platform",
        "tags": [
            "Geospatial",
            "3D",
            "Visualization",
            "Uber",
            "Maps"
        ],
        "source": "https://kepler.gl"
    },
    {
        "id": "falcon",
        "name": "Falcon",
        "description": "Falcon is a lightweight, high-performance SQL client built for analytics, allowing seamless connection to popular databases and effortless data exploration. It features drag-and-drop query building, result charting, and CSV export — ideal for quick data insights.",
        "category": "Analytics",
        "license": "MIT",
        "cost": "Free",
        "size": "80 MB",
        "version": "1.1.0",
        "stars": 1200,
        "last_updated": "02/19/2024",
        "os": "Cross-platform",
        "tags": [
            "SQL",
            "Database",
            "Explorer",
            "Query Builder",
            "Charts"
        ],
        "source": "https://github.com/plotly/falcon-sql-client"
    },
    {
        "id": "carte-blanche",
        "name": "Carte Blanche",
        "description": "Carte Blanche is an analytics and reporting framework designed to create rich data narratives and dashboards. Built with a visual-first approach, it emphasizes clarity and customization, making it a favorite in journalism and finance sectors where storytelling is key.",
        "category": "Analytics",
        "license": "MIT",
        "cost": "Free",
        "size": "Web-based",
        "version": "1.0.0",
        "stars": 800,
        "last_updated": "01/08/2024",
        "os": "Cross-platform",
        "tags": [
            "Visualization",
            "Reporting",
            "Dashboards",
            "Storytelling"
        ],
        "source": "https://github.com/carte-blanche/carte-blanche"
    },
    {
        "id": "datashader",
        "name": "Datashader",
        "description": "Datashader is a Python library for rendering large-scale datasets into meaningful visualizations. It handles billions of points through GPU-accelerated pipelines and generates rasterized charts, which can then be layered with interactive tools like Bokeh or HoloViews.",
        "category": "Analytics",
        "license": "BSD-3-Clause",
        "cost": "Free",
        "size": "12 MB",
        "version": "0.15.2",
        "stars": 7800,
        "last_updated": "03/29/2024",
        "os": "Cross-platform",
        "tags": [
            "Big Data",
            "Raster",
            "GPU",
            "Python",
            "Visualization"
        ],
        "source": "https://datashader.org"
    },
    {
        "id": "superset-lite",
        "name": "Superset Lite",
        "description": "Superset Lite is a community fork of Apache Superset focused on performance optimization and smaller deployments. It trims down heavy modules while retaining full SQL exploration and dashboarding capabilities, making it perfect for embedded BI in SaaS tools.",
        "category": "Analytics",
        "license": "Apache-2.0",
        "cost": "Free",
        "size": "70 MB",
        "version": "1.0.2",
        "stars": 2300,
        "last_updated": "04/01/2024",
        "os": "Cross-platform",
        "tags": [
            "BI",
            "Lightweight",
            "SQL",
            "Dashboards",
            "Open-source"
        ],
        "source": "https://github.com/tryolabs/superset-lite"
    },
    {
        "id": "lightning",
        "name": "Lightning",
        "description": "Lightning is a platform for creating interactive data visualizations and sharing them through a centralized server. Written in Python and JavaScript, it enables streaming updates and supports high-performance visual analytics for scientific computing and ML research.",
        "category": "Analytics",
        "license": "BSD-2-Clause",
        "cost": "Free",
        "size": "9 MB",
        "version": "2.1.1",
        "stars": 1800,
        "last_updated": "02/06/2024",
        "os": "Cross-platform",
        "tags": [
            "Streaming",
            "Data Science",
            "ML",
            "Visualization",
            "Interactive"
        ],
        "source": "https://github.com/lightning-viz/lightning"
    },
    {
        "id": "bamboo",
        "name": "Bamboo",
        "description": "Bamboo is an open-source ETL and analytics framework that integrates with cloud data warehouses. It enables reusable, declarative pipeline definitions and supports real-time monitoring, making it ideal for modern data engineering workflows.",
        "category": "Analytics",
        "license": "Apache-2.0",
        "cost": "Free",
        "size": "8 MB",
        "version": "0.9.6",
        "stars": 1100,
        "last_updated": "01/20/2024",
        "os": "Cross-platform",
        "tags": [
            "ETL",
            "Pipelines",
            "Monitoring",
            "Analytics",
            "Data Engineering"
        ],
        "source": "https://github.com/bamboo-analytics/bamboo"
    },
    {
        "id": "timescaledb",
        "name": "TimescaleDB",
        "description": "TimescaleDB is an open-source time-series database optimized for fast analytics on time-stamped data. Built on PostgreSQL, it brings full SQL support and scaling features for observability, IoT, and financial analytics systems.",
        "category": "Analytics",
        "license": "Apache-2.0",
        "cost": "Free (Pro available)",
        "size": "50 MB",
        "version": "2.14.2",
        "stars": 16000,
        "last_updated": "04/17/2024",
        "os": "Cross-platform",
        "tags": [
            "Time Series",
            "PostgreSQL",
            "SQL",
            "Monitoring",
            "Database"
        ],
        "source": "https://www.timescale.com"
    },
    {
        "id": "dash-ag-grid",
        "name": "Dash AG Grid",
        "description": "Dash AG Grid is an enterprise-grade data grid component integrated with the Dash framework. It provides pivoting, grouping, filtering, and real-time updates, making it ideal for building advanced analytics dashboards with powerful table visualizations.",
        "category": "Analytics",
        "license": "MIT",
        "cost": "Free",
        "size": "2.1 MB",
        "version": "2.4.1",
        "stars": 900,
        "last_updated": "03/19/2024",
        "os": "Cross-platform",
        "tags": [
            "Dash",
            "Grid",
            "Tables",
            "Interactive",
            "Python"
        ],
        "source": "https://dash.plotly.com/datatable/ag-grid"
    },
    {
        "id": "gramex",
        "name": "Gramex",
        "description": "Gramex is a low-code Python-based framework for building analytics and data science web apps. It provides ready-made components for visualizations, dashboards, form handling, REST APIs, and ML model deployment. Designed for rapid development, Gramex is used by data teams to prototype and deploy solutions quickly.",
        "category": "Analytics",
        "license": "BSD-3-Clause",
        "cost": "Free",
        "size": "60 MB",
        "version": "1.94.0",
        "stars": 2100,
        "last_updated": "03/03/2024",
        "os": "Cross-platform",
        "tags": [
            "Low-Code",
            "Dashboards",
            "ML",
            "Data Apps",
            "Python"
        ],
        "source": "https://learn.gramener.com"
    },
    {
        "id": "chartkick",
        "name": "Chartkick",
        "description": "Chartkick is a simple JavaScript and Ruby library for creating beautiful charts using Chart.js, Highcharts, or Google Charts. Designed for developers who want quick and elegant charting capabilities, Chartkick supports line, pie, column, and bar charts with minimal code.",
        "category": "Analytics",
        "license": "MIT",
        "cost": "Free",
        "size": "300 KB",
        "version": "4.1.0",
        "stars": 5900,
        "last_updated": "02/21/2024",
        "os": "Cross-platform",
        "tags": [
            "Charts",
            "Ruby",
            "JavaScript",
            "Google Charts",
            "Visualization"
        ],
        "source": "https://chartkick.com"
    },
    {
        "id": "taipy",
        "name": "Taipy",
        "description": "Taipy is a Python framework for building interactive and production-ready data science applications. It simplifies the process of creating dashboards and control flows using a declarative syntax. Taipy is ideal for deploying AI and analytics solutions quickly, with support for scheduling and model re-training.",
        "category": "Analytics",
        "license": "Apache-2.0",
        "cost": "Free",
        "size": "28 MB",
        "version": "3.0.2",
        "stars": 1200,
        "last_updated": "04/09/2024",
        "os": "Cross-platform",
        "tags": [
            "AI",
            "Dashboards",
            "Python",
            "Workflow",
            "Deployment"
        ],
        "source": "https://www.taipy.io"
    },
    {
        "id": "graph-tool",
        "name": "Graph-tool",
        "description": "Graph-tool is an efficient Python module for manipulation and statistical analysis of graphs (networks). It is heavily optimized with C++ backend and supports a wide range of graph algorithms, visualization, and community detection, making it useful for social network and connectivity analytics.",
        "category": "Analytics",
        "license": "GPL-3.0",
        "cost": "Free",
        "size": "35 MB",
        "version": "2.58",
        "stars": 3300,
        "last_updated": "01/28/2024",
        "os": "Cross-platform",
        "tags": [
            "Graph",
            "Network Analysis",
            "C++",
            "Python",
            "Statistics"
        ],
        "source": "https://graph-tool.skewed.de"
    },
    {
        "id": "holistics",
        "name": "Holistics",
        "description": "Holistics is a modern BI and data modeling platform for SQL-based analytics teams. It supports data modeling with reusable logic, automated report generation, and embedding analytics into web apps. Holistics is ideal for teams who want control over data logic while serving stakeholders with visual insights.",
        "category": "Analytics",
        "license": "Commercial",
        "cost": "Custom pricing",
        "size": "Cloud-based",
        "version": "2024",
        "stars": 1300,
        "last_updated": "04/02/2024",
        "os": "Cross-platform",
        "tags": [
            "SQL",
            "Data Modeling",
            "Reports",
            "Embedded BI",
            "Dashboards"
        ],
        "source": "https://www.holistics.io"
    },
    {
        "id": "kumu",
        "name": "Kumu",
        "description": "Kumu is a web-based tool for visualizing complex relationships and systems. It enables teams to map stakeholders, causes, networks, or feedback loops using interactive relationship charts. Kumu is widely used in policy, education, and systems thinking domains for data storytelling and mapping.",
        "category": "Analytics",
        "license": "Commercial",
        "cost": "Free with paid plans",
        "size": "Web-based",
        "version": "2024",
        "stars": 2100,
        "last_updated": "03/05/2024",
        "os": "Cross-platform",
        "tags": [
            "Systems Thinking",
            "Mapping",
            "Relationships",
            "Visualization",
            "Stakeholders"
        ],
        "source": "https://kumu.io"
    },
    {
        "id": "flourish",
        "name": "Flourish",
        "description": "Flourish is a popular no-code tool for creating interactive visualizations, charts, maps, and stories. Widely used by journalists, marketers, and analysts, it offers a library of templates and the ability to embed or export visuals for the web. It supports dynamic updates via Google Sheets or JSON feeds.",
        "category": "Analytics",
        "license": "Commercial",
        "cost": "Free with paid plans",
        "size": "Web-based",
        "version": "2024",
        "stars": 7500,
        "last_updated": "04/06/2024",
        "os": "Cross-platform",
        "tags": [
            "No-Code",
            "Charts",
            "Storytelling",
            "Interactive",
            "Publishing"
        ],
        "source": "https://flourish.studio"
    },
    {
        "id": "saiku",
        "name": "Saiku Analytics",
        "description": "Saiku is an open-source OLAP analysis tool that provides a web-based interface to query multidimensional data cubes. It supports drag-and-drop exploration, ad hoc queries, and export features, making it useful for enterprise BI use cases focused on pivot-table style analytics.",
        "category": "Analytics",
        "license": "Apache-2.0",
        "cost": "Free",
        "size": "60 MB",
        "version": "3.11.0",
        "stars": 1500,
        "last_updated": "02/17/2024",
        "os": "Cross-platform",
        "tags": [
            "OLAP",
            "Pivot",
            "Cubes",
            "Business Intelligence",
            "Open-source"
        ],
        "source": "https://github.com/OSBI/saiku"
    },
    {
        "id": "uxpin-analytics",
        "name": "UXPin Analytics",
        "description": "UXPin Analytics is a data integration module built into the UXPin prototyping platform. It provides user interaction tracking, event funnels, and heatmaps to analyze prototype performance and user flows. This is particularly useful for design teams iterating on UI/UX before development.",
        "category": "Analytics",
        "license": "Commercial",
        "cost": "Custom pricing",
        "size": "Web-based",
        "version": "2024",
        "stars": 800,
        "last_updated": "03/12/2024",
        "os": "Cross-platform",
        "tags": [
            "UX",
            "Heatmaps",
            "Prototyping",
            "User Flow",
            "Interaction"
        ],
        "source": "https://www.uxpin.com"
    },
    {
        "id": "panther",
        "name": "Panther",
        "description": "Panther is a cloud-native security analytics platform built for modern data stacks. It ingests logs from AWS, GCP, and more, then applies Python-based detection logic to identify threats. While security-focused, Panther also supports general-purpose analytics over structured event data.",
        "category": "Analytics",
        "license": "AGPL-3.0",
        "cost": "Free (Cloud available)",
        "size": "Cloud-based",
        "version": "1.95.0",
        "stars": 5300,
        "last_updated": "04/15/2024",
        "os": "Cross-platform",
        "tags": [
            "Security",
            "Log Analytics",
            "Python",
            "Cloud",
            "Event Data"
        ],
        "source": "https://github.com/panther-labs/panther"
    },
    {
        "id": "datameer",
        "name": "Datameer",
        "description": "Datameer is an enterprise-grade data analytics platform that provides self-service data preparation, exploration, and integration for Snowflake and other cloud warehouses. It offers a spreadsheet-like interface with built-in transformations, collaboration features, and workflow automation.",
        "category": "Analytics",
        "license": "Commercial",
        "cost": "Custom pricing",
        "size": "Cloud-based",
        "version": "11.0",
        "stars": 1300,
        "last_updated": "03/13/2024",
        "os": "Cross-platform",
        "tags": [
            "Data Prep",
            "Snowflake",
            "Spreadsheet",
            "Cloud",
            "ETL"
        ],
        "source": "https://www.datameer.com"
    },
    {
        "id": "redcube",
        "name": "RedCube",
        "description": "RedCube is a lightweight, open-source dashboard engine for generating real-time insights from MongoDB and other NoSQL databases. It allows users to build visualizations using simple configuration files, making it ideal for teams looking to expose metrics with minimal effort.",
        "category": "Analytics",
        "license": "MIT",
        "cost": "Free",
        "size": "35 MB",
        "version": "2.3.1",
        "stars": 900,
        "last_updated": "02/14/2024",
        "os": "Cross-platform",
        "tags": [
            "NoSQL",
            "Dashboard",
            "Real-time",
            "MongoDB",
            "Visualization"
        ],
        "source": "https://github.com/redcube/redcube"
    },
    {
        "id": "vizzly",
        "name": "Vizzly",
        "description": "Vizzly is an embeddable analytics front-end built for SaaS products. It enables teams to add custom analytics to their apps quickly, complete with filtering, drill-downs, and user-specific metrics — without having to build an internal dashboard framework from scratch.",
        "category": "Analytics",
        "license": "Commercial",
        "cost": "Free with paid plans",
        "size": "Web-based",
        "version": "2024",
        "stars": 1000,
        "last_updated": "03/07/2024",
        "os": "Cross-platform",
        "tags": [
            "Embedded Analytics",
            "SaaS",
            "Metrics",
            "Custom Reports",
            "Frontend"
        ],
        "source": "https://vizzly.co"
    },
    {
        "id": "pluto",
        "name": "Pluto.jl",
        "description": "Pluto.jl is an interactive notebook environment for the Julia language, designed for data analysis, visualization, and reactive programming. With a clean reactive model, Pluto automatically recalculates dependent cells and supports live visualizations, making it a great tool for analytics and teaching.",
        "category": "Analytics",
        "license": "MIT",
        "cost": "Free",
        "size": "5 MB",
        "version": "0.19.33",
        "stars": 5500,
        "last_updated": "04/04/2024",
        "os": "Cross-platform",
        "tags": [
            "Julia",
            "Notebook",
            "Visualization",
            "Reactive",
            "Data Science"
        ],
        "source": "https://github.com/fonsp/Pluto.jl"
    },
    {
        "id": "tidyverse",
        "name": "Tidyverse",
        "description": "Tidyverse is a collection of R packages designed for data science. It includes packages like ggplot2, dplyr, tidyr, readr, and others, offering a consistent grammar and ecosystem for data manipulation, visualization, and modeling. It's a foundational toolkit for analysts working in R.",
        "category": "Analytics",
        "license": "MIT",
        "cost": "Free",
        "size": "35 MB",
        "version": "2.0.0",
        "stars": 7400,
        "last_updated": "02/23/2024",
        "os": "Cross-platform",
        "tags": [
            "R",
            "ggplot2",
            "dplyr",
            "Data Cleaning",
            "Modeling"
        ],
        "source": "https://www.tidyverse.org"
    },
    {
        "id": "retentioneering",
        "name": "Retentioneering",
        "description": "Retentioneering is a Python toolkit for product analytics and user behavior flow modeling. It allows analysts to process raw event logs into user journeys, funnels, and cluster maps. Commonly used in growth analytics, it supports Jupyter workflows and integrates with Pandas and Plotly.",
        "category": "Analytics",
        "license": "Apache-2.0",
        "cost": "Free",
        "size": "4.5 MB",
        "version": "2.3.0",
        "stars": 1300,
        "last_updated": "01/16/2024",
        "os": "Cross-platform",
        "tags": [
            "User Behavior",
            "Funnels",
            "Journeys",
            "Python",
            "Jupyter"
        ],
        "source": "https://github.com/retentioneering/retentioneering-tools"
    },
    {
        "id": "openreplay",
        "name": "OpenReplay",
        "description": "OpenReplay is an open-source session replay suite that lets teams replay user interactions with their web apps. It captures console logs, DOM changes, and user behavior — providing a powerful tool for debugging, UX analysis, and behavioral analytics.",
        "category": "Analytics",
        "license": "Apache-2.0",
        "cost": "Free",
        "size": "180 MB",
        "version": "1.10.0",
        "stars": 9500,
        "last_updated": "03/25/2024",
        "os": "Cross-platform",
        "tags": [
            "Session Replay",
            "UX",
            "Debugging",
            "Web Analytics",
            "Open-source"
        ],
        "source": "https://openreplay.com"
    },
    {
        "id": "dune",
        "name": "Dune Analytics",
        "description": "Dune is a blockchain analytics platform that enables querying Ethereum and other blockchain datasets using SQL. Users can build dashboards, track on-chain metrics, and share insights with the crypto community. It's widely used for DeFi research and NFT market tracking.",
        "category": "Analytics",
        "license": "Commercial",
        "cost": "Free with paid plans",
        "size": "Cloud-based",
        "version": "2024",
        "stars": 5900,
        "last_updated": "04/12/2024",
        "os": "Cross-platform",
        "tags": [
            "Blockchain",
            "Crypto",
            "SQL",
            "DeFi",
            "NFT"
        ],
        "source": "https://dune.com"
    },
    {
        "id": "metrik",
        "name": "Metrik",
        "description": "Metrik is an open-source platform for engineering teams to monitor and visualize DevOps KPIs. It integrates with GitHub, Jenkins, and Jira to provide dashboards on delivery performance, lead time, and deployment frequency. Great for data-driven DevOps decision-making.",
        "category": "Analytics",
        "license": "Apache-2.0",
        "cost": "Free",
        "size": "60 MB",
        "version": "1.2.0",
        "stars": 1200,
        "last_updated": "02/26/2024",
        "os": "Cross-platform",
        "tags": [
            "DevOps",
            "KPI",
            "Jira",
            "GitHub",
            "Dashboards"
        ],
        "source": "https://github.com/dailymetrik/metrik"
    },
    {
        "id": "gudhi",
        "name": "GUDHI",
        "description": "GUDHI is a C++ and Python library for Topological Data Analysis (TDA). It provides algorithms and data structures for tasks like persistent homology, simplex trees, and filtrations, helping researchers perform advanced analytics on high-dimensional data sets.",
        "category": "Analytics",
        "license": "MIT",
        "cost": "Free",
        "size": "10 MB",
        "version": "3.9.0",
        "stars": 1000,
        "last_updated": "01/29/2024",
        "os": "Cross-platform",
        "tags": [
            "TDA",
            "Topology",
            "Python",
            "High-dimensional Data",
            "Math"
        ],
        "source": "https://gudhi.inria.fr"
    },
    {
        "id": "mindsdb",
        "name": "MindsDB",
        "description": "MindsDB is an open-source AI layer for databases that enables machine learning predictions using SQL. It allows users to create, train, and query ML models directly inside databases like MySQL, Postgres, and MongoDB, making it ideal for embedding predictive analytics into existing workflows.",
        "category": "Analytics",
        "license": "GPL-3.0",
        "cost": "Free",
        "size": "100 MB",
        "version": "24.2.4",
        "stars": 16000,
        "last_updated": "04/08/2024",
        "os": "Cross-platform",
        "tags": [
            "AI",
            "SQL",
            "ML",
            "Prediction",
            "Databases"
        ],
        "source": "https://mindsdb.com"
    },
    {
        "id": "trino",
        "name": "Trino",
        "description": "Trino is a high-performance, distributed SQL query engine for big data analytics. It enables querying across multiple data sources like Hive, S3, Cassandra, and MySQL using ANSI SQL, without the need for data duplication or movement, making it a core engine for federated analytics.",
        "category": "Analytics",
        "license": "Apache-2.0",
        "cost": "Free",
        "size": "180 MB",
        "version": "435",
        "stars": 8200,
        "last_updated": "03/28/2024",
        "os": "Cross-platform",
        "tags": [
            "SQL",
            "Big Data",
            "Federated",
            "ETL",
            "Query Engine"
        ],
        "source": "https://trino.io"
    },
    {
        "id": "mljar",
        "name": "MLJAR",
        "description": "MLJAR is an AutoML platform that helps analysts and data scientists build, tune, and evaluate machine learning models with minimal coding. It supports explainability, performance comparison, and ensemble building, offering both web and Python API interfaces.",
        "category": "Analytics",
        "license": "Commercial",
        "cost": "Free with paid tiers",
        "size": "Cloud or local",
        "version": "1.1.3",
        "stars": 1500,
        "last_updated": "01/30/2024",
        "os": "Cross-platform",
        "tags": [
            "AutoML",
            "Python",
            "Explainability",
            "Ensembles",
            "No-Code"
        ],
        "source": "https://mljar.com"
    },
    {
        "id": "retool",
        "name": "Retool",
        "description": "Retool is a low-code platform that allows teams to build custom internal analytics tools and dashboards using pre-built components and data connectors. It integrates with databases, APIs, and spreadsheets to power real-time visual analytics for operational use cases.",
        "category": "Analytics",
        "license": "Commercial",
        "cost": "Free with paid plans",
        "size": "Web-based",
        "version": "2024",
        "stars": 27000,
        "last_updated": "04/10/2024",
        "os": "Cross-platform",
        "tags": [
            "Low-code",
            "Internal Tools",
            "Dashboards",
            "APIs",
            "Data Access"
        ],
        "source": "https://retool.com"
    },
    {
        "id": "streamlit-aggrid",
        "name": "Streamlit AgGrid",
        "description": "Streamlit AgGrid brings the power of AG Grid to Streamlit dashboards, enabling rich data tables with features like filtering, pagination, selection, and editable cells. It's widely used in Python analytics apps where interactivity is needed without front-end coding.",
        "category": "Analytics",
        "license": "MIT",
        "cost": "Free",
        "size": "1.8 MB",
        "version": "0.3.6",
        "stars": 1300,
        "last_updated": "03/16/2024",
        "os": "Cross-platform",
        "tags": [
            "Streamlit",
            "Tables",
            "Interactivity",
            "Dashboards",
            "Python"
        ],
        "source": "https://github.com/PablocFonseca/streamlit-aggrid"
    },
    {
        "id": "metriql",
        "name": "MetriQL",
        "description": "MetriQL is an open-source headless BI tool that transforms dbt models into queryable APIs. It helps teams standardize business metrics across applications and enables consistent analytics via integrations with BI tools like Superset, Tableau, and Metabase.",
        "category": "Analytics",
        "license": "Apache-2.0",
        "cost": "Free",
        "size": "90 MB",
        "version": "1.3.0",
        "stars": 2500,
        "last_updated": "04/01/2024",
        "os": "Cross-platform",
        "tags": [
            "Headless BI",
            "dbt",
            "Metrics Layer",
            "API",
            "Standardization"
        ],
        "source": "https://github.com/metriql/metriql"
    },
    {
        "id": "cube-surfer",
        "name": "Cube Surfer",
        "description": "Cube Surfer is an analytics tool for exploring and slicing OLAP cubes with a simple UI. It supports Excel-like pivoting and integrates with Mondrian and XMLA-compatible data sources, allowing users to dig into multidimensional datasets easily.",
        "category": "Analytics",
        "license": "Commercial",
        "cost": "Custom pricing",
        "size": "80 MB",
        "version": "3.5.2",
        "stars": 600,
        "last_updated": "02/15/2024",
        "os": "Cross-platform",
        "tags": [
            "OLAP",
            "Pivot",
            "Mondrian",
            "Excel UI",
            "Dashboards"
        ],
        "source": "https://cubesurfer.io"
    },
    {
        "id": "openmetadata",
        "name": "OpenMetadata",
        "description": "OpenMetadata is an open-source metadata management and data discovery platform. It supports lineage tracking, quality checks, and usage analytics across databases, pipelines, and BI tools. OpenMetadata empowers organizations to centralize governance and analytics tracking in one platform.",
        "category": "Analytics",
        "license": "Apache-2.0",
        "cost": "Free",
        "size": "200 MB",
        "version": "1.2.0",
        "stars": 7200,
        "last_updated": "04/07/2024",
        "os": "Cross-platform",
        "tags": [
            "Metadata",
            "Lineage",
            "Governance",
            "Data Catalog",
            "Tracking"
        ],
        "source": "https://open-metadata.org"
    },
    {
        "id": "evidently",
        "name": "Evidently",
        "description": "Evidently is an open-source Python library for monitoring and evaluating machine learning models in production. It provides dashboards and reports for metrics like data drift, feature importance, and prediction stability, making it a valuable tool for analytics in ML pipelines.",
        "category": "Analytics",
        "license": "Apache-2.0",
        "cost": "Free",
        "size": "6 MB",
        "version": "0.4.13",
        "stars": 5000,
        "last_updated": "04/03/2024",
        "os": "Cross-platform",
        "tags": [
            "Monitoring",
            "ML",
            "Python",
            "Data Drift",
            "Model Evaluation"
        ],
        "source": "https://evidentlyai.com"
    },
    {
        "id": "subgrounds",
        "name": "Subgrounds",
        "description": "Subgrounds is a Python-based data extraction and transformation library for The Graph protocol. It simplifies querying blockchain data from subgraphs and turns results into Pandas-compatible formats for further analytics and visualization.",
        "category": "Analytics",
        "license": "MIT",
        "cost": "Free",
        "size": "4 MB",
        "version": "0.3.0",
        "stars": 900,
        "last_updated": "01/25/2024",
        "os": "Cross-platform",
        "tags": [
            "Blockchain",
            "Python",
            "The Graph",
            "Subgraph",
            "Data Query"
        ],
        "source": "https://github.com/0xplaygrounds/subgrounds"
    },
    {
        "id": "datahub",
        "name": "DataHub",
        "description": "DataHub is an open-source metadata platform developed by LinkedIn. It enables teams to track data lineage, ownership, schema changes, and usage across pipelines, databases, and dashboards. It provides robust search and governance capabilities, making it ideal for analytics observability.",
        "category": "Analytics",
        "license": "Apache-2.0",
        "cost": "Free",
        "size": "250 MB",
        "version": "0.12.0",
        "stars": 9300,
        "last_updated": "04/01/2024",
        "os": "Cross-platform",
        "tags": [
            "Metadata",
            "Lineage",
            "Governance",
            "Search",
            "Analytics"
        ],
        "source": "https://datahubproject.io"
    },
    {
        "id": "grafanalitics",
        "name": "Grafanalitics",
        "description": "Grafanalitics is a Grafana-native plugin and backend extension that aggregates time-series insights from diverse sources. It enables advanced computations, real-time alerts, and dynamic visualization enhancements for operations and metrics analytics workflows.",
        "category": "Analytics",
        "license": "AGPL-3.0",
        "cost": "Free",
        "size": "30 MB",
        "version": "1.3.0",
        "stars": 1100,
        "last_updated": "03/12/2024",
        "os": "Cross-platform",
        "tags": [
            "Grafana",
            "Time Series",
            "Alerts",
            "Dashboards",
            "Plugins"
        ],
        "source": "https://grafanalabs.com"
    },
    {
        "id": "deepeval",
        "name": "DeepEval",
        "description": "DeepEval is an open-source evaluation framework for generative AI models. It allows data scientists and MLOps teams to assess LLM outputs with custom metrics, feedback loops, and real-world scenarios, combining analytics with evaluation logic in the AI lifecycle.",
        "category": "Analytics",
        "license": "Apache-2.0",
        "cost": "Free",
        "size": "9 MB",
        "version": "0.6.3",
        "stars": 1800,
        "last_updated": "04/11/2024",
        "os": "Cross-platform",
        "tags": [
            "LLM",
            "Evaluation",
            "AI",
            "Analytics",
            "Monitoring"
        ],
        "source": "https://github.com/confident-ai/deepeval"
    },
    {
        "id": "querybook",
        "name": "Querybook",
        "description": "Querybook is a data notebook for large-scale querying and collaboration. Developed by Pinterest, it provides SQL editing, data cataloging, query scheduling, and dashboards — all integrated into one analytics workspace that supports various backends like Hive and Presto.",
        "category": "Analytics",
        "license": "Apache-2.0",
        "cost": "Free",
        "size": "150 MB",
        "version": "3.0.0",
        "stars": 3400,
        "last_updated": "02/29/2024",
        "os": "Cross-platform",
        "tags": [
            "SQL",
            "Notebook",
            "Data Catalog",
            "Collaboration",
            "Dashboards"
        ],
        "source": "https://github.com/pinterest/querybook"
    },
    {
        "id": "dbt-metrics",
        "name": "dbt Metrics Layer",
        "description": "dbt Metrics Layer provides a central definition for business metrics that can be queried across BI tools. It ensures consistency in KPIs and supports semantic modeling directly on top of dbt models, transforming dbt into a headless analytics engine.",
        "category": "Analytics",
        "license": "Apache-2.0",
        "cost": "Free",
        "size": "40 MB",
        "version": "1.6.0",
        "stars": 2700,
        "last_updated": "04/06/2024",
        "os": "Cross-platform",
        "tags": [
            "dbt",
            "Metrics Layer",
            "Headless BI",
            "Semantic",
            "KPI"
        ],
        "source": "https://docs.getdbt.com/docs/build/dbt-metrics"
    },
    {
        "id": "meltano",
        "name": "Meltano",
        "description": "Meltano is an open-source DataOps platform focused on ELT pipelines. It enables analysts to extract, load, and transform data from numerous sources using Singer taps, dbt, and Airflow. Its analytics stack is modular, CI/CD-ready, and developer-friendly.",
        "category": "Analytics",
        "license": "Apache-2.0",
        "cost": "Free",
        "size": "160 MB",
        "version": "3.0.1",
        "stars": 4700,
        "last_updated": "04/04/2024",
        "os": "Cross-platform",
        "tags": [
            "ETL",
            "DataOps",
            "Singer",
            "dbt",
            "Pipelines"
        ],
        "source": "https://meltano.com"
    },
    {
        "id": "grai",
        "name": "Grai",
        "description": "Grai is a modern open-source data lineage and impact analysis tool. It helps teams visualize dependencies across databases, dbt models, and orchestration systems to support safer changes and better understanding of data flows in analytics pipelines.",
        "category": "Analytics",
        "license": "Apache-2.0",
        "cost": "Free",
        "size": "85 MB",
        "version": "0.3.7",
        "stars": 1000,
        "last_updated": "02/22/2024",
        "os": "Cross-platform",
        "tags": [
            "Lineage",
            "Impact Analysis",
            "Data Flow",
            "Analytics",
            "dbt"
        ],
        "source": "https://www.grai.io"
    },
    {
        "id": "feast",
        "name": "Feast",
        "description": "Feast is an open-source feature store for production ML and analytics workflows. It manages, stores, and serves feature data across training and serving environments. Built for high-performance retrieval and tracking of historical data, it integrates with major data stacks.",
        "category": "Analytics",
        "license": "Apache-2.0",
        "cost": "Free",
        "size": "140 MB",
        "version": "0.40.1",
        "stars": 6500,
        "last_updated": "04/05/2024",
        "os": "Cross-platform",
        "tags": [
            "ML",
            "Feature Store",
            "Analytics",
            "MLOps",
            "Data Management"
        ],
        "source": "https://feast.dev"
    },
    {
        "id": "zenml",
        "name": "ZenML",
        "description": "ZenML is an extensible MLOps framework for reproducible pipelines and analytics workflows. It supports integration with orchestrators, model registries, and metadata stores, providing full lifecycle visibility for analytics-driven model development.",
        "category": "Analytics",
        "license": "Apache-2.0",
        "cost": "Free",
        "size": "120 MB",
        "version": "0.53.2",
        "stars": 3800,
        "last_updated": "03/18/2024",
        "os": "Cross-platform",
        "tags": [
            "MLOps",
            "Pipelines",
            "Metadata",
            "Analytics",
            "Python"
        ],
        "source": "https://zenml.io"
    },
    {
        "id": "hastic",
        "name": "Hastic",
        "description": "Hastic is a time-series anomaly detection and analytics visualization tool that integrates with Grafana. It enables teams to apply algorithms to detect spikes or deviations and then visualize them in real time within monitoring dashboards.",
        "category": "Analytics",
        "license": "MIT",
        "cost": "Free",
        "size": "40 MB",
        "version": "0.7.2",
        "stars": 1200,
        "last_updated": "01/31/2024",
        "os": "Cross-platform",
        "tags": [
            "Time Series",
            "Anomaly Detection",
            "Grafana",
            "Monitoring",
            "Visualization"
        ],
        "source": "https://github.com/hastic/hastic"
    },
    {
        "id": "valohai",
        "name": "Valohai",
        "description": "Valohai is a MLOps platform with a focus on reproducible machine learning pipelines. It provides version control for data, code, and parameters, and allows users to monitor analytics across experiments, compare results, and automate deployment workflows.",
        "category": "Analytics",
        "license": "Commercial",
        "cost": "Custom pricing",
        "size": "Cloud-based",
        "version": "2024",
        "stars": 1400,
        "last_updated": "03/14/2024",
        "os": "Cross-platform",
        "tags": [
            "MLOps",
            "Reproducibility",
            "Pipelines",
            "Version Control",
            "Analytics"
        ],
        "source": "https://valohai.com"
    },
    {
        "id": "dolt",
        "name": "Dolt",
        "description": "Dolt is a version-controlled SQL database that supports Git-like operations on data. Users can branch, merge, and diff tables, enabling collaborative analytics workflows where data provenance and reproducibility are critical.",
        "category": "Analytics",
        "license": "Apache-2.0",
        "cost": "Free",
        "size": "130 MB",
        "version": "1.40.0",
        "stars": 16000,
        "last_updated": "04/09/2024",
        "os": "Cross-platform",
        "tags": [
            "SQL",
            "Version Control",
            "Data Provenance",
            "Analytics",
            "Git"
        ],
        "source": "https://www.dolthub.com"
    },
    {
        "id": "d3fc",
        "name": "d3fc",
        "description": "d3fc is a collection of charting components that extend D3.js for financial and high-performance data visualizations. It includes utilities for rendering line, candlestick, bar, and heatmap charts at scale, useful for real-time analytics in trading and time-series dashboards.",
        "category": "Analytics",
        "license": "MIT",
        "cost": "Free",
        "size": "2.5 MB",
        "version": "15.1.2",
        "stars": 1200,
        "last_updated": "01/23/2024",
        "os": "Cross-platform",
        "tags": [
            "D3",
            "Charts",
            "Time Series",
            "Finance",
            "Real-time"
        ],
        "source": "https://d3fc.io"
    },
    {
        "id": "argo-cd",
        "name": "Argo CD Analytics",
        "description": "Argo CD Analytics is a plugin and extension set for Kubernetes GitOps workflows, offering dashboards and metrics for deployment success, lead time, and resource usage. It allows DevOps teams to track operational KPIs through real-time visual analytics.",
        "category": "Analytics",
        "license": "Apache-2.0",
        "cost": "Free",
        "size": "70 MB",
        "version": "2.9.0",
        "stars": 1500,
        "last_updated": "04/10/2024",
        "os": "Cross-platform",
        "tags": [
            "GitOps",
            "Kubernetes",
            "DevOps",
            "Dashboards",
            "KPIs"
        ],
        "source": "https://argo-cd.readthedocs.io"
    },
    {
        "id": "reductstore",
        "name": "ReductStore",
        "description": "ReductStore is a time-series database designed for storing and querying large volumes of binary data such as images, sensor streams, and IoT analytics. It’s optimized for edge computing environments and supports TTL, retention policies, and analytics on media telemetry.",
        "category": "Analytics",
        "license": "MIT",
        "cost": "Free",
        "size": "50 MB",
        "version": "1.9.1",
        "stars": 800,
        "last_updated": "03/08/2024",
        "os": "Cross-platform",
        "tags": [
            "Time Series",
            "IoT",
            "Binary Data",
            "Edge",
            "Database"
        ],
        "source": "https://reduct.store"
    },
    {
        "id": "clickhouse",
        "name": "ClickHouse",
        "description": "ClickHouse is a high-performance columnar OLAP database used for real-time analytics. It excels at handling massive volumes of data and supports SQL queries with sub-second response times, making it popular for log processing, telemetry, and business intelligence.",
        "category": "Analytics",
        "license": "Apache-2.0",
        "cost": "Free",
        "size": "300 MB",
        "version": "24.3.2",
        "stars": 32000,
        "last_updated": "04/02/2024",
        "os": "Cross-platform",
        "tags": [
            "OLAP",
            "SQL",
            "Big Data",
            "Real-time",
            "Columnar"
        ],
        "source": "https://clickhouse.com"
    },
    {
        "id": "dagster",
        "name": "Dagster",
        "description": "Dagster is a data orchestrator designed for analytics and ML pipelines. It provides a type-safe, testable, and modular workflow environment with built-in observability features. Used by data teams to manage production-grade analytics pipelines efficiently.",
        "category": "Analytics",
        "license": "Apache-2.0",
        "cost": "Free",
        "size": "200 MB",
        "version": "1.7.2",
        "stars": 9800,
        "last_updated": "04/05/2024",
        "os": "Cross-platform",
        "tags": [
            "Data Pipelines",
            "Orchestration",
            "ETL",
            "ML",
            "Observability"
        ],
        "source": "https://dagster.io"
    },
    {
        "id": "pydashboards",
        "name": "PyDashboards",
        "description": "PyDashboards is a lightweight Python framework to create real-time dashboards using Jinja2 templates and Pandas backends. It’s ideal for quick deployment of tabular and chart-based analytics interfaces without needing full React or JavaScript frontends.",
        "category": "Analytics",
        "license": "MIT",
        "cost": "Free",
        "size": "2 MB",
        "version": "0.6.0",
        "stars": 700,
        "last_updated": "02/22/2024",
        "os": "Cross-platform",
        "tags": [
            "Python",
            "Dashboards",
            "Jinja2",
            "Lightweight",
            "Analytics"
        ],
        "source": "https://github.com/py-dashboard/py-dashboard"
    },
    {
        "id": "apache-arrow",
        "name": "Apache Arrow",
        "description": "Apache Arrow is a language-independent columnar memory format optimized for analytical workloads. It allows efficient in-memory data sharing and is the backbone of tools like Pandas, Dask, and Spark for zero-copy interoperability in analytics pipelines.",
        "category": "Analytics",
        "license": "Apache-2.0",
        "cost": "Free",
        "size": "75 MB",
        "version": "15.0.1",
        "stars": 14000,
        "last_updated": "04/04/2024",
        "os": "Cross-platform",
        "tags": [
            "In-memory",
            "Columnar",
            "Zero-copy",
            "Performance",
            "Analytics"
        ],
        "source": "https://arrow.apache.org"
    },
    {
        "id": "superset-embedded-sdk",
        "name": "Superset Embedded SDK",
        "description": "Superset Embedded SDK is a lightweight library to integrate Apache Superset dashboards into external apps. It supports SSO, token-based embedding, and fine-grained access control, making it useful for SaaS companies offering analytics capabilities within their product.",
        "category": "Analytics",
        "license": "Apache-2.0",
        "cost": "Free",
        "size": "3 MB",
        "version": "1.0.3",
        "stars": 500,
        "last_updated": "03/27/2024",
        "os": "Cross-platform",
        "tags": [
            "Embedded BI",
            "SSO",
            "Token",
            "Superset",
            "Dashboards"
        ],
        "source": "https://github.com/apache/superset-embedded-sdk"
    },
    {
        "id": "mlflow-export-import",
        "name": "MLflow Export Import",
        "description": "MLflow Export Import is a plugin library for migrating MLflow experiments, runs, and models across tracking servers. It provides analytics teams with the ability to export metadata, artifacts, and reproducibility history for analysis or auditing purposes.",
        "category": "Analytics",
        "license": "Apache-2.0",
        "cost": "Free",
        "size": "5 MB",
        "version": "1.30.0",
        "stars": 700,
        "last_updated": "02/14/2024",
        "os": "Cross-platform",
        "tags": [
            "MLflow",
            "Audit",
            "Migration",
            "Experiments",
            "Tracking"
        ],
        "source": "https://github.com/mlflow/mlflow-export-import"
    },
    {
        "id": "polyaxon",
        "name": "Polyaxon",
        "description": "Polyaxon is a platform for managing and monitoring machine learning experiments and analytics workflows. It includes tracking, versioning, and visualization for reproducible ML pipelines, supporting both cloud and on-premise deployments with rich metrics dashboards.",
        "category": "Analytics",
        "license": "Commercial",
        "cost": "Free with paid tiers",
        "size": "Cloud or on-prem",
        "version": "1.25.2",
        "stars": 4600,
        "last_updated": "03/10/2024",
        "os": "Cross-platform",
        "tags": [
            "ML",
            "Tracking",
            "Versioning",
            "Dashboard",
            "Analytics"
        ],
        "source": "https://polyaxon.com"
    },
    {
        "id": "redpanda-console",
        "name": "Redpanda Console",
        "description": "Redpanda Console is a real-time analytics UI for Redpanda streaming data. It allows users to monitor, inspect, and query Kafka-compatible streams without writing code. Ideal for debugging and exploratory analytics in event-based systems.",
        "category": "Analytics",
        "license": "Business Source License",
        "cost": "Free (with limits)",
        "size": "90 MB",
        "version": "2.4.1",
        "stars": 2100,
        "last_updated": "04/09/2024",
        "os": "Cross-platform",
        "tags": [
            "Streaming",
            "Kafka",
            "Event Analytics",
            "UI",
            "Debugging"
        ],
        "source": "https://redpanda.com/docs/console"
    },
    {
        "id": "amundsen",
        "name": "Amundsen",
        "description": "Amundsen is a data discovery and metadata engine developed by Lyft. It helps teams discover datasets, track lineage, and view usage metrics. With search and preview capabilities, it's designed to democratize data analytics in large organizations.",
        "category": "Analytics",
        "license": "Apache-2.0",
        "cost": "Free",
        "size": "150 MB",
        "version": "0.6.0",
        "stars": 6900,
        "last_updated": "02/26/2024",
        "os": "Cross-platform",
        "tags": [
            "Data Discovery",
            "Metadata",
            "Lineage",
            "Search",
            "Analytics"
        ],
        "source": "https://www.amundsen.io"
    },
    {
        "id": "kibana-vega",
        "name": "Kibana Vega Plugin",
        "description": "The Kibana Vega Plugin enables custom visualizations in Kibana dashboards using Vega and Vega-Lite grammars. It allows analytics teams to build non-standard visual patterns and advanced statistical charts over Elasticsearch datasets.",
        "category": "Analytics",
        "license": "Elastic License",
        "cost": "Free with Elastic Stack",
        "size": "8 MB",
        "version": "8.12.0",
        "stars": 1500,
        "last_updated": "03/05/2024",
        "os": "Cross-platform",
        "tags": [
            "Vega",
            "Elasticsearch",
            "Kibana",
            "Charts",
            "Customization"
        ],
        "source": "https://www.elastic.co/guide/en/kibana/master/vega-graph.html"
    },
    {
        "id": "caravel",
        "name": "Caravel",
        "description": "Caravel was the original name of Apache Superset. It was a lightweight data exploration platform that offered simple dashboards and SQL editor tools before evolving into Superset. It remains archived but influential in open-source analytics history.",
        "category": "Analytics",
        "license": "Apache-2.0",
        "cost": "Free",
        "size": "100 MB",
        "version": "0.15.4",
        "stars": 2500,
        "last_updated": "2022",
        "os": "Cross-platform",
        "tags": [
            "Archived",
            "Open-source",
            "BI",
            "SQL",
            "Superset"
        ],
        "source": "https://github.com/airbnb/caravel"
    },
    {
        "id": "sequelizer",
        "name": "Sequelizer",
        "description": "Sequelizer is a SQL visualization and analytics tool that transforms raw queries into interactive graphs and insights. It integrates with Postgres, MySQL, and SQLite, providing query history, performance stats, and visualization for data exploration workflows.",
        "category": "Analytics",
        "license": "MIT",
        "cost": "Free",
        "size": "70 MB",
        "version": "1.3.9",
        "stars": 800,
        "last_updated": "01/31/2024",
        "os": "Cross-platform",
        "tags": [
            "SQL",
            "Visualization",
            "Query Tools",
            "Postgres",
            "Insights"
        ],
        "source": "https://github.com/bytebase/sequelizer"
    },
    {
        "id": "streamdal",
        "name": "Streamdal",
        "description": "Streamdal is a data pipeline observability framework that gives real-time insight into message payloads, errors, and schema changes. It’s useful in streaming analytics environments where teams need to ensure data quality and compliance on the fly.",
        "category": "Analytics",
        "license": "Apache-2.0",
        "cost": "Free",
        "size": "45 MB",
        "version": "0.6.2",
        "stars": 600,
        "last_updated": "03/21/2024",
        "os": "Cross-platform",
        "tags": [
            "Streaming",
            "Monitoring",
            "Observability",
            "Schemas",
            "Pipelines"
        ],
        "source": "https://github.com/streamdal/streamdal"
    },
    {
        "id": "pycaret",
        "name": "PyCaret",
        "description": "PyCaret is a low-code machine learning library in Python that enables quick deployment and analysis of models. It supports classification, regression, clustering, and anomaly detection with detailed reports and comparison dashboards — perfect for applied analytics use cases.",
        "category": "Analytics",
        "license": "MIT",
        "cost": "Free",
        "size": "40 MB",
        "version": "3.2.5",
        "stars": 7500,
        "last_updated": "04/06/2024",
        "os": "Cross-platform",
        "tags": [
            "Low-Code",
            "ML",
            "Reports",
            "Dashboards",
            "Python"
        ],
        "source": "https://pycaret.gitbook.io"
    },
    {
        "id": "altinity",
        "name": "Altinity",
        "description": "Altinity provides enterprise-grade tools and support around ClickHouse. It includes dashboards, security analytics, and monitoring layers for high-throughput time-series databases. It's used by companies needing scalable analytics with compliance and governance features.",
        "category": "Analytics",
        "license": "Commercial",
        "cost": "Custom pricing",
        "size": "Cloud or hybrid",
        "version": "2024",
        "stars": 1100,
        "last_updated": "04/01/2024",
        "os": "Cross-platform",
        "tags": [
            "ClickHouse",
            "Time Series",
            "Monitoring",
            "Enterprise",
            "Security"
        ],
        "source": "https://altinity.com"
    },
    {
        "id": "eventnative",
        "name": "EventNative",
        "description": "EventNative is an open-source, real-time event collection and routing system. It captures user interactions and sends data to warehouses like BigQuery, Redshift, or ClickHouse. With built-in analytics support and schema validation, it's ideal for product analytics teams.",
        "category": "Analytics",
        "license": "Apache-2.0",
        "cost": "Free",
        "size": "120 MB",
        "version": "0.15.1",
        "stars": 1800,
        "last_updated": "03/26/2024",
        "os": "Cross-platform",
        "tags": [
            "Event Tracking",
            "ETL",
            "Analytics",
            "Product",
            "Warehouse"
        ],
        "source": "https://eventnative.org"
    },
    {
        "id": "lightning-ai",
        "name": "Lightning AI Studio",
        "description": "Lightning AI Studio is an end-to-end platform for developing and analyzing deep learning workflows. It includes monitoring tools, visualizations, model comparisons, and profiling features. Ideal for ML teams tracking performance analytics at scale.",
        "category": "Analytics",
        "license": "Apache-2.0",
        "cost": "Free with paid options",
        "size": "Cloud-based",
        "version": "2.2.0",
        "stars": 9700,
        "last_updated": "04/12/2024",
        "os": "Cross-platform",
        "tags": [
            "Deep Learning",
            "Visualization",
            "Tracking",
            "AI",
            "Profiling"
        ],
        "source": "https://lightning.ai"
    },
    {
        "id": "turso",
        "name": "Turso",
        "description": "Turso is a distributed SQL database built on SQLite and LibSQL with edge analytics in mind. It offers instant insights through client-side SQL interfaces and supports metrics collection for modern applications operating at the edge.",
        "category": "Analytics",
        "license": "Apache-2.0",
        "cost": "Free (Pro available)",
        "size": "40 MB",
        "version": "v0.2.6",
        "stars": 4100,
        "last_updated": "04/02/2024",
        "os": "Cross-platform",
        "tags": [
            "SQL",
            "Edge",
            "SQLite",
            "Analytics",
            "LibSQL"
        ],
        "source": "https://turso.tech"
    },
    {
        "id": "analytics-rust",
        "name": "Analytics-RS",
        "description": "Analytics-RS is a lightweight Rust analytics library that collects and forwards events from embedded and backend systems. With batching, retries, and cross-platform delivery mechanisms, it’s suited for privacy-aware environments where analytics must be reliable and fast.",
        "category": "Analytics",
        "license": "MIT",
        "cost": "Free",
        "size": "3 MB",
        "version": "0.3.0",
        "stars": 600,
        "last_updated": "02/19/2024",
        "os": "Cross-platform",
        "tags": [
            "Rust",
            "Events",
            "Embedded",
            "Batching",
            "Forwarding"
        ],
        "source": "https://github.com/segmentio/analytics-rust"
    },
    {
        "id": "goatcounter",
        "name": "GoatCounter",
        "description": "GoatCounter is an open-source web analytics platform focused on privacy and minimalism. It doesn’t use cookies and offers simple, self-hosted analytics dashboards for tracking web traffic — ideal for ethical analytics and lightweight usage monitoring.",
        "category": "Analytics",
        "license": "EUPL-1.2",
        "cost": "Free",
        "size": "10 MB",
        "version": "3.5.0",
        "stars": 3600,
        "last_updated": "03/15/2024",
        "os": "Cross-platform",
        "tags": [
            "Web Analytics",
            "Privacy",
            "Self-hosted",
            "Minimal",
            "No Cookies"
        ],
        "source": "https://www.goatcounter.com"
    },
    {
        "id": "redash-fork",
        "name": "Redash Fork (Appsmith)",
        "description": "This is a maintained fork of the original Redash project, managed by Appsmith. It improves performance and supports embedded dashboards, API metrics, and enhanced role-based access, used by startups and enterprises building internal analytics platforms.",
        "category": "Analytics",
        "license": "BSD-2-Clause",
        "cost": "Free",
        "size": "170 MB",
        "version": "11.0.0",
        "stars": 4000,
        "last_updated": "04/06/2024",
        "os": "Cross-platform",
        "tags": [
            "BI",
            "Embedded",
            "Redash",
            "Access Control",
            "Dashboard"
        ],
        "source": "https://github.com/appsmithorg/redash"
    },
    {
        "id": "sigmac",
        "name": "Sigma Computing",
        "description": "Sigma is a cloud-native analytics tool that brings spreadsheet-like interfaces to live cloud data warehouses. It enables business users to explore and analyze data collaboratively, without writing SQL, while retaining governance and scalability.",
        "category": "Analytics",
        "license": "Commercial",
        "cost": "Custom pricing",
        "size": "Cloud-based",
        "version": "2024",
        "stars": 1400,
        "last_updated": "03/28/2024",
        "os": "Cross-platform",
        "tags": [
            "Spreadsheets",
            "No-code",
            "Data Warehouse",
            "BI",
            "Governance"
        ],
        "source": "https://www.sigmacomputing.com"
    },
    {
        "id": "questdb",
        "name": "QuestDB",
        "description": "QuestDB is a high-performance, open-source time-series database optimized for fast ingestion and SQL analytics. It features real-time joins, geospatial support, and millisecond-latency querying, making it suitable for financial, industrial, and telemetry analytics.",
        "category": "Analytics",
        "license": "Apache-2.0",
        "cost": "Free",
        "size": "95 MB",
        "version": "7.3.3",
        "stars": 12000,
        "last_updated": "04/10/2024",
        "os": "Cross-platform",
        "tags": [
            "Time Series",
            "SQL",
            "Database",
            "High Throughput",
            "Real-time"
        ],
        "source": "https://questdb.io"
    },
    {
        "id": "eventbridge-insights",
        "name": "EventBridge Insights",
        "description": "EventBridge Insights is an AWS-native tool for visualizing and analyzing event-driven architectures. It tracks metrics like latency, failures, and throughput across microservices connected via EventBridge, useful for serverless analytics and debugging.",
        "category": "Analytics",
        "license": "Commercial",
        "cost": "Pay-as-you-go",
        "size": "Cloud-based",
        "version": "2024",
        "stars": 600,
        "last_updated": "03/25/2024",
        "os": "Cross-platform",
        "tags": [
            "AWS",
            "EventBridge",
            "Serverless",
            "Monitoring",
            "Metrics"
        ],
        "source": "https://aws.amazon.com/eventbridge"
    },
    {
        "id": "analytics-go",
        "name": "Analytics-Go",
        "description": "Analytics-Go is the official Go SDK for Segment’s analytics API. It allows backend systems and services to track events, user traits, and behavioral flows, often used for product analytics pipelines and customer insight generation.",
        "category": "Analytics",
        "license": "MIT",
        "cost": "Free",
        "size": "3 MB",
        "version": "4.1.1",
        "stars": 1500,
        "last_updated": "01/24/2024",
        "os": "Cross-platform",
        "tags": [
            "Go",
            "Segment",
            "Tracking",
            "API",
            "Events"
        ],
        "source": "https://github.com/segmentio/analytics-go"
    },
    {
        "id": "modin",
        "name": "Modin",
        "description": "Modin is a scalable drop-in replacement for Pandas that accelerates data analytics workflows by distributing data processing across multiple cores or nodes. Built on Ray and Dask, Modin supports large-scale data transformations while maintaining Pandas-like syntax.",
        "category": "Analytics",
        "license": "Apache-2.0",
        "cost": "Free",
        "size": "45 MB",
        "version": "0.27.0",
        "stars": 11000,
        "last_updated": "03/21/2024",
        "os": "Cross-platform",
        "tags": [
            "Pandas",
            "Ray",
            "Dask",
            "Distributed",
            "Python"
        ],
        "source": "https://modin.org"
    },
    {
        "id": "deepnote",
        "name": "Deepnote",
        "description": "Deepnote is a collaborative data science notebook optimized for team-based analytics and cloud integration. It supports real-time editing, versioning, commenting, and integration with SQL, Python, and BI tools — making it a powerful workspace for shared analysis.",
        "category": "Analytics",
        "license": "Commercial",
        "cost": "Free with paid tiers",
        "size": "Cloud-based",
        "version": "2024",
        "stars": 5900,
        "last_updated": "04/04/2024",
        "os": "Cross-platform",
        "tags": [
            "Notebooks",
            "Collaboration",
            "SQL",
            "Python",
            "Analytics"
        ],
        "source": "https://deepnote.com"
    },
    {
        "id": "ml-insights",
        "name": "ML Insights",
        "description": "ML Insights is a Python library for exploratory data analysis and automated feature statistics. It provides visual insights into correlations, drift, distribution, and clustering — ideal for analytics professionals preparing data for machine learning pipelines.",
        "category": "Analytics",
        "license": "MIT",
        "cost": "Free",
        "size": "10 MB",
        "version": "1.2.9",
        "stars": 1400,
        "last_updated": "02/10/2024",
        "os": "Cross-platform",
        "tags": [
            "EDA",
            "Features",
            "Drift",
            "Visualization",
            "ML Prep"
        ],
        "source": "https://github.com/interpretml/ML-Insights"
    },
    {
        "id": "vizzu",
        "name": "Vizzu",
        "description": "Vizzu is a library for creating animated data stories. It allows users to present transitions between visual states — ideal for presentations and educational analytics. Built in WebAssembly with JavaScript and Python bindings, Vizzu focuses on expressive, step-based storytelling.",
        "category": "Analytics",
        "license": "Apache-2.0",
        "cost": "Free",
        "size": "2.3 MB",
        "version": "0.5.0",
        "stars": 1900,
        "last_updated": "03/17/2024",
        "os": "Cross-platform",
        "tags": [
            "Data Stories",
            "Animations",
            "Presentation",
            "JS",
            "Python"
        ],
        "source": "https://lib.vizzuhq.com"
    },
    {
        "id": "pandas-profiling",
        "name": "Pandas Profiling",
        "description": "Pandas Profiling automatically generates interactive reports for exploratory data analysis. It analyzes dataframes and produces descriptive stats, missing value heatmaps, correlations, and warnings — streamlining the analytics process before modeling.",
        "category": "Analytics",
        "license": "MIT",
        "cost": "Free",
        "size": "8 MB",
        "version": "3.6.6",
        "stars": 12000,
        "last_updated": "04/03/2024",
        "os": "Cross-platform",
        "tags": [
            "EDA",
            "Pandas",
            "Reports",
            "Data Quality",
            "Python"
        ],
        "source": "https://github.com/ydataai/pandas-profiling"
    },
    {
        "id": "kibana-lens",
        "name": "Kibana Lens",
        "description": "Kibana Lens is a drag-and-drop visualization builder for Elasticsearch data. It empowers analysts to create insights quickly through auto-aggregated visual elements and offers support for time-series, filters, and threshold logic directly within Kibana.",
        "category": "Analytics",
        "license": "Elastic License",
        "cost": "Free with Elastic Stack",
        "size": "15 MB",
        "version": "8.11.1",
        "stars": 3100,
        "last_updated": "03/29/2024",
        "os": "Cross-platform",
        "tags": [
            "Elasticsearch",
            "Visualization",
            "No-Code",
            "Kibana",
            "Lens"
        ],
        "source": "https://www.elastic.co/kibana/lens"
    },
    {
        "id": "metlo",
        "name": "Metlo",
        "description": "Metlo is an open-source API observability platform focused on analytics and security. It detects usage patterns, logs anomalies, and builds dashboards for tracking request metrics — especially useful for product and infra analytics in backend services.",
        "category": "Analytics",
        "license": "MIT",
        "cost": "Free",
        "size": "60 MB",
        "version": "1.6.1",
        "stars": 3200,
        "last_updated": "04/08/2024",
        "os": "Cross-platform",
        "tags": [
            "API",
            "Monitoring",
            "Security",
            "Metrics",
            "Dashboards"
        ],
        "source": "https://metlo.com"
    },
    {
        "id": "echarts-gl",
        "name": "ECharts GL",
        "description": "ECharts GL extends Apache ECharts with high-performance 3D visualizations using WebGL. It supports heatmaps, surfaces, 3D bar charts, and flow visualizations — enabling data scientists to produce immersive analytics dashboards for geospatial and simulation data.",
        "category": "Analytics",
        "license": "Apache-2.0",
        "cost": "Free",
        "size": "3.4 MB",
        "version": "2.0.9",
        "stars": 2800,
        "last_updated": "01/22/2024",
        "os": "Cross-platform",
        "tags": [
            "3D",
            "WebGL",
            "Visualization",
            "Geospatial",
            "ECharts"
        ],
        "source": "https://github.com/ecomfe/echarts-gl"
    },
    {
        "id": "duckdb",
        "name": "DuckDB",
        "description": "DuckDB is an in-process SQL OLAP database designed for fast analytics on local files like CSV or Parquet. With a zero-dependency design, it enables analysts and data scientists to perform complex queries without a database server setup.",
        "category": "Analytics",
        "license": "MIT",
        "cost": "Free",
        "size": "20 MB",
        "version": "0.10.1",
        "stars": 13000,
        "last_updated": "04/01/2024",
        "os": "Cross-platform",
        "tags": [
            "SQL",
            "OLAP",
            "CSV",
            "Parquet",
            "In-Memory"
        ],
        "source": "https://duckdb.org"
    },
    {
        "id": "gooddata-cn",
        "name": "GoodData.CN",
        "description": "GoodData.CN is a cloud-native analytics engine for embedding dashboards and insights into SaaS platforms. It provides semantic layers, versioned metrics, and role-based access — ideal for companies delivering multi-tenant analytics capabilities at scale.",
        "category": "Analytics",
        "license": "Commercial",
        "cost": "Custom pricing",
        "size": "Cloud-based",
        "version": "3.2.0",
        "stars": 2100,
        "last_updated": "03/31/2024",
        "os": "Cross-platform",
        "tags": [
            "Embedded",
            "Dashboards",
            "Multi-tenant",
            "Semantic",
            "BI"
        ],
        "source": "https://www.gooddata.com/developers/cloud-native/"
    },
    {
        "id": "argo-rollouts",
        "name": "Argo Rollouts Dashboard",
        "description": "Argo Rollouts Dashboard is a visualization and analytics UI for monitoring canary and blue-green deployments in Kubernetes. It provides real-time insight into rollout status, traffic splits, and health metrics, helping DevOps teams make data-driven release decisions.",
        "category": "Analytics",
        "license": "Apache-2.0",
        "cost": "Free",
        "size": "30 MB",
        "version": "1.6.0",
        "stars": 2200,
        "last_updated": "03/20/2024",
        "os": "Cross-platform",
        "tags": [
            "Kubernetes",
            "DevOps",
            "Rollouts",
            "Monitoring",
            "Traffic"
        ],
        "source": "https://github.com/argoproj/argo-rollouts"
    },
    {
        "id": "tensorwatch",
        "name": "TensorWatch",
        "description": "TensorWatch is a debugging and visualization tool for deep learning experiments developed by Microsoft. It supports real-time streams, Jupyter integration, and custom visualizations, enabling detailed analytics and tracking of training metrics.",
        "category": "Analytics",
        "license": "MIT",
        "cost": "Free",
        "size": "12 MB",
        "version": "0.9.1",
        "stars": 3400,
        "last_updated": "02/13/2024",
        "os": "Cross-platform",
        "tags": [
            "Deep Learning",
            "Debugging",
            "Metrics",
            "Visualization",
            "Jupyter"
        ],
        "source": "https://github.com/microsoft/tensorwatch"
    },
    {
        "id": "apache-pinot",
        "name": "Apache Pinot",
        "description": "Apache Pinot is a real-time distributed OLAP datastore designed to deliver low-latency analytics on high-throughput event streams. It supports ingestion from Kafka, batch systems, and cloud storage, and is ideal for dashboards, anomaly detection, and user-facing analytics.",
        "category": "Analytics",
        "license": "Apache-2.0",
        "cost": "Free",
        "size": "200 MB",
        "version": "1.0.0",
        "stars": 12000,
        "last_updated": "04/05/2024",
        "os": "Cross-platform",
        "tags": [
            "Real-time",
            "OLAP",
            "Kafka",
            "Streaming",
            "Dashboards"
        ],
        "source": "https://pinot.apache.org"
    },
    {
        "id": "datadog-rum",
        "name": "Datadog RUM SDK",
        "description": "Datadog RUM SDK provides real-user monitoring and analytics for frontend applications. It captures user sessions, errors, performance metrics, and funnels into custom dashboards for behavior analysis, making it ideal for product and UX teams.",
        "category": "Analytics",
        "license": "Commercial",
        "cost": "Pay-as-you-go",
        "size": "1.5 MB",
        "version": "5.5.0",
        "stars": 1400,
        "last_updated": "03/15/2024",
        "os": "Cross-platform",
        "tags": [
            "Frontend",
            "Monitoring",
            "UX",
            "RUM",
            "Performance"
        ],
        "source": "https://docs.datadoghq.com/real_user_monitoring"
    },
    {
        "id": "voltron-data",
        "name": "Voltron Data Enterprise Engine",
        "description": "Voltron Data's engine is designed for fast in-memory analytics over Arrow-based datasets. It offers interoperability across GPU and CPU pipelines, facilitating large-scale, low-latency computations for BI and ML analytics platforms.",
        "category": "Analytics",
        "license": "Commercial",
        "cost": "Custom pricing",
        "size": "Cloud or edge",
        "version": "2024",
        "stars": 1700,
        "last_updated": "04/10/2024",
        "os": "Cross-platform",
        "tags": [
            "Arrow",
            "GPU",
            "In-memory",
            "BI",
            "ML"
        ],
        "source": "https://voltrondata.com"
    },
    {
        "id": "gretel-trainer",
        "name": "Gretel Trainer",
        "description": "Gretel Trainer is part of Gretel.ai’s suite for synthetic data generation and analytics. It enables model training on structured datasets with visualization of privacy scores, data drift, and schema correlations — all tailored for compliance-sensitive analytics.",
        "category": "Analytics",
        "license": "Commercial",
        "cost": "Free with paid tiers",
        "size": "Cloud-based",
        "version": "2.1.0",
        "stars": 2400,
        "last_updated": "03/11/2024",
        "os": "Cross-platform",
        "tags": [
            "Synthetic Data",
            "Privacy",
            "Compliance",
            "Data Drift",
            "Schema"
        ],
        "source": "https://gretel.ai"
    },
    {
        "id": "constellation",
        "name": "Constellation",
        "description": "Constellation is a visual analytics environment for scalable graph analytics. It supports large-scale link analysis, filtering, and interactive exploration of node relationships — making it especially useful for intelligence and fraud detection applications.",
        "category": "Analytics",
        "license": "BSD-3-Clause",
        "cost": "Free",
        "size": "140 MB",
        "version": "2.11.0",
        "stars": 900,
        "last_updated": "01/30/2024",
        "os": "Cross-platform",
        "tags": [
            "Graph",
            "Link Analysis",
            "Fraud",
            "Visual Exploration",
            "Nodes"
        ],
        "source": "https://github.com/constellation-app/constellation"
    },
    {
        "id": "lightdash",
        "name": "Lightdash",
        "description": "Lightdash is an open-source BI and analytics platform built for dbt. It lets users create metrics, charts, and dashboards using the dbt semantic layer, and supports self-service exploration with role-based controls for embedded use cases.",
        "category": "Analytics",
        "license": "MIT",
        "cost": "Free",
        "size": "90 MB",
        "version": "0.635.0",
        "stars": 3800,
        "last_updated": "04/07/2024",
        "os": "Cross-platform",
        "tags": [
            "BI",
            "dbt",
            "Metrics Layer",
            "Dashboards",
            "Open-source"
        ],
        "source": "https://lightdash.com"
    },
    {
        "id": "cube-cloud",
        "name": "Cube Cloud",
        "description": "Cube Cloud is the hosted version of Cube.js, offering managed analytics APIs for building headless BI platforms. It includes caching, security, multi-tenancy, and pre-aggregations for performance-tuned metrics delivery at scale.",
        "category": "Analytics",
        "license": "Commercial",
        "cost": "Free with paid tiers",
        "size": "Cloud-based",
        "version": "2024",
        "stars": 6800,
        "last_updated": "04/03/2024",
        "os": "Cross-platform",
        "tags": [
            "Headless BI",
            "APIs",
            "Multi-Tenant",
            "Caching",
            "Metrics"
        ],
        "source": "https://cube.dev"
    },
    {
        "id": "superset-scoped",
        "name": "Superset Scoped Filters",
        "description": "Superset Scoped Filters is an advanced feature of Apache Superset that enables dashboard-level filtering based on scoped criteria. It allows analysts to apply specific filters to selected charts, making dashboards more modular and data slices more precise.",
        "category": "Analytics",
        "license": "Apache-2.0",
        "cost": "Free",
        "size": "2.2 MB",
        "version": "2.1.0",
        "stars": 900,
        "last_updated": "02/24/2024",
        "os": "Cross-platform",
        "tags": [
            "Superset",
            "Filters",
            "Dashboards",
            "Charts",
            "Data Slicing"
        ],
        "source": "https://superset.apache.org"
    },
    {
        "id": "streamlit-elements",
        "name": "Streamlit Elements",
        "description": "Streamlit Elements extends Streamlit with support for embedding custom React components including charts, dashboards, and editors. It enables advanced interactive analytics interfaces that go beyond the default Streamlit widgets, ideal for full-featured internal tools.",
        "category": "Analytics",
        "license": "MIT",
        "cost": "Free",
        "size": "3.5 MB",
        "version": "0.1.0",
        "stars": 1300,
        "last_updated": "02/20/2024",
        "os": "Cross-platform",
        "tags": [
            "Streamlit",
            "React",
            "Dashboards",
            "Widgets",
            "Embedded Analytics"
        ],
        "source": "https://github.com/okld/streamlit-elements"
    },
    {
        "id": "snowplow-mini",
        "name": "Snowplow Mini",
        "description": "Snowplow Mini is a small-scale version of Snowplow Analytics, ideal for testing pipelines and rapid analytics prototyping. It includes event collectors, enrichers, and real-time dashboards, helping data teams verify tracking setup in development environments.",
        "category": "Analytics",
        "license": "Apache-2.0",
        "cost": "Free",
        "size": "140 MB",
        "version": "0.20.0",
        "stars": 900,
        "last_updated": "03/08/2024",
        "os": "Cross-platform",
        "tags": [
            "Event Tracking",
            "Testing",
            "ETL",
            "Dashboards",
            "Real-time"
        ],
        "source": "https://github.com/snowplow/snowplow-mini"
    },
    {
        "id": "facets",
        "name": "Facets",
        "description": "Facets is an open-source visualization tool for exploring and understanding machine learning datasets. Developed by Google, it helps data scientists identify feature distributions, missing values, and training-serving skew through interactive analytics panels.",
        "category": "Analytics",
        "license": "Apache-2.0",
        "cost": "Free",
        "size": "6 MB",
        "version": "1.0.0",
        "stars": 7400,
        "last_updated": "01/18/2024",
        "os": "Cross-platform",
        "tags": [
            "ML",
            "Visualization",
            "Dataset Analysis",
            "Training Skew",
            "Google"
        ],
        "source": "https://pair-code.github.io/facets"
    },
    {
        "id": "notebooker",
        "name": "Notebooker",
        "description": "Notebooker turns Jupyter Notebooks into scheduled jobs with parameter injection, result caching, and report distribution. It’s ideal for automating recurring data analytics reports and sharing consistent insights across teams.",
        "category": "Analytics",
        "license": "MIT",
        "cost": "Free",
        "size": "20 MB",
        "version": "0.2.3",
        "stars": 500,
        "last_updated": "02/05/2024",
        "os": "Cross-platform",
        "tags": [
            "Jupyter",
            "Automation",
            "Reporting",
            "Scheduling",
            "Analytics"
        ],
        "source": "https://github.com/man-group/notebooker"
    },
    {
        "id": "argo-metrics",
        "name": "Argo Workflows Metrics",
        "description": "Argo Workflows Metrics provides Prometheus-compatible metrics and dashboards to track analytics over workflow executions. It supports SLA analysis, error rates, and task durations, giving DevOps teams visibility into pipeline health and performance.",
        "category": "Analytics",
        "license": "Apache-2.0",
        "cost": "Free",
        "size": "40 MB",
        "version": "3.5.5",
        "stars": 2800,
        "last_updated": "03/18/2024",
        "os": "Cross-platform",
        "tags": [
            "Workflows",
            "Monitoring",
            "Prometheus",
            "DevOps",
            "SLAs"
        ],
        "source": "https://github.com/argoproj/argo-workflows"
    },
    {
        "id": "onyx-insights",
        "name": "Onyx Insights",
        "description": "Onyx Insights is a real-time monitoring and analytics platform for industrial equipment. It offers vibration analysis, failure prediction, and sensor dashboards — providing predictive analytics across IoT-connected machinery in sectors like wind and energy.",
        "category": "Analytics",
        "license": "Commercial",
        "cost": "Custom pricing",
        "size": "Cloud-based",
        "version": "2024",
        "stars": 600,
        "last_updated": "03/29/2024",
        "os": "Cross-platform",
        "tags": [
            "IoT",
            "Predictive",
            "Vibration",
            "Industrial",
            "Dashboards"
        ],
        "source": "https://onyxinsights.com"
    },
    {
        "id": "kepler-pydeck",
        "name": "PyDeck + Kepler.gl",
        "description": "This combined stack enables Python users to render geospatial visualizations using Kepler.gl within Jupyter environments via PyDeck. It’s ideal for analysts performing spatial data analytics with interactivity and rich mapping layers.",
        "category": "Analytics",
        "license": "MIT",
        "cost": "Free",
        "size": "10 MB",
        "version": "0.8.1",
        "stars": 1700,
        "last_updated": "04/02/2024",
        "os": "Cross-platform",
        "tags": [
            "Python",
            "Geospatial",
            "Jupyter",
            "Mapping",
            "Deck.gl"
        ],
        "source": "https://deckgl.readthedocs.io"
    },
    {
        "id": "microsoft-clarity",
        "name": "Microsoft Clarity",
        "description": "Microsoft Clarity is a free behavioral analytics tool for web apps. It provides session replays, heatmaps, and funnel analysis with no traffic limits. Designed for performance, it's optimized for fast-loading insights with privacy features by default.",
        "category": "Analytics",
        "license": "MIT",
        "cost": "Free",
        "size": "Web-based",
        "version": "2024",
        "stars": 6500,
        "last_updated": "04/05/2024",
        "os": "Cross-platform",
        "tags": [
            "Heatmaps",
            "Web Analytics",
            "Session Replay",
            "Behavior",
            "Free"
        ],
        "source": "https://clarity.microsoft.com"
    },
    {
        "id": "elyra",
        "name": "Elyra AI Pipelines",
        "description": "Elyra is an extension for JupyterLab that provides a visual editor for building and analyzing data pipelines. It allows users to orchestrate notebooks, scripts, and other components into end-to-end analytics workflows with integrated metadata tracking.",
        "category": "Analytics",
        "license": "Apache-2.0",
        "cost": "Free",
        "size": "75 MB",
        "version": "3.15.0",
        "stars": 2900,
        "last_updated": "03/12/2024",
        "os": "Cross-platform",
        "tags": [
            "Jupyter",
            "Pipelines",
            "Visual Editor",
            "Metadata",
            "Notebook Orchestration"
        ],
        "source": "https://elyra.readthedocs.io"
    },
    {
        "id": "argilla",
        "name": "Argilla",
        "description": "Argilla is an open-source tool for data labeling and analytics in NLP projects. It includes tracking and metrics features that let teams monitor annotation quality, perform audits, and analyze large text datasets collaboratively.",
        "category": "Analytics",
        "license": "Apache-2.0",
        "cost": "Free",
        "size": "110 MB",
        "version": "1.16.0",
        "stars": 3000,
        "last_updated": "04/04/2024",
        "os": "Cross-platform",
        "tags": [
            "NLP",
            "Labeling",
            "Metrics",
            "Audits",
            "Collaboration"
        ],
        "source": "https://argilla.io"
    },
    {
        "id": "aporia",
        "name": "Aporia",
        "description": "Aporia is a full-stack ML observability platform designed for monitoring, explaining, and analyzing machine learning models in production. It offers drift detection, custom metrics, performance analytics, and dashboards to ensure robust ML operations.",
        "category": "Analytics",
        "license": "Commercial",
        "cost": "Custom pricing",
        "size": "Cloud-based",
        "version": "2024",
        "stars": 2100,
        "last_updated": "04/01/2024",
        "os": "Cross-platform",
        "tags": [
            "ML Monitoring",
            "Drift Detection",
            "Dashboards",
            "Analytics",
            "Observability"
        ],
        "source": "https://www.aporia.com"
    },
    {
        "id": "sqlglot",
        "name": "SQLGlot",
        "description": "SQLGlot is a no-dependency SQL parser, transpiler, and optimizer written in Python. It supports syntax translation across dialects like BigQuery, Presto, Hive, and others. Used in analytics pipelines for rewriting, optimizing, or linting SQL queries.",
        "category": "Analytics",
        "license": "MIT",
        "cost": "Free",
        "size": "4.2 MB",
        "version": "17.3.0",
        "stars": 7200,
        "last_updated": "04/08/2024",
        "os": "Cross-platform",
        "tags": [
            "SQL",
            "Transpiler",
            "BigQuery",
            "Optimizer",
            "Python"
        ],
        "source": "https://github.com/tobymao/sqlglot"
    },
    {
        "id": "redpajama",
        "name": "RedPajama Analytics",
        "description": "RedPajama provides open data and tools for evaluating large language model performance and behavior. It includes dataset statistics, model analytics, bias detection, and comparative dashboards that support academic and enterprise-level LLM analysis.",
        "category": "Analytics",
        "license": "Apache-2.0",
        "cost": "Free",
        "size": "Cloud-based",
        "version": "1.0.0",
        "stars": 3300,
        "last_updated": "03/31/2024",
        "os": "Cross-platform",
        "tags": [
            "LLM",
            "Benchmarking",
            "Bias",
            "Evaluation",
            "Dashboards"
        ],
        "source": "https://huggingface.co/collections/togethercomputer/redpajama"
    },
    {
        "id": "openllmetry",
        "name": "OpenLLMetry",
        "description": "OpenLLMetry is an observability framework for large language models. It provides telemetry for requests, latency, and embeddings across LLM APIs. With Grafana and Prometheus integration, teams can visualize analytics around prompt usage and response quality.",
        "category": "Analytics",
        "license": "MIT",
        "cost": "Free",
        "size": "40 MB",
        "version": "0.4.0",
        "stars": 950,
        "last_updated": "03/18/2024",
        "os": "Cross-platform",
        "tags": [
            "LLM",
            "Telemetry",
            "Metrics",
            "Prometheus",
            "Grafana"
        ],
        "source": "https://github.com/traceloop/openllmetry"
    },
    {
        "id": "substra",
        "name": "Substra",
        "description": "Substra is an open-source federated analytics and learning platform focused on privacy-preserving machine learning. It supports decentralized data analysis while enforcing governance and traceability — particularly useful in healthcare and finance.",
        "category": "Analytics",
        "license": "Apache-2.0",
        "cost": "Free",
        "size": "130 MB",
        "version": "0.20.1",
        "stars": 1600,
        "last_updated": "02/26/2024",
        "os": "Cross-platform",
        "tags": [
            "Federated Learning",
            "Privacy",
            "Governance",
            "Audit",
            "Decentralized"
        ],
        "source": "https://github.com/Substra"
    },
    {
        "id": "whylabs",
        "name": "WhyLabs",
        "description": "WhyLabs is a monitoring platform for data and ML pipelines. It offers automated data profiling, drift detection, and validation dashboards. Designed to integrate with popular tools like Pandas, Spark, and dbt, it enhances data quality and trust.",
        "category": "Analytics",
        "license": "Commercial",
        "cost": "Free with paid plans",
        "size": "Cloud-based",
        "version": "2024",
        "stars": 3000,
        "last_updated": "04/09/2024",
        "os": "Cross-platform",
        "tags": [
            "ML",
            "Data Quality",
            "Monitoring",
            "Dashboards",
            "Drift"
        ],
        "source": "https://whylabs.ai"
    },
    {
        "id": "trubrics",
        "name": "TruBrics",
        "description": "TruBrics is an open-source framework for collecting structured human feedback on machine learning model predictions. It allows teams to perform analytics on model reliability, user sentiment, and feedback patterns for continuous improvement of ML systems.",
        "category": "Analytics",
        "license": "Apache-2.0",
        "cost": "Free",
        "size": "5 MB",
        "version": "0.4.4",
        "stars": 850,
        "last_updated": "01/31/2024",
        "os": "Cross-platform",
        "tags": [
            "Feedback",
            "ML Evaluation",
            "Sentiment",
            "Continuous Learning",
            "Audit"
        ],
        "source": "https://github.com/trubrics/trubrics"
    },
    {
        "id": "datasette",
        "name": "Datasette",
        "description": "Datasette is an open-source tool for exploring and publishing data as a web app. It allows analysts to query, visualize, and expose SQLite datasets online — supporting plugins for charts, search, and APIs for lightweight analytics use cases.",
        "category": "Analytics",
        "license": "Apache-2.0",
        "cost": "Free",
        "size": "12 MB",
        "version": "0.64.4",
        "stars": 8200,
        "last_updated": "03/27/2024",
        "os": "Cross-platform",
        "tags": [
            "SQLite",
            "Web App",
            "Publishing",
            "APIs",
            "Search"
        ],
        "source": "https://datasette.io"
    },
    {
        "id": "soda-core",
        "name": "Soda Core",
        "description": "Soda Core is a data quality and monitoring tool that allows users to define tests for data validation using YAML. It integrates with modern data stacks like Snowflake, BigQuery, and Redshift, and produces detailed reports for analytics teams.",
        "category": "Analytics",
        "license": "Apache-2.0",
        "cost": "Free",
        "size": "18 MB",
        "version": "3.2.0",
        "stars": 2600,
        "last_updated": "04/05/2024",
        "os": "Cross-platform",
        "tags": [
            "Data Quality",
            "Validation",
            "Monitoring",
            "SQL",
            "YAML"
        ],
        "source": "https://github.com/sodadata/soda-core"
    },
    {
        "id": "visidata",
        "name": "VisiData",
        "description": "VisiData is a terminal-based data exploration tool that enables users to browse, analyze, and transform datasets quickly. It supports CSV, Excel, SQLite, and more, offering command-line analytics for power users and analysts working in text-first environments.",
        "category": "Analytics",
        "license": "GPL-3.0",
        "cost": "Free",
        "size": "3 MB",
        "version": "3.0.3",
        "stars": 6600,
        "last_updated": "04/06/2024",
        "os": "Cross-platform",
        "tags": [
            "Terminal",
            "CLI",
            "CSV",
            "Transformations",
            "Exploration"
        ],
        "source": "https://visidata.org"
    },
    {
        "id": "palantir-foundry",
        "name": "Palantir Foundry",
        "description": "Palantir Foundry is an enterprise data integration and analytics platform used to transform, model, and visualize complex datasets. It offers granular access controls, real-time collaboration, and versioned pipelines — ideal for large-scale operations and mission-critical environments.",
        "category": "Analytics",
        "license": "Commercial",
        "cost": "Custom pricing",
        "size": "Cloud-based",
        "version": "2024",
        "stars": 1800,
        "last_updated": "04/09/2024",
        "os": "Cross-platform",
        "tags": [
            "Enterprise",
            "DataOps",
            "Visualization",
            "Governance",
            "Pipelines"
        ],
        "source": "https://www.palantir.com/platforms/foundry"
    },
    {
        "id": "pachyderm",
        "name": "Pachyderm",
        "description": "Pachyderm is a data versioning and pipeline system designed for scalable analytics and reproducible ML workflows. It integrates Git-like semantics with containerized processing and supports tracking lineage and transformations across analytics pipelines.",
        "category": "Analytics",
        "license": "Apache-2.0",
        "cost": "Free (Pro available)",
        "size": "200 MB",
        "version": "2.8.0",
        "stars": 6600,
        "last_updated": "04/03/2024",
        "os": "Cross-platform",
        "tags": [
            "Version Control",
            "Pipelines",
            "Lineage",
            "Reproducibility",
            "Containers"
        ],
        "source": "https://pachyderm.io"
    },
    {
        "id": "kindly",
        "name": "Kindly",
        "description": "Kindly is a privacy-first product analytics platform designed for SaaS teams. It provides session tracking, funnel insights, and usage metrics without relying on cookies or user-level identifiers — making it ideal for GDPR and CCPA compliance.",
        "category": "Analytics",
        "license": "Commercial",
        "cost": "Free with paid plans",
        "size": "Web-based",
        "version": "2024",
        "stars": 1000,
        "last_updated": "03/19/2024",
        "os": "Cross-platform",
        "tags": [
            "Product Analytics",
            "Privacy",
            "Compliance",
            "Funnel",
            "Tracking"
        ],
        "source": "https://www.kindly.ai"
    },
    {
        "id": "grafiti",
        "name": "Grafiti",
        "description": "Grafiti is a lightweight CLI tool for generating dashboards and reports from SQL queries. It converts SQL output into Markdown, HTML, or PDF reports, making it a helpful utility for quick reporting, scheduling, and analytics documentation.",
        "category": "Analytics",
        "license": "MIT",
        "cost": "Free",
        "size": "1.6 MB",
        "version": "0.7.0",
        "stars": 400,
        "last_updated": "02/20/2024",
        "os": "Cross-platform",
        "tags": [
            "SQL",
            "CLI",
            "Reports",
            "PDF",
            "Markdown"
        ],
        "source": "https://github.com/multiplegeorges/grafiti"
    },
    {
        "id": "sifflet",
        "name": "Sifflet",
        "description": "Sifflet is a modern data observability platform that monitors data freshness, anomalies, lineage, and pipeline health. It is built for data teams to proactively detect issues in analytics workflows and ensure data trustworthiness.",
        "category": "Analytics",
        "license": "Commercial",
        "cost": "Custom pricing",
        "size": "Cloud-based",
        "version": "2024",
        "stars": 1200,
        "last_updated": "04/01/2024",
        "os": "Cross-platform",
        "tags": [
            "Observability",
            "Lineage",
            "Freshness",
            "Monitoring",
            "Anomalies"
        ],
        "source": "https://siffletdata.com"
    },
    {
        "id": "dataform",
        "name": "Dataform",
        "description": "Dataform is a data modeling and transformation platform built for modern cloud warehouses. It helps analytics engineers define datasets and dependencies using SQLX, ensuring reproducible and testable data pipelines with scheduling and version control.",
        "category": "Analytics",
        "license": "Commercial",
        "cost": "Free with Google Cloud",
        "size": "Cloud-based",
        "version": "2024",
        "stars": 4100,
        "last_updated": "04/10/2024",
        "os": "Cross-platform",
        "tags": [
            "SQLX",
            "Modeling",
            "Versioning",
            "Cloud Warehouses",
            "Pipelines"
        ],
        "source": "https://dataform.co"
    },
    {
        "id": "plotapi",
        "name": "PlotAPI",
        "description": "PlotAPI is a Python library for building animated plots and storytelling visualizations. It allows analytics teams to generate timelines, Sankey diagrams, and explorable flows that are ideal for business narratives and interactive presentations.",
        "category": "Analytics",
        "license": "MIT",
        "cost": "Free",
        "size": "4.5 MB",
        "version": "3.5.1",
        "stars": 2000,
        "last_updated": "03/25/2024",
        "os": "Cross-platform",
        "tags": [
            "Visualization",
            "Storytelling",
            "Python",
            "Sankey",
            "Timelines"
        ],
        "source": "https://github.com/PlotAPI/plotapi"
    },
    {
        "id": "zeno",
        "name": "Zeno",
        "description": "Zeno is an analytics and evaluation framework for testing ML models. It allows teams to group model outputs, label errors, and calculate metrics like F1 and bias by slice. Zeno integrates with Hugging Face and OpenAI pipelines for LLM analytics.",
        "category": "Analytics",
        "license": "Apache-2.0",
        "cost": "Free",
        "size": "7 MB",
        "version": "1.1.0",
        "stars": 1300,
        "last_updated": "03/14/2024",
        "os": "Cross-platform",
        "tags": [
            "Evaluation",
            "Bias",
            "Slicing",
            "LLM",
            "ML Testing"
        ],
        "source": "https://github.com/zeno-ml/zeno"
    },
    {
        "id": "kaskada",
        "name": "Kaskada",
        "description": "Kaskada is a time-aware analytics engine designed for feature engineering and event stream transformation. It provides a declarative language to define time-based features from raw logs, ideal for ML teams needing consistent and reproducible input pipelines.",
        "category": "Analytics",
        "license": "Apache-2.0",
        "cost": "Free",
        "size": "75 MB",
        "version": "0.6.2",
        "stars": 1500,
        "last_updated": "02/18/2024",
        "os": "Cross-platform",
        "tags": [
            "Feature Engineering",
            "Streaming",
            "Event Data",
            "Declarative",
            "Temporal"
        ],
        "source": "https://github.com/kaskada-ai/kaskada"
    },
    {
        "id": "mlcube",
        "name": "MLCube",
        "description": "MLCube is a framework for standardizing ML model packaging and benchmarking across environments. It simplifies running analytics workloads by creating containerized, repeatable configurations that integrate easily into pipelines or leaderboard setups.",
        "category": "Analytics",
        "license": "Apache-2.0",
        "cost": "Free",
        "size": "65 MB",
        "version": "0.5.1",
        "stars": 1000,
        "last_updated": "03/06/2024",
        "os": "Cross-platform",
        "tags": [
            "Benchmarking",
            "Containers",
            "Standardization",
            "ML",
            "Reproducibility"
        ],
        "source": "https://github.com/mlcommons/mlcube"
    },
    {
        "id": "uplimit",
        "name": "Uplimit",
        "description": "Uplimit is a cloud-native experimentation and analytics platform focused on product iteration. It allows teams to run A/B tests, track feature flags, and analyze statistical significance with built-in dashboards, helping guide data-driven product decisions.",
        "category": "Analytics",
        "license": "Commercial",
        "cost": "Custom pricing",
        "size": "Cloud-based",
        "version": "2024",
        "stars": 1200,
        "last_updated": "03/26/2024",
        "os": "Cross-platform",
        "tags": [
            "A/B Testing",
            "Experimentation",
            "Feature Flags",
            "Dashboards",
            "Product Analytics"
        ],
        "source": "https://uplimit.com"
    },
    {
        "id": "bitquery",
        "name": "Bitquery",
        "description": "Bitquery is a blockchain data analytics platform that aggregates on-chain data from multiple blockchains into a unified GraphQL interface. It enables developers and analysts to build dashboards, monitor transactions, and extract insights across DeFi and NFTs.",
        "category": "Analytics",
        "license": "Commercial",
        "cost": "Free with usage limits",
        "size": "Cloud-based",
        "version": "2024",
        "stars": 1900,
        "last_updated": "04/02/2024",
        "os": "Cross-platform",
        "tags": [
            "Blockchain",
            "GraphQL",
            "DeFi",
            "NFT",
            "APIs"
        ],
        "source": "https://bitquery.io"
    },
    {
        "id": "metabase-headless",
        "name": "Metabase Headless",
        "description": "Metabase Headless is a backend-first mode of Metabase that enables developers to embed analytics in custom apps using its REST and GraphQL APIs. It allows analytics teams to build tailored dashboards with fine-grained control over data and UI behavior.",
        "category": "Analytics",
        "license": "AGPL-3.0",
        "cost": "Free (Enterprise available)",
        "size": "180 MB",
        "version": "1.47.2",
        "stars": 35000,
        "last_updated": "03/30/2024",
        "os": "Cross-platform",
        "tags": [
            "Embedded Analytics",
            "REST",
            "GraphQL",
            "Dashboards",
            "Headless BI"
        ],
        "source": "https://metabase.com/docs/latest/headless"
    },
    {
        "id": "featureform",
        "name": "Featureform",
        "description": "Featureform is a virtual feature store that centralizes features from various data pipelines without moving data. It standardizes analytics workflows by enabling versioned, documented, and permissioned access to ML-ready feature definitions.",
        "category": "Analytics",
        "license": "Apache-2.0",
        "cost": "Free",
        "size": "90 MB",
        "version": "0.7.0",
        "stars": 1400,
        "last_updated": "04/04/2024",
        "os": "Cross-platform",
        "tags": [
            "Feature Store",
            "ML",
            "Standardization",
            "Access Control",
            "Analytics"
        ],
        "source": "https://github.com/featureform/featureform"
    },
    {
        "id": "datahub-airflow-plugin",
        "name": "DataHub Airflow Plugin",
        "description": "This plugin connects Apache Airflow with DataHub, allowing automatic lineage extraction, pipeline metadata publishing, and task analytics. It enhances visibility into DAG execution and supports monitoring transformations across workflows.",
        "category": "Analytics",
        "license": "Apache-2.0",
        "cost": "Free",
        "size": "10 MB",
        "version": "0.9.0",
        "stars": 800,
        "last_updated": "03/27/2024",
        "os": "Cross-platform",
        "tags": [
            "Airflow",
            "Lineage",
            "Metadata",
            "Monitoring",
            "DAGs"
        ],
        "source": "https://github.com/datahub-project/datahub-integrations/tree/master/airflow"
    },
    {
        "id": "looker-sdk",
        "name": "Looker SDK for Python",
        "description": "The Looker SDK for Python provides a convenient interface to query Looker data, run analytics workflows, and automate dashboard creation. It integrates seamlessly with Jupyter notebooks and scripting environments for scalable data retrieval and reporting.",
        "category": "Analytics",
        "license": "MIT",
        "cost": "Free",
        "size": "5 MB",
        "version": "22.20.0",
        "stars": 1700,
        "last_updated": "02/29/2024",
        "os": "Cross-platform",
        "tags": [
            "Looker",
            "SDK",
            "Jupyter",
            "Reporting",
            "Automation"
        ],
        "source": "https://github.com/looker-open-source/sdk-codegen"
    },
    {
        "id": "apollo-studio",
        "name": "Apollo Studio",
        "description": "Apollo Studio is a cloud platform for managing and analyzing GraphQL APIs. It provides field usage tracking, error trends, performance metrics, and schema analytics — essential for API-driven product and usage analytics teams.",
        "category": "Analytics",
        "license": "Commercial",
        "cost": "Free with paid plans",
        "size": "Cloud-based",
        "version": "2024",
        "stars": 8000,
        "last_updated": "03/22/2024",
        "os": "Cross-platform",
        "tags": [
            "GraphQL",
            "API Analytics",
            "Monitoring",
            "Usage",
            "Performance"
        ],
        "source": "https://www.apollographql.com/studio"
    },
    {
        "id": "traceloop",
        "name": "Traceloop",
        "description": "Traceloop is an observability and analytics toolkit for AI workflows and LLM chains. It helps developers track latency, embeddings, and prompt metadata through OpenTelemetry-compatible pipelines — enhancing understanding of model behavior.",
        "category": "Analytics",
        "license": "Apache-2.0",
        "cost": "Free",
        "size": "55 MB",
        "version": "0.8.2",
        "stars": 1200,
        "last_updated": "03/28/2024",
        "os": "Cross-platform",
        "tags": [
            "LLM",
            "OpenTelemetry",
            "Observability",
            "AI Chains",
            "Latency"
        ],
        "source": "https://github.com/traceloop/openllmetry"
    },
    {
        "id": "weld",
        "name": "Weld",
        "description": "Weld is a runtime and optimizer for performing analytics on large datasets with improved performance. It acts as a backend for data processing libraries like Pandas and NumPy, fusing operations together for faster execution through LLVM compilation.",
        "category": "Analytics",
        "license": "Apache-2.0",
        "cost": "Free",
        "size": "80 MB",
        "version": "0.3.2",
        "stars": 2700,
        "last_updated": "01/31/2024",
        "os": "Cross-platform",
        "tags": [
            "Optimization",
            "LLVM",
            "Pandas",
            "NumPy",
            "Fusion"
        ],
        "source": "https://github.com/weld-project/weld"
    },
    {
        "id": "llmonitor",
        "name": "LLMonitor",
        "description": "LLMonitor is a lightweight tracking library for large language model usage. It logs prompts, latency, token counts, and cost across providers like OpenAI and Anthropic, offering analytics dashboards and developer alerts for API consumers.",
        "category": "Analytics",
        "license": "MIT",
        "cost": "Free",
        "size": "2.5 MB",
        "version": "0.4.0",
        "stars": 600,
        "last_updated": "04/10/2024",
        "os": "Cross-platform",
        "tags": [
            "LLM",
            "Prompt Logs",
            "Cost Tracking",
            "Token Usage",
            "Monitoring"
        ],
        "source": "https://github.com/langfuse/llmonitor"
    },
    {
        "id": "lance",
        "name": "Lance",
        "description": "Lance is a modern columnar data format designed for analytics and machine learning workloads. It offers fast updates, versioning, and vector search capabilities, making it suitable for building real-time, scalable analytics pipelines over local or cloud storage.",
        "category": "Analytics",
        "license": "Apache-2.0",
        "cost": "Free",
        "size": "50 MB",
        "version": "0.7.0",
        "stars": 1800,
        "last_updated": "04/08/2024",
        "os": "Cross-platform",
        "tags": [
            "Columnar Format",
            "Versioning",
            "Vector Search",
            "ML",
            "Cloud Storage"
        ],
        "source": "https://github.com/lancedb/lance"
    },
    {
        "id": "giskard",
        "name": "Giskard",
        "description": "Giskard is an open-source tool that brings testing and validation to ML models. It provides explainability analytics, bias tests, and robustness evaluation with human-in-the-loop feedback, enabling data scientists to ensure safe and fair models.",
        "category": "Analytics",
        "license": "Apache-2.0",
        "cost": "Free",
        "size": "45 MB",
        "version": "2.2.1",
        "stars": 2800,
        "last_updated": "04/03/2024",
        "os": "Cross-platform",
        "tags": [
            "Explainability",
            "Bias",
            "Model Testing",
            "Validation",
            "Analytics"
        ],
        "source": "https://github.com/Giskard-AI/giskard"
    },
    {
        "id": "altair",
        "name": "Altair",
        "description": "Altair is a declarative statistical visualization library for Python, based on Vega and Vega-Lite. It offers concise grammar to build interactive charts with fewer lines of code, making it a favorite among analysts and data scientists for exploratory visual analytics.",
        "category": "Analytics",
        "license": "BSD-3-Clause",
        "cost": "Free",
        "size": "3 MB",
        "version": "5.2.0",
        "stars": 8600,
        "last_updated": "03/26/2024",
        "os": "Cross-platform",
        "tags": [
            "Visualization",
            "Declarative",
            "Python",
            "Charts",
            "EDA"
        ],
        "source": "https://altair-viz.github.io"
    },
    {
        "id": "drift-detection",
        "name": "Drift Detection Library",
        "description": "Drift Detection Library (DDDetect) is a Python library for detecting dataset drift in machine learning pipelines. It offers metrics, visualizations, and alerts that help teams identify shifts in production data distributions and maintain model accuracy.",
        "category": "Analytics",
        "license": "MIT",
        "cost": "Free",
        "size": "6 MB",
        "version": "0.2.7",
        "stars": 700,
        "last_updated": "02/28/2024",
        "os": "Cross-platform",
        "tags": [
            "Drift",
            "Monitoring",
            "ML",
            "Data Validation",
            "Alerts"
        ],
        "source": "https://github.com/adrinjalali/dddetect"
    },
    {
        "id": "pandera",
        "name": "Pandera",
        "description": "Pandera is a statistical data validation tool for Pandas dataframes. It provides schema checks, type validation, and conditional rules for analytics pipelines, ensuring data quality and preventing silent errors during preprocessing.",
        "category": "Analytics",
        "license": "MIT",
        "cost": "Free",
        "size": "5.1 MB",
        "version": "0.18.3",
        "stars": 1600,
        "last_updated": "04/07/2024",
        "os": "Cross-platform",
        "tags": [
            "Data Quality",
            "Validation",
            "Pandas",
            "Schema",
            "Python"
        ],
        "source": "https://pandera.readthedocs.io"
    },
    {
        "id": "jsonvisio",
        "name": "JSON Visio",
        "description": "JSON Visio is a simple and interactive visualization tool for JSON structures. It transforms complex nested data into intuitive trees and graphs, helping analysts debug and explore large API responses or unstructured analytics data.",
        "category": "Analytics",
        "license": "MIT",
        "cost": "Free",
        "size": "Web-based",
        "version": "2.3.0",
        "stars": 2400,
        "last_updated": "03/30/2024",
        "os": "Cross-platform",
        "tags": [
            "JSON",
            "Visualization",
            "APIs",
            "Debugging",
            "Tree View"
        ],
        "source": "https://jsonvisio.com"
    },
    {
        "id": "visgl-deck",
        "name": "Deck.gl",
        "description": "Deck.gl is a WebGL-powered framework for large-scale geospatial and temporal analytics visualizations. It supports rendering millions of data points interactively on maps, making it ideal for real-time spatial analytics and urban planning dashboards.",
        "category": "Analytics",
        "license": "MIT",
        "cost": "Free",
        "size": "6.7 MB",
        "version": "8.9.24",
        "stars": 11500,
        "last_updated": "04/04/2024",
        "os": "Cross-platform",
        "tags": [
            "WebGL",
            "Geospatial",
            "Real-time",
            "Maps",
            "Visualization"
        ],
        "source": "https://deck.gl"
    },
    {
        "id": "rubrix",
        "name": "Rubrix",
        "description": "Rubrix is a data curation and labeling tool for NLP analytics pipelines. It helps teams explore, tag, and monitor text datasets interactively, integrating with Hugging Face and spaCy for seamless model feedback and iteration.",
        "category": "Analytics",
        "license": "Apache-2.0",
        "cost": "Free",
        "size": "95 MB",
        "version": "1.15.0",
        "stars": 1800,
        "last_updated": "03/20/2024",
        "os": "Cross-platform",
        "tags": [
            "NLP",
            "Labeling",
            "Text Analytics",
            "Monitoring",
            "spaCy"
        ],
        "source": "https://github.com/argilla-io/rubrix"
    },
    {
        "id": "graspologic",
        "name": "graspologic",
        "description": "graspologic is a graph analytics library built for structural pattern discovery and dimensionality reduction in large networks. It supports community detection, embedding, and statistical graph models for social and biological network analysis.",
        "category": "Analytics",
        "license": "MIT",
        "cost": "Free",
        "size": "30 MB",
        "version": "3.0.0",
        "stars": 1100,
        "last_updated": "02/21/2024",
        "os": "Cross-platform",
        "tags": [
            "Graph",
            "Embedding",
            "Clustering",
            "Networks",
            "Pattern Discovery"
        ],
        "source": "https://github.com/microsoft/graspologic"
    },
    {
        "id": "evalml",
        "name": "EvalML",
        "description": "EvalML is an AutoML library for building, evaluating, and explaining machine learning pipelines. It helps analytics teams automatically search for the best model, optimize features, and compare pipeline performance using interpretable metrics.",
        "category": "Analytics",
        "license": "BSD-3-Clause",
        "cost": "Free",
        "size": "50 MB",
        "version": "0.91.0",
        "stars": 3100,
        "last_updated": "04/10/2024",
        "os": "Cross-platform",
        "tags": [
            "AutoML",
            "Evaluation",
            "Pipelines",
            "Metrics",
            "Interpretability"
        ],
        "source": "https://github.com/alteryx/evalml"
    },
    {
        "id": "mlfoundry",
        "name": "MLFoundry",
        "description": "MLFoundry is a machine learning observability and analytics framework that tracks experiment metadata, dataset versions, metrics, and performance over time. It integrates with MLflow and other MLOps tools, offering dashboards for lifecycle transparency and traceability.",
        "category": "Analytics",
        "license": "Apache-2.0",
        "cost": "Free",
        "size": "60 MB",
        "version": "0.3.7",
        "stars": 1400,
        "last_updated": "03/28/2024",
        "os": "Cross-platform",
        "tags": [
            "ML Observability",
            "Metrics",
            "Traceability",
            "MLflow",
            "Lifecycle"
        ],
        "source": "https://github.com/unionai-oss/mlfoundry"
    },
    {
        "id": "touca",
        "name": "Touca",
        "description": "Touca is an open-source regression testing and result analytics tool for engineering teams. It provides performance tracking, input/output comparisons, and detailed change analysis to help teams measure code changes and quality trends over time.",
        "category": "Analytics",
        "license": "Apache-2.0",
        "cost": "Free",
        "size": "75 MB",
        "version": "1.9.1",
        "stars": 900,
        "last_updated": "04/02/2024",
        "os": "Cross-platform",
        "tags": [
            "Regression Testing",
            "Analytics",
            "DevOps",
            "Metrics",
            "Performance"
        ],
        "source": "https://github.com/trytouca/touca"
    },
    {
        "id": "releaseninja",
        "name": "Release Ninja",
        "description": "Release Ninja is a release analytics and changelog automation tool that helps track, tag, and visualize feature deployments across repositories. It provides insights on delivery pace, scope, and frequency of updates — ideal for product analytics.",
        "category": "Analytics",
        "license": "MIT",
        "cost": "Free",
        "size": "20 MB",
        "version": "2.1.0",
        "stars": 600,
        "last_updated": "02/19/2024",
        "os": "Cross-platform",
        "tags": [
            "Releases",
            "Changelog",
            "GitHub",
            "Product Delivery",
            "Dev Analytics"
        ],
        "source": "https://github.com/releaseninja/releaseninja"
    },
    {
        "id": "eventql",
        "name": "EventQL",
        "description": "EventQL is a distributed, SQL-compatible database optimized for real-time event analytics. It enables developers to aggregate and analyze billions of events with sub-second latency and is ideal for applications like clickstream and telemetry data processing.",
        "category": "Analytics",
        "license": "AGPL-3.0",
        "cost": "Free",
        "size": "180 MB",
        "version": "1.3.2",
        "stars": 1600,
        "last_updated": "03/22/2024",
        "os": "Cross-platform",
        "tags": [
            "Event Analytics",
            "SQL",
            "Telemetry",
            "Clickstream",
            "Real-time"
        ],
        "source": "https://eventql.io"
    },
    {
        "id": "azimuth",
        "name": "Azimuth",
        "description": "Azimuth is a tool for visualizing and debugging natural language processing model performance. It enables analysis of misclassifications, confidence thresholds, and dataset slices to identify model blind spots — especially useful in LLM analytics.",
        "category": "Analytics",
        "license": "Apache-2.0",
        "cost": "Free",
        "size": "85 MB",
        "version": "0.7.3",
        "stars": 1300,
        "last_updated": "03/19/2024",
        "os": "Cross-platform",
        "tags": [
            "NLP",
            "Debugging",
            "Model Analysis",
            "Bias",
            "LLM"
        ],
        "source": "https://github.com/servicenow/azimuth"
    },
    {
        "id": "geowrangler",
        "name": "GeoWrangler",
        "description": "GeoWrangler is a Python package designed for geospatial data preprocessing and analytics. It offers helpers for coordinate transformations, joins, and spatial aggregations, making it valuable for analysts working on location-based analytics projects.",
        "category": "Analytics",
        "license": "MIT",
        "cost": "Free",
        "size": "9 MB",
        "version": "0.5.1",
        "stars": 800,
        "last_updated": "02/27/2024",
        "os": "Cross-platform",
        "tags": [
            "Geospatial",
            "Preprocessing",
            "Python",
            "Analytics",
            "Coordinates"
        ],
        "source": "https://github.com/rapidsai/geo_wranger"
    },
    {
        "id": "ploomber",
        "name": "Ploomber",
        "description": "Ploomber is a data pipeline framework that turns Jupyter notebooks into modular, testable pipelines. It supports scheduling, DAG management, and notebook analytics, making it a strong tool for analysts working in exploratory environments.",
        "category": "Analytics",
        "license": "Apache-2.0",
        "cost": "Free",
        "size": "50 MB",
        "version": "0.23.2",
        "stars": 3300,
        "last_updated": "03/31/2024",
        "os": "Cross-platform",
        "tags": [
            "Notebooks",
            "Pipelines",
            "DAG",
            "Scheduling",
            "Analytics"
        ],
        "source": "https://github.com/ploomber/ploomber"
    },
    {
        "id": "redun",
        "name": "Redun",
        "description": "Redun is a workflow engine designed for analytics, ML, and scientific computing. It supports lazy evaluation, memoization, and data provenance, allowing users to write maintainable Python code while getting full tracking of dependencies and task outcomes.",
        "category": "Analytics",
        "license": "MIT",
        "cost": "Free",
        "size": "60 MB",
        "version": "0.8.1",
        "stars": 1000,
        "last_updated": "04/04/2024",
        "os": "Cross-platform",
        "tags": [
            "Workflow",
            "Memoization",
            "Python",
            "Provenance",
            "ML"
        ],
        "source": "https://github.com/insitro/redun"
    },
    {
        "id": "fiberplane",
        "name": "Fiberplane",
        "description": "Fiberplane is a notebook-style observability platform for infrastructure and incident response analytics. It lets teams combine logs, metrics, and traces into collaborative notebooks with annotations and real-time exploration for postmortems.",
        "category": "Analytics",
        "license": "Commercial",
        "cost": "Custom pricing",
        "size": "Cloud-based",
        "version": "2024",
        "stars": 900,
        "last_updated": "04/01/2024",
        "os": "Cross-platform",
        "tags": [
            "Observability",
            "Notebook",
            "Incidents",
            "Logs",
            "Traces"
        ],
        "source": "https://fiberplane.com"
    },
    {
        "id": "dataherald",
        "name": "Dataherald",
        "description": "Dataherald is a natural language-to-SQL analytics platform that enables non-technical users to query databases through conversational interfaces. It supports semantic modeling, intent classification, and metrics definitions for self-service analytics.",
        "category": "Analytics",
        "license": "Commercial",
        "cost": "Free with paid tiers",
        "size": "Cloud-based",
        "version": "2024",
        "stars": 1100,
        "last_updated": "04/09/2024",
        "os": "Cross-platform",
        "tags": [
            "NLP",
            "SQL",
            "Self-Service",
            "Semantic Layer",
            "Conversational BI"
        ],
        "source": "https://dataherald.com"
    },
    {
        "id": "squark",
        "name": "Squark",
        "description": "Squark is a no-code AutoML platform that enables business analysts to build, explain, and deploy predictive models. It includes analytics dashboards for evaluating model performance, detecting feature importance, and validating use-case alignment.",
        "category": "Analytics",
        "license": "Commercial",
        "cost": "Free trial with paid tiers",
        "size": "Cloud-based",
        "version": "2024",
        "stars": 700,
        "last_updated": "03/21/2024",
        "os": "Cross-platform",
        "tags": [
            "AutoML",
            "No-Code",
            "Predictive Analytics",
            "Business Intelligence",
            "Explainability"
        ],
        "source": "https://squarkai.com"
    },
    {
        "id": "promptlayer",
        "name": "PromptLayer",
        "description": "PromptLayer is a prompt engineering and observability platform for LLM applications. It tracks prompts, responses, and model versions to help teams monitor LLM performance, test changes, and conduct analytics on prompt effectiveness.",
        "category": "Analytics",
        "license": "MIT",
        "cost": "Free with paid options",
        "size": "Cloud-based",
        "version": "0.7.0",
        "stars": 3000,
        "last_updated": "03/29/2024",
        "os": "Cross-platform",
        "tags": [
            "LLM",
            "Prompt Engineering",
            "Observability",
            "A/B Testing",
            "Monitoring"
        ],
        "source": "https://github.com/promptlayer/promptlayer"
    },
    {
        "id": "mlte",
        "name": "MLTE",
        "description": "ML Test Engine (MLTE) is a framework for managing and analyzing the testing of ML systems across components. It tracks coverage across data, models, and infrastructure, and enables scoring and dashboards for evaluating ML product readiness.",
        "category": "Analytics",
        "license": "Apache-2.0",
        "cost": "Free",
        "size": "48 MB",
        "version": "0.1.8",
        "stars": 1000,
        "last_updated": "03/18/2024",
        "os": "Cross-platform",
        "tags": [
            "ML Testing",
            "Scoring",
            "Evaluation",
            "Infrastructure",
            "Metrics"
        ],
        "source": "https://github.com/mlte-team/mlte"
    },
    {
        "id": "truth-table",
        "name": "Truth Table",
        "description": "Truth Table is a collaborative SQL notebook for teams to write, analyze, and share SQL queries with version history and embedded visualizations. It supports charting, parameterized queries, and scheduled reporting for team-based analytics.",
        "category": "Analytics",
        "license": "Commercial",
        "cost": "Custom pricing",
        "size": "Web-based",
        "version": "2024",
        "stars": 800,
        "last_updated": "04/03/2024",
        "os": "Cross-platform",
        "tags": [
            "SQL",
            "Notebooks",
            "Visualization",
            "Reporting",
            "Collaboration"
        ],
        "source": "https://truthtable.io"
    },
    {
        "id": "explainerdashboard",
        "name": "ExplainerDashboard",
        "description": "ExplainerDashboard is a Python package that builds interactive dashboards for explaining machine learning models using SHAP values and performance metrics. It is often used for analytics-driven model interpretation and stakeholder presentations.",
        "category": "Analytics",
        "license": "MIT",
        "cost": "Free",
        "size": "9 MB",
        "version": "0.4.3",
        "stars": 1300,
        "last_updated": "04/05/2024",
        "os": "Cross-platform",
        "tags": [
            "Explainability",
            "SHAP",
            "Dashboards",
            "Python",
            "Interpretability"
        ],
        "source": "https://github.com/oegedijk/explainerdashboard"
    },
    {
        "id": "openpipe",
        "name": "OpenPipe",
        "description": "OpenPipe is an analytics and optimization tool for LLM applications. It helps teams collect structured prompt-response data, measure response quality, and fine-tune models with feedback analytics, ideal for continuous improvement in GenAI systems.",
        "category": "Analytics",
        "license": "Apache-2.0",
        "cost": "Free with paid plans",
        "size": "Cloud-based",
        "version": "1.3.1",
        "stars": 2200,
        "last_updated": "04/10/2024",
        "os": "Cross-platform",
        "tags": [
            "LLM",
            "Analytics",
            "Fine-Tuning",
            "Prompt Feedback",
            "GenAI"
        ],
        "source": "https://github.com/openpipe/openpipe"
    },
    {
        "id": "tuneviz",
        "name": "TuneViz",
        "description": "TuneViz is a hyperparameter tuning visualization tool designed for ML practitioners. It provides multi-metric plots, performance distributions, and convergence curves to understand tuning analytics across model training experiments.",
        "category": "Analytics",
        "license": "MIT",
        "cost": "Free",
        "size": "12 MB",
        "version": "0.6.0",
        "stars": 650,
        "last_updated": "02/26/2024",
        "os": "Cross-platform",
        "tags": [
            "Hyperparameter Tuning",
            "Visualization",
            "ML",
            "Metrics",
            "Optimization"
        ],
        "source": "https://github.com/tuneviz/tuneviz"
    },
    {
        "id": "evidently-langchain",
        "name": "Evidently LangChain Plugin",
        "description": "The LangChain integration for Evidently brings observability to LLM chains. It logs prompt results, errors, and latency, providing analytics and quality monitoring for multi-step reasoning pipelines and AI agent chains.",
        "category": "Analytics",
        "license": "Apache-2.0",
        "cost": "Free",
        "size": "8 MB",
        "version": "0.3.0",
        "stars": 1000,
        "last_updated": "04/01/2024",
        "os": "Cross-platform",
        "tags": [
            "LangChain",
            "LLM",
            "Monitoring",
            "Quality",
            "Observability"
        ],
        "source": "https://github.com/evidentlyai/evidently"
    },
    {
        "id": "octolis",
        "name": "Octolis",
        "description": "Octolis is a modern customer data platform (CDP) for data-driven marketing and analytics. It unifies customer profiles across systems, enables segmentation, and provides analytics on campaign performance and user behavior with privacy compliance.",
        "category": "Analytics",
        "license": "Commercial",
        "cost": "Custom pricing",
        "size": "Cloud-based",
        "version": "2024",
        "stars": 1200,
        "last_updated": "04/06/2024",
        "os": "Cross-platform",
        "tags": [
            "CDP",
            "Marketing",
            "Segmentation",
            "Campaigns",
            "User Analytics"
        ],
        "source": "https://octolis.com"
    },
    {
        "id": "airbyte-metrics",
        "name": "Airbyte Metrics",
        "description": "Airbyte Metrics is a monitoring and analytics extension for Airbyte data pipelines. It provides dashboards for sync status, error rates, throughput, and resource usage — essential for ensuring data ingestion health and debugging integration issues.",
        "category": "Analytics",
        "license": "MIT",
        "cost": "Free",
        "size": "14 MB",
        "version": "1.1.5",
        "stars": 800,
        "last_updated": "03/25/2024",
        "os": "Cross-platform",
        "tags": [
            "Airbyte",
            "ETL",
            "Monitoring",
            "Pipelines",
            "Debugging"
        ],
        "source": "https://github.com/airbytehq/airbyte"
    },
    {
        "id": "llmonitor-cloud",
        "name": "LLMonitor Cloud",
        "description": "LLMonitor Cloud is a hosted solution for logging, visualizing, and analyzing LLM interactions. It provides prompt-level metrics, cost insights, latency tracking, and audit logs — ideal for developers optimizing usage and reliability of GenAI apps.",
        "category": "Analytics",
        "license": "MIT",
        "cost": "Free with paid plans",
        "size": "Cloud-based",
        "version": "0.5.2",
        "stars": 700,
        "last_updated": "04/05/2024",
        "os": "Cross-platform",
        "tags": [
            "LLM",
            "Logging",
            "Latency",
            "Cost Analysis",
            "Audit"
        ],
        "source": "https://github.com/langfuse/llmonitor"
    },
    {
        "id": "mito",
        "name": "Mito",
        "description": "Mito is a spreadsheet extension for Jupyter notebooks that automatically generates Python code as you explore and clean data. It’s a powerful tool for analysts who prefer a spreadsheet interface but want the transparency and reproducibility of code.",
        "category": "Analytics",
        "license": "Commercial",
        "cost": "Free with paid tiers",
        "size": "25 MB",
        "version": "1.0.3",
        "stars": 3400,
        "last_updated": "04/08/2024",
        "os": "Cross-platform",
        "tags": [
            "Spreadsheets",
            "Jupyter",
            "Data Cleaning",
            "Low-Code",
            "Automation"
        ],
        "source": "https://www.trymito.io"
    },
    {
        "id": "label-studio-ml",
        "name": "Label Studio ML Backend",
        "description": "Label Studio ML Backend is an analytics extension for the popular data labeling platform. It allows users to serve models during annotation, track predictions vs. human labels, and analyze model agreement and accuracy across iterations.",
        "category": "Analytics",
        "license": "Apache-2.0",
        "cost": "Free",
        "size": "45 MB",
        "version": "1.6.2",
        "stars": 2700,
        "last_updated": "03/20/2024",
        "os": "Cross-platform",
        "tags": [
            "Labeling",
            "Model Evaluation",
            "Feedback",
            "Annotations",
            "Accuracy"
        ],
        "source": "https://github.com/HumanSignal/label-studio-ml-backend"
    },
    {
        "id": "grafana-oncall",
        "name": "Grafana OnCall Analytics",
        "description": "Grafana OnCall includes dashboards and analytics for incident response metrics, alert trends, and escalation frequency. It’s designed for SRE and DevOps teams looking to improve on-call effectiveness with time-series insights.",
        "category": "Analytics",
        "license": "AGPL-3.0",
        "cost": "Free",
        "size": "55 MB",
        "version": "1.4.0",
        "stars": 1800,
        "last_updated": "04/09/2024",
        "os": "Cross-platform",
        "tags": [
            "Incident Response",
            "DevOps",
            "Dashboards",
            "SRE",
            "Alerts"
        ],
        "source": "https://grafana.com/oss/oncall"
    },
    {
        "id": "appsmith-analytics",
        "name": "Appsmith Analytics Module",
        "description": "Appsmith’s Analytics Module allows developers to embed performance, user activity, and usage tracking into internal tools built with Appsmith. With support for SQL, REST, and JS data sources, it enables flexible, dashboard-based analytics integration.",
        "category": "Analytics",
        "license": "Apache-2.0",
        "cost": "Free",
        "size": "60 MB",
        "version": "1.11.0",
        "stars": 28000,
        "last_updated": "03/30/2024",
        "os": "Cross-platform",
        "tags": [
            "Appsmith",
            "Internal Tools",
            "Dashboards",
            "Usage",
            "Monitoring"
        ],
        "source": "https://github.com/appsmithorg/appsmith"
    },
    {
        "id": "great-expectations-cloud",
        "name": "Great Expectations Cloud",
        "description": "Great Expectations Cloud extends the open-source data validation library with analytics dashboards, run history, and project collaboration. It helps data teams ensure quality and track data testing over time across pipelines and environments.",
        "category": "Analytics",
        "license": "Commercial",
        "cost": "Free trial with enterprise plans",
        "size": "Cloud-based",
        "version": "1.0.14",
        "stars": 9500,
        "last_updated": "04/03/2024",
        "os": "Cross-platform",
        "tags": [
            "Data Validation",
            "Expectations",
            "Testing",
            "Pipelines",
            "History"
        ],
        "source": "https://greatexpectations.io"
    },
    {
        "id": "chronon",
        "name": "Chronon",
        "description": "Chronon is a temporal analytics and feature engineering platform. It enables analysts to create time-aware datasets with snapshot consistency and point-in-time joins — often used for building training sets in fraud detection and churn prediction models.",
        "category": "Analytics",
        "license": "Commercial",
        "cost": "Custom pricing",
        "size": "Cloud-based",
        "version": "2024",
        "stars": 1100,
        "last_updated": "04/10/2024",
        "os": "Cross-platform",
        "tags": [
            "Temporal",
            "Feature Engineering",
            "Point-in-Time",
            "Fraud",
            "Churn"
        ],
        "source": "https://chronon.ai"
    },
    {
        "id": "marquez",
        "name": "Marquez",
        "description": "Marquez is an open-source metadata service for data lineage and job tracking. It enables analytics teams to understand how data flows through pipelines, track schema changes, and build audit trails for reproducibility and governance.",
        "category": "Analytics",
        "license": "Apache-2.0",
        "cost": "Free",
        "size": "150 MB",
        "version": "0.36.2",
        "stars": 2300,
        "last_updated": "03/28/2024",
        "os": "Cross-platform",
        "tags": [
            "Lineage",
            "Metadata",
            "Governance",
            "Tracking",
            "Data Flows"
        ],
        "source": "https://github.com/MarquezProject/marquez"
    },
    {
        "id": "trackhub",
        "name": "Trackhub",
        "description": "Trackhub is an embeddable analytics SDK for SaaS apps that provides user behavior tracking, funnel analysis, and retention insights. Built for developers, it supports segmentation, event tagging, and works across web and mobile clients.",
        "category": "Analytics",
        "license": "Commercial",
        "cost": "Free with paid tiers",
        "size": "2 MB",
        "version": "2.2.1",
        "stars": 500,
        "last_updated": "03/27/2024",
        "os": "Cross-platform",
        "tags": [
            "SaaS",
            "Tracking",
            "Funnel",
            "Retention",
            "SDK"
        ],
        "source": "https://trackhub.io"
    },
    {
        "id": "mlcube-analytics",
        "name": "MLCube Analytics",
        "description": "MLCube Analytics is a companion tool for benchmarking ML model performance across environments using the MLCube packaging standard. It provides visual analytics, leaderboard views, and reproducibility scoring for collaborative ML competitions.",
        "category": "Analytics",
        "license": "Apache-2.0",
        "cost": "Free",
        "size": "70 MB",
        "version": "0.3.4",
        "stars": 750,
        "last_updated": "03/15/2024",
        "os": "Cross-platform",
        "tags": [
            "MLCube",
            "Benchmarking",
            "Leaderboards",
            "Scoring",
            "Analytics"
        ],
        "source": "https://github.com/mlcommons/mlcube"
    },
    {
        "id": "clearbit-analytics",
        "name": "Clearbit Analytics",
        "description": "Clearbit Analytics enriches web and customer data to provide actionable insights on user behavior, firmographics, and lead scoring. It integrates with CRM and marketing tools, offering visual reports and segmentation for go-to-market teams.",
        "category": "Analytics",
        "license": "Commercial",
        "cost": "Paid",
        "size": "Cloud-based",
        "version": "2024",
        "stars": 1300,
        "last_updated": "04/08/2024",
        "os": "Cross-platform",
        "tags": [
            "B2B",
            "Segmentation",
            "Lead Scoring",
            "CRM",
            "Web Analytics"
        ],
        "source": "https://clearbit.com"
    },
    {
        "id": "quickwit",
        "name": "Quickwit",
        "description": "Quickwit is a search engine optimized for observability and analytics over log data. It indexes log files in object storage with blazing-fast search and supports SQL-based querying for operational metrics and debugging workflows.",
        "category": "Analytics",
        "license": "MIT",
        "cost": "Free",
        "size": "110 MB",
        "version": "0.9.0",
        "stars": 3300,
        "last_updated": "04/04/2024",
        "os": "Cross-platform",
        "tags": [
            "Log Analytics",
            "Observability",
            "Search Engine",
            "SQL",
            "Debugging"
        ],
        "source": "https://quickwit.io"
    },
    {
        "id": "openreplay",
        "name": "OpenReplay",
        "description": "OpenReplay is a session replay and analytics platform for web apps. It captures everything from user clicks to console logs and network activity, providing insights into user journeys and frontend issues.",
        "category": "Analytics",
        "license": "MIT",
        "cost": "Free with paid tiers",
        "size": "120 MB",
        "version": "3.6.0",
        "stars": 9500,
        "last_updated": "04/07/2024",
        "os": "Cross-platform",
        "tags": [
            "Session Replay",
            "User Analytics",
            "Frontend",
            "Debugging",
            "Monitoring"
        ],
        "source": "https://openreplay.com"
    },
    {
        "id": "flipside-crypto",
        "name": "Flipside Crypto",
        "description": "Flipside Crypto is a Web3 analytics platform that provides SQL-based querying and dashboards over blockchain data. It helps analysts explore DeFi, NFT, and on-chain activity with community-driven datasets and charts.",
        "category": "Analytics",
        "license": "Commercial",
        "cost": "Free with usage limits",
        "size": "Cloud-based",
        "version": "2024",
        "stars": 1500,
        "last_updated": "04/06/2024",
        "os": "Cross-platform",
        "tags": [
            "Web3",
            "Blockchain",
            "SQL",
            "NFT",
            "Dashboards"
        ],
        "source": "https://flipsidecrypto.xyz"
    },
    {
        "id": "plausible",
        "name": "Plausible",
        "description": "Plausible is a lightweight, privacy-friendly web analytics tool. It provides clean and simple dashboards, avoids cookies, and complies with GDPR — making it a popular alternative to Google Analytics for developers and indie creators.",
        "category": "Analytics",
        "license": "AGPL-3.0",
        "cost": "Free with cloud plan",
        "size": "10 MB",
        "version": "1.6.3",
        "stars": 16000,
        "last_updated": "04/09/2024",
        "os": "Cross-platform",
        "tags": [
            "Web Analytics",
            "Privacy",
            "Cookie-Free",
            "GDPR",
            "Self-Hosted"
        ],
        "source": "https://plausible.io"
    },
    {
        "id": "bentoml-analytics",
        "name": "BentoML Analytics",
        "description": "BentoML Analytics is a plugin for tracking model inference metrics, latency, and resource usage across ML deployments. It works with BentoML services and helps teams observe model performance in production environments.",
        "category": "Analytics",
        "license": "Apache-2.0",
        "cost": "Free",
        "size": "38 MB",
        "version": "1.1.0",
        "stars": 4600,
        "last_updated": "03/31/2024",
        "os": "Cross-platform",
        "tags": [
            "ML",
            "Monitoring",
            "Latency",
            "Inference",
            "Production"
        ],
        "source": "https://github.com/bentoml"
    },
    {
        "id": "pyod",
        "name": "PyOD",
        "description": "PyOD is a comprehensive Python toolkit for detecting outliers in multivariate data. It supports multiple detection algorithms and visual analytics, and is widely used for fraud detection, data cleaning, and anomaly analytics.",
        "category": "Analytics",
        "license": "MIT",
        "cost": "Free",
        "size": "18 MB",
        "version": "1.1.3",
        "stars": 5300,
        "last_updated": "04/01/2024",
        "os": "Cross-platform",
        "tags": [
            "Outlier Detection",
            "Anomaly Detection",
            "Python",
            "Multivariate",
            "Visualization"
        ],
        "source": "https://github.com/yzhao062/pyod"
    },
    {
        "id": "goku-api-analytics",
        "name": "Goku API Analytics",
        "description": "Goku is a powerful gateway with built-in API analytics, rate limiting, and traffic monitoring. It provides real-time dashboards for API consumers and system admins to track usage patterns and ensure SLAs.",
        "category": "Analytics",
        "license": "Apache-2.0",
        "cost": "Free",
        "size": "100 MB",
        "version": "1.2.1",
        "stars": 1700,
        "last_updated": "03/27/2024",
        "os": "Cross-platform",
        "tags": [
            "API",
            "Gateway",
            "Monitoring",
            "Traffic",
            "Rate Limiting"
        ],
        "source": "https://github.com/apioak/goku"
    },
    {
        "id": "queryflow",
        "name": "QueryFlow",
        "description": "QueryFlow is a query observability tool that captures, profiles, and analyzes SQL queries in real time. It integrates with Postgres and MySQL, enabling teams to find slow queries, analyze patterns, and optimize database usage with precision.",
        "category": "Analytics",
        "license": "MIT",
        "cost": "Free",
        "size": "35 MB",
        "version": "0.9.0",
        "stars": 850,
        "last_updated": "03/22/2024",
        "os": "Cross-platform",
        "tags": [
            "SQL",
            "Postgres",
            "Query Profiling",
            "Observability",
            "Optimization"
        ],
        "source": "https://github.com/bytebase/queryflow"
    },
    {
        "id": "powerbi-react",
        "name": "PowerBI React SDK",
        "description": "PowerBI React SDK allows developers to embed Microsoft Power BI dashboards and reports into React applications. It supports authentication, customization, and filtering to provide interactive analytics within modern web UIs.",
        "category": "Analytics",
        "license": "MIT",
        "cost": "Free",
        "size": "4.3 MB",
        "version": "3.0.2",
        "stars": 1400,
        "last_updated": "04/10/2024",
        "os": "Cross-platform",
        "tags": [
            "Power BI",
            "Embedding",
            "React",
            "Dashboards",
            "Microsoft"
        ],
        "source": "https://github.com/microsoft/powerbi-client-react"
    },
    {
        "id": "datacater",
        "name": "DataCater",
        "description": "DataCater is a real-time data ingestion and transformation platform focused on streaming analytics. It enables teams to define transformation logic visually or in Python, delivering clean data into downstream systems like Kafka, PostgreSQL, or Elasticsearch with low latency.",
        "category": "Analytics",
        "license": "Commercial",
        "cost": "Free tier available",
        "size": "Cloud-based",
        "version": "1.8.3",
        "stars": 850,
        "last_updated": "03/28/2024",
        "os": "Cross-platform",
        "tags": [
            "Streaming",
            "ETL",
            "Real-time",
            "Ingestion",
            "Transformation"
        ],
        "source": "https://datacater.io"
    },
    {
        "id": "graphsignal",
        "name": "Graphsignal",
        "description": "Graphsignal is an observability platform for AI applications, offering telemetry and performance analytics for Python, LLMs, and ML APIs. It tracks latency, cost, inputs/outputs, and error rates, providing actionable visibility into production AI systems.",
        "category": "Analytics",
        "license": "Commercial",
        "cost": "Free with paid plans",
        "size": "60 MB",
        "version": "0.6.4",
        "stars": 1200,
        "last_updated": "04/09/2024",
        "os": "Cross-platform",
        "tags": [
            "Observability",
            "LLM",
            "Latency",
            "Cost Tracking",
            "AI Monitoring"
        ],
        "source": "https://graphsignal.com"
    },
    {
        "id": "sqlmesh",
        "name": "SQLMesh",
        "description": "SQLMesh is a data transformation and analytics framework that enables CI/CD for SQL. It provides environment isolation, semantic diffs, and fast incremental model execution — helping analytics engineers manage versioned, testable data pipelines efficiently.",
        "category": "Analytics",
        "license": "Apache-2.0",
        "cost": "Free",
        "size": "45 MB",
        "version": "0.65.1",
        "stars": 2100,
        "last_updated": "04/05/2024",
        "os": "Cross-platform",
        "tags": [
            "SQL",
            "CI/CD",
            "Versioning",
            "Pipelines",
            "Testing"
        ],
        "source": "https://github.com/TobikoData/sqlmesh"
    },
    {
        "id": "mojo",
        "name": "Mojo",
        "description": "Mojo is a next-generation programming language optimized for AI and analytics workloads. It combines the usability of Python with the performance of C, enabling faster data pipelines, vector operations, and compiler-level analytics instrumentation.",
        "category": "Analytics",
        "license": "Commercial",
        "cost": "Free preview",
        "size": "Compiler-based",
        "version": "0.7.0",
        "stars": 17000,
        "last_updated": "04/02/2024",
        "os": "Cross-platform",
        "tags": [
            "Programming",
            "AI",
            "Compiler",
            "Performance",
            "Analytics"
        ],
        "source": "https://www.modular.com/mojo"
    },
    {
        "id": "eventnative",
        "name": "EventNative",
        "description": "EventNative is a real-time event collection and routing platform that supports analytics ingestion for data lakes and warehouses. It provides event transformation, deduplication, and schema enforcement — often used to power clickstream and behavioral analytics stacks.",
        "category": "Analytics",
        "license": "Apache-2.0",
        "cost": "Free",
        "size": "Docker-based",
        "version": "1.5.6",
        "stars": 1300,
        "last_updated": "04/06/2024",
        "os": "Cross-platform",
        "tags": [
            "Event Tracking",
            "Clickstream",
            "Schema",
            "Streaming",
            "Data Warehouse"
        ],
        "source": "https://github.com/eventnative/eventnative"
    },
    {
        "id": "retool-analytics",
        "name": "Retool Analytics SDK",
        "description": "Retool Analytics SDK is an internal analytics tool for tracking usage, API calls, and performance in apps built with Retool. It supports event tracking, custom metrics, and audit trails — ideal for teams needing insight into internal app effectiveness.",
        "category": "Analytics",
        "license": "Commercial",
        "cost": "Free with Retool",
        "size": "Web-based",
        "version": "3.12.0",
        "stars": 600,
        "last_updated": "04/01/2024",
        "os": "Cross-platform",
        "tags": [
            "Internal Tools",
            "Event Tracking",
            "Retool",
            "Audit",
            "Performance"
        ],
        "source": "https://retool.com"
    },
    {
        "id": "snowflake-notebooks",
        "name": "Snowflake Notebooks",
        "description": "Snowflake Notebooks is an interactive analytics IDE within the Snowflake Data Cloud that lets analysts mix SQL, Python, and markdown in a single interface. It enhances exploration, visualization, and collaboration directly on Snowflake-hosted data.",
        "category": "Analytics",
        "license": "Commercial",
        "cost": "Included with Snowflake",
        "size": "Cloud-based",
        "version": "2024",
        "stars": 1800,
        "last_updated": "04/10/2024",
        "os": "Cross-platform",
        "tags": [
            "SQL",
            "Python",
            "Notebooks",
            "Collaboration",
            "Cloud"
        ],
        "source": "https://www.snowflake.com/blog/introducing-snowflake-notebooks"
    },
    {
        "id": "insightdb",
        "name": "InsightDB",
        "description": "InsightDB is an analytics-optimized database that precomputes insights and trends over large datasets. It focuses on low-latency access to derived metrics and supports AI-enhanced summarization of KPIs for dashboard applications.",
        "category": "Analytics",
        "license": "Commercial",
        "cost": "Custom pricing",
        "size": "Cloud-based",
        "version": "1.4.0",
        "stars": 950,
        "last_updated": "04/03/2024",
        "os": "Cross-platform",
        "tags": [
            "Database",
            "Precomputed Metrics",
            "KPI",
            "Summarization",
            "Dashboards"
        ],
        "source": "https://insightdb.io"
    },
    {
        "id": "mindsdb",
        "name": "MindsDB",
        "description": "MindsDB is a predictive analytics layer for databases that enables users to run machine learning models via SQL. It supports integration with MySQL, Postgres, and MongoDB, allowing forecasting and classification directly within the database engine.",
        "category": "Analytics",
        "license": "GPL-3.0",
        "cost": "Free",
        "size": "120 MB",
        "version": "24.2.2",
        "stars": 13000,
        "last_updated": "03/30/2024",
        "os": "Cross-platform",
        "tags": [
            "ML",
            "Forecasting",
            "SQL",
            "Database",
            "Prediction"
        ],
        "source": "https://github.com/mindsdb/mindsdb"
    },
    {
        "id": "tinybird",
        "name": "Tinybird",
        "description": "Tinybird is a platform for building real-time APIs from analytical queries. It ingests and processes data streams using SQL and provides ultra-low-latency endpoints for dashboards, monitoring tools, or customer-facing analytics features.",
        "category": "Analytics",
        "license": "Commercial",
        "cost": "Free with paid options",
        "size": "Cloud-based",
        "version": "2024",
        "stars": 2900,
        "last_updated": "04/07/2024",
        "os": "Cross-platform",
        "tags": [
            "Real-time",
            "SQL",
            "APIs",
            "Streaming",
            "Dashboards"
        ],
        "source": "https://tinybird.co"
    },
    {
        "id": "cluvio",
        "name": "Cluvio",
        "description": "Cluvio is a cloud-based analytics platform that allows teams to write SQL queries and visualize the results through dashboards. It integrates with PostgreSQL, MySQL, Redshift, and other databases, and supports scheduling and embedded analytics.",
        "category": "Analytics",
        "license": "Commercial",
        "cost": "Free for basic use",
        "size": "Cloud-based",
        "version": "2024",
        "stars": 1300,
        "last_updated": "03/26/2024",
        "os": "Cross-platform",
        "tags": [
            "SQL",
            "Dashboards",
            "Embedded",
            "Cloud",
            "BI"
        ],
        "source": "https://www.cluvio.com"
    },
    {
        "id": "cortex-metrics",
        "name": "Cortex Metrics",
        "description": "Cortex is an open-source horizontally scalable Prometheus-compatible monitoring system. It aggregates time-series metrics and supports multi-tenancy, long-term storage, and analytics queries for infrastructure observability.",
        "category": "Analytics",
        "license": "Apache-2.0",
        "cost": "Free",
        "size": "100 MB",
        "version": "1.16.0",
        "stars": 6000,
        "last_updated": "04/04/2024",
        "os": "Cross-platform",
        "tags": [
            "Metrics",
            "Time Series",
            "Prometheus",
            "Observability",
            "Infrastructure"
        ],
        "source": "https://github.com/cortexproject/cortex"
    },
    {
        "id": "panther",
        "name": "Panther",
        "description": "Panther is an open-source security analytics platform that enables detection and monitoring using SQL-based rules over cloud logs. It includes dashboards, alerting pipelines, and compliance checks for teams focused on threat analytics.",
        "category": "Analytics",
        "license": "AGPL-3.0",
        "cost": "Free with enterprise tier",
        "size": "180 MB",
        "version": "1.95.0",
        "stars": 5600,
        "last_updated": "04/10/2024",
        "os": "Cross-platform",
        "tags": [
            "Security",
            "SQL",
            "Log Analytics",
            "Monitoring",
            "Compliance"
        ],
        "source": "https://github.com/panther-labs/panther"
    },
    {
        "id": "matano",
        "name": "Matano",
        "description": "Matano is an open-source serverless platform for real-time log analytics and detection. Built on Apache Iceberg and Rust, it allows scalable ingestion, querying, and alerting on security-related events and analytics pipelines.",
        "category": "Analytics",
        "license": "Apache-2.0",
        "cost": "Free",
        "size": "Serverless",
        "version": "0.10.2",
        "stars": 2300,
        "last_updated": "04/02/2024",
        "os": "Cross-platform",
        "tags": [
            "Serverless",
            "Rust",
            "Iceberg",
            "Log Analytics",
            "Detection"
        ],
        "source": "https://github.com/matanolabs/matano"
    },
    {
        "id": "fugue",
        "name": "Fugue",
        "description": "Fugue is a unified framework for distributed computing that enables users to write Python or SQL analytics pipelines that execute on Spark, Dask, or Ray. It abstracts away cluster specifics while supporting advanced transformation logic.",
        "category": "Analytics",
        "license": "Apache-2.0",
        "cost": "Free",
        "size": "35 MB",
        "version": "0.9.5",
        "stars": 2800,
        "last_updated": "03/31/2024",
        "os": "Cross-platform",
        "tags": [
            "Distributed Computing",
            "SQL",
            "Python",
            "Spark",
            "Dask"
        ],
        "source": "https://github.com/fugue-project/fugue"
    },
    {
        "id": "helix",
        "name": "Helix",
        "description": "Helix is a collaborative data exploration and analytics platform for teams. It provides live dashboards, collaborative SQL editing, data lineage tracking, and governance features — aimed at empowering teams to analyze and share insights quickly.",
        "category": "Analytics",
        "license": "Commercial",
        "cost": "Free trial available",
        "size": "Cloud-based",
        "version": "2024",
        "stars": 800,
        "last_updated": "04/01/2024",
        "os": "Cross-platform",
        "tags": [
            "Collaboration",
            "Lineage",
            "SQL",
            "Dashboards",
            "Governance"
        ],
        "source": "https://www.helix.dev"
    },
    {
        "id": "shinyapps",
        "name": "ShinyApps.io",
        "description": "ShinyApps.io is a platform for deploying and sharing interactive R analytics dashboards built with Shiny. It enables publishing of data-driven applications with user controls, real-time inputs, and reactive visualizations for statistical analytics.",
        "category": "Analytics",
        "license": "Commercial",
        "cost": "Free tier available",
        "size": "Cloud-based",
        "version": "2024",
        "stars": 4000,
        "last_updated": "04/08/2024",
        "os": "Cross-platform",
        "tags": [
            "R",
            "Dashboards",
            "Shiny",
            "Publishing",
            "Statistical Analytics"
        ],
        "source": "https://www.shinyapps.io"
    },
    {
        "id": "auto-sklearn",
        "name": "auto-sklearn",
        "description": "auto-sklearn is an open-source AutoML library built on top of scikit-learn. It automates model selection, hyperparameter tuning, and ensembling while offering detailed model performance analytics across classification and regression tasks.",
        "category": "Analytics",
        "license": "Apache-2.0",
        "cost": "Free",
        "size": "40 MB",
        "version": "0.15.0",
        "stars": 8100,
        "last_updated": "04/09/2024",
        "os": "Cross-platform",
        "tags": [
            "AutoML",
            "Scikit-learn",
            "Classification",
            "Tuning",
            "Performance"
        ],
        "source": "https://github.com/automl/auto-sklearn"
    },
    {
        "id": "gretel-synthetics",
        "name": "Gretel Synthetics",
        "description": "Gretel Synthetics is a Python library for generating synthetic data using machine learning models. It includes metrics and visual analytics tools to evaluate data privacy, utility, and model drift — often used for secure data sharing and testing.",
        "category": "Analytics",
        "license": "Apache-2.0",
        "cost": "Free",
        "size": "30 MB",
        "version": "0.23.1",
        "stars": 1900,
        "last_updated": "03/29/2024",
        "os": "Cross-platform",
        "tags": [
            "Synthetic Data",
            "Privacy",
            "ML",
            "Drift Detection",
            "Testing"
        ],
        "source": "https://github.com/gretelai/gretel-synthetics"
    },
    {
        "id": "datasentinel",
        "name": "DataSentinel",
        "description": "DataSentinel is a data governance and privacy analytics platform that monitors sensitive data access, classifies information assets, and ensures regulatory compliance. It helps enterprises track data exposure and usage patterns at scale.",
        "category": "Analytics",
        "license": "Commercial",
        "cost": "Custom pricing",
        "size": "Cloud-based",
        "version": "2024",
        "stars": 500,
        "last_updated": "04/10/2024",
        "os": "Cross-platform",
        "tags": [
            "Governance",
            "Privacy",
            "Compliance",
            "Classification",
            "Monitoring"
        ],
        "source": "https://www.datasentinel.io"
    },
    {
        "id": "mlte-dashboard",
        "name": "MLTE Dashboard",
        "description": "MLTE Dashboard is a visualization layer built on top of the ML Test Engine (MLTE). It provides intuitive dashboards to explore test coverage, data quality, and operational health of ML systems — making evaluation results more accessible for analytics teams.",
        "category": "Analytics",
        "license": "Apache-2.0",
        "cost": "Free",
        "size": "Web-based",
        "version": "0.2.0",
        "stars": 700,
        "last_updated": "04/09/2024",
        "os": "Cross-platform",
        "tags": [
            "ML",
            "Testing",
            "Dashboards",
            "Coverage",
            "Visualization"
        ],
        "source": "https://github.com/mlte-team/mlte"
    },
    {
        "id": "superset-data-quality",
        "name": "Superset Data Quality Plugin",
        "description": "This plugin adds data quality indicators and metrics validation into Apache Superset dashboards. It highlights null rates, schema changes, and threshold-based alerts, offering inline analytics feedback inside BI visualizations.",
        "category": "Analytics",
        "license": "Apache-2.0",
        "cost": "Free",
        "size": "5 MB",
        "version": "1.0.0",
        "stars": 400,
        "last_updated": "03/27/2024",
        "os": "Cross-platform",
        "tags": [
            "Superset",
            "Validation",
            "Thresholds",
            "Nulls",
            "Quality"
        ],
        "source": "https://github.com/apache/superset"
    },
    {
        "id": "ydata-profiling",
        "name": "YData Profiling",
        "description": "YData Profiling (formerly Pandas Profiling) is a robust Python EDA tool that generates full profiling reports from dataframes. It includes data distributions, missing value heatmaps, correlations, and warnings — streamlining early analytics workflows.",
        "category": "Analytics",
        "license": "MIT",
        "cost": "Free",
        "size": "15 MB",
        "version": "4.7.0",
        "stars": 12000,
        "last_updated": "04/10/2024",
        "os": "Cross-platform",
        "tags": [
            "EDA",
            "Profiling",
            "Python",
            "Correlations",
            "Reports"
        ],
        "source": "https://github.com/ydataai/ydata-profiling"
    },
    {
        "id": "datacurve",
        "name": "DataCurve",
        "description": "DataCurve is a platform for A/B testing and experimentation analytics. It offers statistical significance testing, cohort segmentation, and visual reports on experiment outcomes — helping teams drive product decisions through controlled trials.",
        "category": "Analytics",
        "license": "Commercial",
        "cost": "Custom pricing",
        "size": "Cloud-based",
        "version": "2024",
        "stars": 1100,
        "last_updated": "04/01/2024",
        "os": "Cross-platform",
        "tags": [
            "A/B Testing",
            "Experimentation",
            "Significance",
            "Cohorts",
            "Product Analytics"
        ],
        "source": "https://datacurve.io"
    },
    {
        "id": "taptool",
        "name": "TapTool",
        "description": "TapTool is a modern log and metrics analytics tool designed for observability across microservices. It supports structured query interfaces, live tailing, and customizable visualizations for logs, metrics, and traces in distributed systems.",
        "category": "Analytics",
        "license": "Commercial",
        "cost": "Free trial",
        "size": "Cloud or self-hosted",
        "version": "2024",
        "stars": 900,
        "last_updated": "04/05/2024",
        "os": "Cross-platform",
        "tags": [
            "Logs",
            "Observability",
            "Metrics",
            "Traces",
            "Microservices"
        ],
        "source": "https://taptool.io"
    },
    {
        "id": "dune",
        "name": "Dune",
        "description": "Dune is a blockchain analytics platform that allows analysts to write SQL queries over on-chain data. It enables dashboards, alerts, and token activity tracking — powering community-driven insights and DeFi project analytics.",
        "category": "Analytics",
        "license": "Commercial",
        "cost": "Free with community access",
        "size": "Cloud-based",
        "version": "2024",
        "stars": 4900,
        "last_updated": "04/08/2024",
        "os": "Cross-platform",
        "tags": [
            "Web3",
            "SQL",
            "Dashboards",
            "Tokens",
            "Blockchain"
        ],
        "source": "https://dune.com"
    },
    {
        "id": "tensorlake",
        "name": "Tensorlake",
        "description": "Tensorlake is a vector analytics engine that indexes embeddings and unstructured data for similarity search, clustering, and usage analytics. It supports applications involving image, video, and text analytics pipelines at scale.",
        "category": "Analytics",
        "license": "Commercial",
        "cost": "Custom pricing",
        "size": "Cloud-based",
        "version": "2024",
        "stars": 1500,
        "last_updated": "03/30/2024",
        "os": "Cross-platform",
        "tags": [
            "Vector DB",
            "Embeddings",
            "Similarity Search",
            "Media Analytics",
            "Clustering"
        ],
        "source": "https://tensorlake.ai"
    },
    {
        "id": "analytics-sveltekit",
        "name": "SvelteKit Analytics",
        "description": "SvelteKit Analytics is a lightweight plugin for integrating pageviews, event tracking, and user sessions into apps built with SvelteKit. It offers privacy-friendly analytics, self-hosting, and extensible APIs for modern frontend teams.",
        "category": "Analytics",
        "license": "MIT",
        "cost": "Free",
        "size": "2 MB",
        "version": "0.9.4",
        "stars": 650,
        "last_updated": "03/24/2024",
        "os": "Cross-platform",
        "tags": [
            "Svelte",
            "Frontend",
            "Pageviews",
            "Events",
            "Privacy"
        ],
        "source": "https://github.com/beyonk-adventures/sveltekit-analytics"
    },
    {
        "id": "fastsql",
        "name": "FastSQL",
        "description": "FastSQL is a low-latency SQL engine designed for querying columnar datasets in real time. It supports pushdown filters, vectorized execution, and memory-efficient analytics for applications such as dashboard backends and analytics APIs.",
        "category": "Analytics",
        "license": "Apache-2.0",
        "cost": "Free",
        "size": "80 MB",
        "version": "0.8.1",
        "stars": 950,
        "last_updated": "04/06/2024",
        "os": "Cross-platform",
        "tags": [
            "SQL",
            "Columnar",
            "Real-time",
            "Dashboards",
            "API"
        ],
        "source": "https://github.com/fastsql/fastsql"
    },
    {
        "id": "octoinsight",
        "name": "OctoInsight",
        "description": "OctoInsight is a visual analytics engine designed for cybersecurity teams. It maps behavior patterns, anomalies, and threat vectors using interactive graph views and timelines — ideal for breach investigation and incident analysis.",
        "category": "Analytics",
        "license": "Commercial",
        "cost": "Custom pricing",
        "size": "Cloud-based",
        "version": "2024",
        "stars": 800,
        "last_updated": "04/03/2024",
        "os": "Cross-platform",
        "tags": [
            "Cybersecurity",
            "Threat Analytics",
            "Graphs",
            "Anomalies",
            "Investigation"
        ],
        "source": "https://octoinsight.com"
    },
    {
        "id": "streamdal",
        "name": "Streamdal",
        "description": "Streamdal is a real-time observability layer for streaming data pipelines. It captures metadata, schema changes, throughput, and anomaly events for streams across Kafka, Pulsar, and NATS — helping data teams maintain integrity and visibility at scale.",
        "category": "Analytics",
        "license": "Apache-2.0",
        "cost": "Free",
        "size": "85 MB",
        "version": "0.9.2",
        "stars": 1400,
        "last_updated": "04/04/2024",
        "os": "Cross-platform",
        "tags": [
            "Streaming",
            "Pipelines",
            "Observability",
            "Schemas",
            "Anomalies"
        ],
        "source": "https://github.com/streamdal/streamdal"
    },
    {
        "id": "rye-insights",
        "name": "Rye Insights",
        "description": "Rye Insights is a product analytics tool tailored for small teams. It offers clean, GDPR-compliant dashboards for user behavior, funnel analysis, and retention without cookies or user fingerprinting — designed for ethical, fast-deployable insights.",
        "category": "Analytics",
        "license": "Commercial",
        "cost": "Free with premium options",
        "size": "Web-based",
        "version": "2024",
        "stars": 700,
        "last_updated": "03/28/2024",
        "os": "Cross-platform",
        "tags": [
            "Privacy",
            "Product Analytics",
            "GDPR",
            "Funnel",
            "Retention"
        ],
        "source": "https://rye.so"
    },
    {
        "id": "hopara",
        "name": "Hopara",
        "description": "Hopara is a Python-based visual data analytics library for creating spatial dashboards and workflows. It supports multi-panel exploration of maps, plots, and tabular data, with real-time interactivity and low-code deployment.",
        "category": "Analytics",
        "license": "Apache-2.0",
        "cost": "Free",
        "size": "16 MB",
        "version": "0.5.1",
        "stars": 500,
        "last_updated": "03/25/2024",
        "os": "Cross-platform",
        "tags": [
            "Spatial",
            "Dashboards",
            "Python",
            "Maps",
            "Exploration"
        ],
        "source": "https://github.com/hopara/hopara"
    },
    {
        "id": "insightdb-ui",
        "name": "InsightDB UI",
        "description": "InsightDB UI is the frontend dashboarding interface for InsightDB, a metrics-first database. It allows visual exploration of KPIs, trends, and data summaries derived from precomputed queries, tailored for operations and executive analytics.",
        "category": "Analytics",
        "license": "Commercial",
        "cost": "Included with InsightDB",
        "size": "Web-based",
        "version": "2024",
        "stars": 900,
        "last_updated": "04/10/2024",
        "os": "Cross-platform",
        "tags": [
            "Dashboards",
            "KPIs",
            "Summarization",
            "Trends",
            "Exploration"
        ],
        "source": "https://insightdb.io"
    },
    {
        "id": "candlestick",
        "name": "Candlestick",
        "description": "Candlestick is an open-source charting library optimized for financial analytics. It supports OHLC charts, trade overlays, volume comparisons, and intraday plotting — ideal for backtesting tools, stock dashboards, or cryptocurrency analysis.",
        "category": "Analytics",
        "license": "MIT",
        "cost": "Free",
        "size": "3.2 MB",
        "version": "1.2.4",
        "stars": 2300,
        "last_updated": "03/21/2024",
        "os": "Cross-platform",
        "tags": [
            "Finance",
            "Stocks",
            "Charts",
            "OHLC",
            "Crypto"
        ],
        "source": "https://github.com/candlestick-charting/candlestick"
    },
    {
        "id": "swirl",
        "name": "Swirl",
        "description": "Swirl is an AI-powered search and analytics platform for enterprise data. It unifies search across files, databases, and APIs and adds semantic understanding — enabling enterprise teams to find, analyze, and summarize internal knowledge efficiently.",
        "category": "Analytics",
        "license": "Apache-2.0",
        "cost": "Free with enterprise add-ons",
        "size": "120 MB",
        "version": "1.6.0",
        "stars": 1000,
        "last_updated": "04/03/2024",
        "os": "Cross-platform",
        "tags": [
            "Enterprise",
            "Search",
            "AI",
            "Summarization",
            "Knowledge"
        ],
        "source": "https://github.com/swirlai/swirl-search"
    },
    {
        "id": "cubos",
        "name": "Cubos",
        "description": "Cubos is a framework for embedded analytics in SaaS applications. It enables developers to define reusable metrics, build multi-tenant dashboards, and configure data access permissions, all while integrating with existing SQL engines.",
        "category": "Analytics",
        "license": "Commercial",
        "cost": "Custom pricing",
        "size": "Cloud or on-prem",
        "version": "2024",
        "stars": 750,
        "last_updated": "04/02/2024",
        "os": "Cross-platform",
        "tags": [
            "SaaS",
            "Embedded",
            "Metrics Layer",
            "SQL",
            "Multi-tenant"
        ],
        "source": "https://cubos.io"
    },
    {
        "id": "vql",
        "name": "VQL (Velociraptor Query Language)",
        "description": "VQL is a query language designed for cybersecurity analytics in Velociraptor. It supports structured hunting, forensic exploration, and endpoint telemetry analysis with low overhead, making it suitable for threat intelligence dashboards.",
        "category": "Analytics",
        "license": "Apache-2.0",
        "cost": "Free",
        "size": "25 MB",
        "version": "0.7.1",
        "stars": 1600,
        "last_updated": "03/29/2024",
        "os": "Cross-platform",
        "tags": [
            "Cybersecurity",
            "Telemetry",
            "Forensics",
            "Threat Detection",
            "Query Language"
        ],
        "source": "https://github.com/Velocidex/velociraptor"
    },
    {
        "id": "factbranch",
        "name": "FactBranch",
        "description": "FactBranch is a lightweight analytics and lookup tool that shows data insights in CRM and support platforms like Intercom or Zendesk. It fetches user data from APIs and databases, presenting it in-line for agents and sales teams to act quickly.",
        "category": "Analytics",
        "license": "Commercial",
        "cost": "Subscription",
        "size": "Cloud-based",
        "version": "2024",
        "stars": 450,
        "last_updated": "04/06/2024",
        "os": "Cross-platform",
        "tags": [
            "CRM",
            "Support",
            "Data Lookup",
            "API Integrations",
            "Inline Analytics"
        ],
        "source": "https://factbranch.com"
    },
    {
        "id": "deepchecks",
        "name": "Deepchecks",
        "description": "Deepchecks is a testing and analytics suite for machine learning validation. It offers suites for data integrity, model behavior, performance drift, and fairness — turning quality checks into structured reports for production readiness.",
        "category": "Analytics",
        "license": "Apache-2.0",
        "cost": "Free",
        "size": "55 MB",
        "version": "0.15.0",
        "stars": 3700,
        "last_updated": "04/09/2024",
        "os": "Cross-platform",
        "tags": [
            "Testing",
            "Validation",
            "Fairness",
            "Drift",
            "ML"
        ],
        "source": "https://github.com/deepchecks/deepchecks"
    },
    {
        "id": "datahub-ui",
        "name": "DataHub UI",
        "description": "DataHub UI is the frontend for the DataHub metadata platform, enabling rich visual exploration of datasets, pipelines, schemas, and usage metrics. It supports data lineage, ownership, search, and analytics around data discovery and governance.",
        "category": "Analytics",
        "license": "Apache-2.0",
        "cost": "Free",
        "size": "75 MB",
        "version": "0.13.1",
        "stars": 8300,
        "last_updated": "04/04/2024",
        "os": "Cross-platform",
        "tags": [
            "Metadata",
            "Governance",
            "Lineage",
            "Discovery",
            "UI"
        ],
        "source": "https://github.com/datahub-project/datahub"
    },
    {
        "id": "frictionless",
        "name": "Frictionless",
        "description": "Frictionless is a data quality and validation toolkit for tabular data. It enables dataset profiling, schema generation, and pipeline validation with integrations for Python, JavaScript, and command-line workflows — perfect for data onboarding analytics.",
        "category": "Analytics",
        "license": "MIT",
        "cost": "Free",
        "size": "12 MB",
        "version": "5.13.0",
        "stars": 2600,
        "last_updated": "04/07/2024",
        "os": "Cross-platform",
        "tags": [
            "Validation",
            "Schema",
            "Tabular Data",
            "Python",
            "Profiling"
        ],
        "source": "https://github.com/frictionlessdata/frictionless-py"
    },
    {
        "id": "analyticflow",
        "name": "AnalyticFlow",
        "description": "AnalyticFlow is a low-code analytics platform for exploring, transforming, and modeling data through flowcharts. It helps analysts visually connect data blocks and logic without code, supporting prototyping and reporting pipelines.",
        "category": "Analytics",
        "license": "Commercial",
        "cost": "Free trial with paid versions",
        "size": "Cloud-based",
        "version": "2024",
        "stars": 900,
        "last_updated": "04/08/2024",
        "os": "Cross-platform",
        "tags": [
            "Low-Code",
            "Flowchart",
            "Data Modeling",
            "Exploration",
            "Pipelines"
        ],
        "source": "https://analyticflow.com"
    },
    {
        "id": "datapane",
        "name": "Datapane",
        "description": "Datapane is an open-source reporting framework for Python. It turns Jupyter notebooks or scripts into interactive HTML reports with plots, tables, and markdown — ideal for sharing analytics with stakeholders without exposing raw code.",
        "category": "Analytics",
        "license": "MIT",
        "cost": "Free",
        "size": "22 MB",
        "version": "0.15.1",
        "stars": 3200,
        "last_updated": "03/27/2024",
        "os": "Cross-platform",
        "tags": [
            "Reporting",
            "Python",
            "Dashboards",
            "HTML",
            "Visualization"
        ],
        "source": "https://github.com/datapane/datapane"
    },
    {
        "id": "ducktm",
        "name": "DuckTM",
        "description": "DuckTM is a lightweight analytics engine focused on embedded telemetry in Python applications. It tracks execution time, memory usage, call frequency, and logs aggregated metrics — ideal for profiling analytics-heavy functions and routines.",
        "category": "Analytics",
        "license": "MIT",
        "cost": "Free",
        "size": "3 MB",
        "version": "0.3.0",
        "stars": 500,
        "last_updated": "03/29/2024",
        "os": "Cross-platform",
        "tags": [
            "Telemetry",
            "Profiling",
            "Python",
            "Functions",
            "Lightweight"
        ],
        "source": "https://github.com/ducktm/ducktm"
    },
    {
        "id": "metricsql",
        "name": "MetricSQL",
        "description": "MetricSQL is a query language designed for high-performance metrics analytics. Built on top of VictoriaMetrics, it allows users to aggregate, compare, and visualize metric time series with low-latency — especially useful for infrastructure analytics.",
        "category": "Analytics",
        "license": "Apache-2.0",
        "cost": "Free",
        "size": "90 MB",
        "version": "1.92.0",
        "stars": 4100,
        "last_updated": "04/02/2024",
        "os": "Cross-platform",
        "tags": [
            "Time Series",
            "Metrics",
            "Prometheus",
            "Query Language",
            "Monitoring"
        ],
        "source": "https://docs.victoriametrics.com/MetricsQL.html"
    },
    {
        "id": "krawler",
        "name": "Krawler",
        "description": "Krawler is a data crawling and analytics toolkit that automates data collection from web pages, APIs, and files. It supports scheduling, deduplication, and transformation — making it a powerful backend for analytics ETL workflows.",
        "category": "Analytics",
        "license": "MIT",
        "cost": "Free",
        "size": "48 MB",
        "version": "0.6.2",
        "stars": 1400,
        "last_updated": "04/09/2024",
        "os": "Cross-platform",
        "tags": [
            "Web Scraping",
            "ETL",
            "Automation",
            "Data Collection",
            "APIs"
        ],
        "source": "https://github.com/krawlerio/krawler"
    },
    {
        "id": "reportr",
        "name": "Reportr",
        "description": "Reportr is an open-source dashboard framework for real-time personal analytics. It supports tracking and visualizing user behavior, location, app usage, and external service data via integrations, ideal for quantified-self applications.",
        "category": "Analytics",
        "license": "MIT",
        "cost": "Free",
        "size": "30 MB",
        "version": "1.1.0",
        "stars": 1800,
        "last_updated": "03/31/2024",
        "os": "Cross-platform",
        "tags": [
            "Dashboards",
            "Personal Analytics",
            "Tracking",
            "Self-hosted",
            "APIs"
        ],
        "source": "https://github.com/jeanrept/reportr"
    },
    {
        "id": "mlflow-export-import",
        "name": "MLflow Export Import",
        "description": "MLflow Export Import is a utility library for exporting MLflow experiments, runs, and models between tracking servers. It includes migration analytics, dependency tracking, and model lineage — useful for multi-environment ML analytics.",
        "category": "Analytics",
        "license": "Apache-2.0",
        "cost": "Free",
        "size": "12 MB",
        "version": "1.31.0",
        "stars": 700,
        "last_updated": "04/10/2024",
        "os": "Cross-platform",
        "tags": [
            "MLflow",
            "Model Management",
            "Lineage",
            "Migration",
            "Tracking"
        ],
        "source": "https://github.com/mlflow/mlflow-export-import"
    },
    {
        "id": "trino",
        "name": "Trino",
        "description": "Trino is a high-performance distributed SQL query engine for analytics over large datasets. Formerly known as PrestoSQL, it enables federated querying across Hive, Iceberg, Kafka, MySQL, and others — powering interactive dashboards and data lakes.",
        "category": "Analytics",
        "license": "Apache-2.0",
        "cost": "Free",
        "size": "300 MB",
        "version": "437",
        "stars": 8300,
        "last_updated": "04/08/2024",
        "os": "Cross-platform",
        "tags": [
            "SQL",
            "Big Data",
            "Federated",
            "Data Lake",
            "Presto"
        ],
        "source": "https://trino.io"
    }
]
