[
    {
        "id": "react",
        "name": "React",
        "description": "React is a popular open-source JavaScript library for building dynamic user interfaces. Maintained by Meta (Facebook) and a broad community, it introduced a component-based architecture and a virtual DOM for efficient rendering. It’s widely used for developing single-page applications and can also render on the server or power mobile apps via React Native.",
        "category": "Frontend",
        "license": "MIT",
        "cost": "Free",
        "size": "0.17 MB",
        "version": "19.1.0",
        "stars": 235000,
        "last_updated": "March 2025",
        "os": "Cross-platform",
        "tags": [
            "JavaScript",
            "UI",
            "Library",
            "Web"
        ],
        "source": "https://react.dev"
    },
    {
        "id": "pavanvishnu",
        "name": "pavanvishnuLIbt",
        "description": "React is a popular open-source JavaScript library for building dynamic user interfaces. Maintained by Meta (Facebook) and a broad community, it introduced a component-based architecture and a virtual DOM for efficient rendering. It’s widely used for developing single-page applications and can also render on the server or power mobile apps via React Native.",
        "category": "Frontend",
        "license": "MIT",
        "cost": "Free",
        "size": "0.17 MB",
        "version": "19.1.0",
        "stars": 235000,
        "last_updated": "March 2025",
        "os": "Cross-platform",
        "tags": [
            "JavaScript",
            "UI",
            "Library",
            "Web"
        ],
        "source": "https://react.dev"
    },
    {
        "id": "angular",
        "name": "Angular",
        "description": "Angular is a comprehensive front-end web framework developed by Google for building client-side applications. It is a TypeScript-based framework that provides a structured MVC/MVVM architecture, powerful templating, two-way data binding, and dependency injection out of the box. Angular is well-suited for large enterprise applications and is kept up-to-date with regular releases (Angular 16+), ensuring long-term support and performance improvements.",
        "category": "Frontend",
        "license": "MIT",
        "cost": "Free",
        "size": "5 MB",
        "version": "16.1.0",
        "stars": 97000,
        "last_updated": "May 2023",
        "os": "Cross-platform",
        "tags": [
            "JavaScript",
            "Framework",
            "SPA",
            "TypeScript"
        ],
        "source": "https://angular.io"
    },
    {
        "id": "vuejs",
        "name": "Vue.js",
        "description": "Vue.js is an open-source progressive JavaScript framework for building user interfaces and single-page applications. Created by Evan You, Vue is lightweight and adopts a reactive data-binding approach and component-based architecture, making it approachable yet versatile. It can be incrementally adopted: from enhancing simple pages to powering sophisticated SPA front-ends, and it boasts an active community and ecosystem of supporting libraries.",
        "category": "Frontend",
        "license": "MIT",
        "cost": "Free",
        "size": "2.8 MB",
        "version": "3.3.4",
        "stars": 203000,
        "last_updated": "May 2023",
        "os": "Cross-platform",
        "tags": [
            "JavaScript",
            "Framework",
            "Reactive",
            "Web"
        ],
        "source": "https://vuejs.org"
    },
    {
        "id": "svelte",
        "name": "Svelte",
        "description": "Svelte is an open-source front-end JavaScript framework (or compiler) that builds user interfaces in a fundamentally new way. Instead of running in the browser as a library, Svelte compiles your components at build time, resulting in minimal and highly efficient JavaScript. This approach eliminates the need for a virtual DOM and leads to fast performance and smaller bundle sizes. Svelte is praised for its simplicity and reactivity using plain JavaScript and has been used to create lightweight, reactive web applications.",
        "category": "Frontend",
        "license": "MIT",
        "cost": "Free",
        "size": "1.6 MB",
        "version": "4.0.0",
        "stars": 67000,
        "last_updated": "July 2023",
        "os": "Cross-platform",
        "tags": [
            "JavaScript",
            "Compiler",
            "Reactive",
            "Web"
        ],
        "source": "https://svelte.dev"
    },
    {
        "id": "emberjs",
        "name": "Ember.js",
        "description": "Ember.js is an open-source JavaScript framework for building ambitious web applications. It follows the convention-over-configuration philosophy, providing a complete solution with its own router, services, and build tools, which helps developers be productive out-of-the-box. Ember uses a component-based UI approach (with Handlebars templates) and is known for its robust ecosystem and backwards compatibility. It is often used for complex, feature-rich single-page applications in enterprise environments.",
        "category": "Frontend",
        "license": "MIT",
        "cost": "Free",
        "size": "1.2 MB",
        "version": "4.12.0",
        "stars": 22000,
        "last_updated": "2023",
        "os": "Cross-platform",
        "tags": [
            "JavaScript",
            "Framework",
            "MVC",
            "Web"
        ],
        "source": "https://emberjs.com"
    },
    {
        "id": "jquery",
        "name": "jQuery",
        "description": "jQuery is a fast, small, and feature-rich JavaScript library that simplifies HTML document traversal, event handling, animation, and AJAX interactions. It became one of the most popular libraries for web development due to its ease of use and cross-browser compatibility abstractions. Although modern frameworks have reduced its prevalence, jQuery is still widely used in legacy systems and simple scripts, thanks to its concise API that dramatically simplifies DOM manipulation.",
        "category": "Frontend",
        "license": "MIT",
        "cost": "Free",
        "size": "0.30 MB",
        "version": "3.6.4",
        "stars": 59500,
        "last_updated": "August 2022",
        "os": "Cross-platform",
        "tags": [
            "JavaScript",
            "DOM",
            "AJAX",
            "Legacy"
        ],
        "source": "https://jquery.com"
    },
    {
        "id": "backbonejs",
        "name": "Backbone.js",
        "description": "Backbone.js is a lightweight JavaScript library that gives structure to web applications by providing models with key-value binding and custom events, collections with a rich API of enumerable functions, and views with declarative event handling. It was one of the earliest MVC (Model-View-Controller) libraries for the web, helping developers organize code for single-page applications. Backbone relies on Underscore.js and jQuery, and while less common today, it paved the way for more structured client-side development.",
        "category": "Frontend",
        "license": "MIT",
        "cost": "Free",
        "size": "0.08 MB",
        "version": "1.4.0",
        "stars": 28000,
        "last_updated": "July 2019",
        "os": "Cross-platform",
        "tags": [
            "JavaScript",
            "MVC",
            "SPA",
            "Lightweight"
        ],
        "source": "https://backbonejs.org"
    },
    {
        "id": "nextjs",
        "name": "Next.js",
        "description": "Next.js is a popular open-source React framework for building server-side rendered (SSR) and static web applications. Developed by Vercel, Next.js provides features like automatic code splitting, page-based routing, server-side rendering, and static site generation out of the box. It greatly simplifies building SEO-friendly and performant React applications by handling the underlying tooling (Webpack, Babel) and offering a robust developer experience with fast refresh and built-in API routes.",
        "category": "Frontend",
        "license": "MIT",
        "cost": "Free",
        "size": "2.5 MB",
        "version": "13.2.4",
        "stars": 105000,
        "last_updated": "2024",
        "os": "Cross-platform",
        "tags": [
            "React",
            "SSR",
            "Static",
            "Framework"
        ],
        "source": "https://nextjs.org"
    },
    {
        "id": "nuxtjs",
        "name": "Nuxt.js",
        "description": "Nuxt.js is a high-level framework built on Vue.js that enables server-side rendering, static site generation, and other powerful features for Vue applications. Often called the “Vue equivalent of Next.js,” Nuxt provides a structured approach with file-based routing, middleware support, and automatic code splitting. It simplifies building performant, SEO-friendly Vue apps by handling configuration and offering conventions, and it can also export projects as static websites for deployment to CDN.",
        "category": "Frontend",
        "license": "MIT",
        "cost": "Free",
        "size": "2.1 MB",
        "version": "3.0.0",
        "stars": 47000,
        "last_updated": "2023",
        "os": "Cross-platform",
        "tags": [
            "Vue",
            "SSR",
            "Static",
            "Framework"
        ],
        "source": "https://nuxtjs.org"
    },
    {
        "id": "gatsby",
        "name": "Gatsby",
        "description": "Gatsby is an open-source front-end framework based on React, designed for building fast static websites and applications. It uses GraphQL under the hood to pull data from various sources, and pre-renders pages at build time for optimal performance (a Jamstack approach). Gatsby has an extensive plugin ecosystem for adding functionality like CMS integration, image optimization, and offline support. The result is a highly optimized site that can be deployed anywhere as static files while still enabling dynamic features via client-side React.",
        "category": "Frontend",
        "license": "MIT",
        "cost": "Free",
        "size": "4 MB",
        "version": "4.24.0",
        "stars": 54000,
        "last_updated": "2022",
        "os": "Cross-platform",
        "tags": [
            "React",
            "Static Site",
            "GraphQL",
            "Jamstack"
        ],
        "source": "https://www.gatsbyjs.com"
    },
    {
        "id": "bootstrap",
        "name": "Bootstrap",
        "description": "Bootstrap is the world’s most popular HTML, CSS, and JavaScript framework for building responsive, mobile-first websites. Originally developed by Twitter, Bootstrap provides a comprehensive collection of pre-styled components like grids, buttons, forms, navigation, and more, which developers can easily drop into their projects. It ensures consistency across browsers and devices, and includes a responsive grid system and extensive theming capabilities. Bootstrap greatly accelerates front-end development by offering out-of-the-box solutions for common UI needs.",
        "category": "Frontend",
        "license": "MIT",
        "cost": "Free",
        "size": "0.19 MB",
        "version": "5.3.2",
        "stars": 172000,
        "last_updated": "April 2025",
        "os": "Cross-platform",
        "tags": [
            "CSS",
            "Framework",
            "Responsive",
            "UI"
        ],
        "source": "https://getbootstrap.com"
    },
    {
        "id": "tailwindcss",
        "name": "Tailwind CSS",
        "description": "Tailwind CSS is a modern utility-first CSS framework that provides low-level utility classes for customizing every aspect of a design. Rather than offering pre-designed components, Tailwind gives developers granular control by composing classes directly in HTML, which leads to highly customizable designs without leaving the markup. It includes a configurable design system (colors, spacing, typography, etc.) and optimizes output by purging unused styles. Tailwind has gained popularity for its flexibility and ability to rapidly build custom designs without writing traditional CSS.",
        "category": "Frontend",
        "license": "MIT",
        "cost": "Free",
        "size": "1.2 MB",
        "version": "3.3.0",
        "stars": 66000,
        "last_updated": "March 2024",
        "os": "Cross-platform",
        "tags": [
            "CSS",
            "Utility-first",
            "Responsive",
            "Design"
        ],
        "source": "https://tailwindcss.com"
    },
    {
        "id": "material-ui",
        "name": "Material-UI (MUI)",
        "description": "Material-UI is a popular React component library implementing Google’s Material Design guidelines. It provides a rich set of reusable UI components such as buttons, menus, sliders, and dialog windows that are styled consistently according to Material Design out-of-the-box. Developers can leverage MUI’s theming system to customize the appearance or adhere to brand guidelines. By using Material-UI, teams rapidly build aesthetically pleasing and accessible React applications with minimal CSS, thanks to pre-built components and styling solutions.",
        "category": "Frontend",
        "license": "MIT",
        "cost": "Free",
        "size": "4.5 MB",
        "version": "5.11.0",
        "stars": 88000,
        "last_updated": "2024",
        "os": "Cross-platform",
        "tags": [
            "React",
            "UI Components",
            "Material Design"
        ],
        "source": "https://mui.com"
    },
    {
        "id": "ant-design",
        "name": "Ant Design",
        "description": "Ant Design is a comprehensive UI library and design system for building enterprise-level web applications, originally created by Alibaba. It offers a wide range of high-quality React components (and implementations in Angular/Vue) such as tables, forms, charts, and navigation elements, all styled with a clean, consistent look. Ant Design follows a set of well-thought-out design principles and provides a theme customization system. It is favored for developing data-intensive and business applications where out-of-the-box, polished components can greatly accelerate development.",
        "category": "Frontend",
        "license": "MIT",
        "cost": "Free",
        "size": "5.2 MB",
        "version": "5.5.0",
        "stars": 84000,
        "last_updated": "2024",
        "os": "Cross-platform",
        "tags": [
            "React",
            "UI Kit",
            "Enterprise",
            "Design System"
        ],
        "source": "https://ant.design"
    },
    {
        "id": "bulma",
        "name": "Bulma",
        "description": "Bulma is a modern, open-source CSS framework based on Flexbox, used for building responsive web interfaces. It is purely CSS (with no JavaScript required) and offers an extensive range of ready-to-use components and utility classes, such as grids, columns, buttons, forms, and more. Bulma’s design is clean and elegant out-of-the-box, and it emphasizes ease of use—developers can apply classes to HTML elements to achieve complex layouts and styling quickly. Its modular nature also allows importing only the needed components for smaller footprint.",
        "category": "Frontend",
        "license": "MIT",
        "cost": "Free",
        "size": "0.25 MB",
        "version": "0.9.4",
        "stars": 47000,
        "last_updated": "2023",
        "os": "Cross-platform",
        "tags": [
            "CSS",
            "Framework",
            "Responsive",
            "Flexbox"
        ],
        "source": "https://bulma.io"
    },
    {
        "id": "foundation",
        "name": "Foundation",
        "description": "Foundation is a responsive front-end framework that provides a flexible grid system and a large set of UI components, similarly to Bootstrap. Developed by ZURB, Foundation is known for being highly customizable and mobile-first. It includes HTML/CSS components and optional JavaScript plugins (for things like modals, tooltips, and carousels) and emphasizes a design-agnostic approach, allowing designers to start with a basic foundation and build their own look on top. It has been used in many production websites as a solid base for responsive design.",
        "category": "Frontend",
        "license": "MIT",
        "cost": "Free",
        "size": "0.37 MB",
        "version": "6.7.5",
        "stars": 29000,
        "last_updated": "2021",
        "os": "Cross-platform",
        "tags": [
            "CSS",
            "Framework",
            "Responsive",
            "UI"
        ],
        "source": "https://get.foundation"
    },
    {
        "id": "semantic-ui",
        "name": "Semantic UI",
        "description": "Semantic UI is a development framework that helps create beautiful, responsive layouts using human-friendly HTML. It comes with a theming system and a rich collection of components like buttons, dropdowns, form elements, and more, all styled with a semantic class naming system that reads like English. Semantic UI’s philosophy is to make the code self-documenting (e.g., a button’s classes might be “ui blue large button”). It allows for extensive customization through themes and has integrations for React, Angular, and Meteor as well.",
        "category": "Frontend",
        "license": "MIT",
        "cost": "Free",
        "size": "1.1 MB",
        "version": "2.4.2",
        "stars": 50000,
        "last_updated": "2018",
        "os": "Cross-platform",
        "tags": [
            "CSS",
            "UI Framework",
            "Responsive",
            "Components"
        ],
        "source": "https://semantic-ui.com"
    },
    {
        "id": "materialize",
        "name": "Materialize",
        "description": "Materialize is a modern responsive front-end framework based on Material Design, Google’s design language. It provides a set of components and CSS styles that implement Material Design out of the box, including cards, modals, typography, and colors. Materialize includes animations and interactions via JavaScript (built on jQuery) for components like carousels and collapsibles. It allows developers to quickly scaffold Material Design-compliant web interfaces without building styles from scratch, making it useful for prototyping and building aesthetically pleasing sites.",
        "category": "Frontend",
        "license": "MIT",
        "cost": "Free",
        "size": "0.50 MB",
        "version": "1.0.0",
        "stars": 39000,
        "last_updated": "2018",
        "os": "Cross-platform",
        "tags": [
            "CSS",
            "Material Design",
            "Responsive",
            "Framework"
        ],
        "source": "https://materializecss.com"
    },
    {
        "id": "chartjs",
        "name": "Chart.js",
        "description": "Chart.js is a simple yet flexible JavaScript library for creating interactive charts on web pages. It supports a variety of chart types—line, bar, pie, radar, polar area, scatter, and more—and is based on the HTML5 canvas element. Chart.js is known for its ease of use: with minimal code you can turn your data into beautiful visualizations, and it offers animation, tooltips, and extensibility via plugins. It’s widely used for embedding analytics and data visualization in web applications with minimal overhead.",
        "category": "Frontend",
        "license": "MIT",
        "cost": "Free",
        "size": "0.28 MB",
        "version": "4.2.1",
        "stars": 60000,
        "last_updated": "2023",
        "os": "Cross-platform",
        "tags": [
            "JavaScript",
            "Charts",
            "Visualization",
            "Canvas"
        ],
        "source": "https://www.chartjs.org"
    },
    {
        "id": "d3js",
        "name": "D3.js",
        "description": "D3.js (Data-Driven Documents) is a powerful JavaScript library for producing dynamic, interactive data visualizations in web browsers. It uses HTML, SVG, and CSS to bring data to life, allowing developers to bind data to DOM elements and apply data-driven transformations to the document. D3 provides low-level building blocks (like scales, axes, shapes, etc.) rather than pre-built chart components, giving maximal flexibility to create custom visualizations. It’s highly performant for handling large datasets and is the foundation for many chart libraries and advanced visualizations on the web.",
        "category": "Frontend",
        "license": "BSD-3-Clause",
        "cost": "Free",
        "size": "0.53 MB",
        "version": "7.8.4",
        "stars": 105000,
        "last_updated": "2022",
        "os": "Cross-platform",
        "tags": [
            "JavaScript",
            "Visualization",
            "SVG",
            "Data"
        ],
        "source": "https://d3js.org"
    },
    {
        "id": "threejs",
        "name": "Three.js",
        "description": "Three.js is a cross-browser JavaScript library and API for creating and displaying 3D graphics in the browser using WebGL. It simplifies the complexities of WebGL by providing an easy-to-use layer for defining scenes, cameras, lights, materials, and 3D objects. Developers can create rich 3D animations, interactive models, and even simple games that run in a browser without plugins. Three.js has a large community with numerous examples and integrations (like with VR/AR), making it the de facto choice for web-based 3D content.",
        "category": "Frontend",
        "license": "MIT",
        "cost": "Free",
        "size": "0.50 MB",
        "version": "0.153.0",
        "stars": 90000,
        "last_updated": "2025",
        "os": "Cross-platform",
        "tags": [
            "JavaScript",
            "3D",
            "WebGL",
            "Graphics"
        ],
        "source": "https://threejs.org"
    },
    {
        "id": "babylonjs",
        "name": "Babylon.js",
        "description": "Babylon.js is an advanced 3D engine for building immersive web experiences with HTML5 and WebGL. It enables developers to create 3D scenes and games entirely in the browser with support for physics, advanced materials, lighting, shadows, and even VR/AR experiences. Babylon.js has a rich API and a playground for testing code live. It provides high-level features like a glTF loader for 3D models and a physics engine integration, abstracting many WebGL details so developers can focus on content.",
        "category": "Frontend",
        "license": "Apache-2.0",
        "cost": "Free",
        "size": "1.8 MB",
        "version": "6.0.0",
        "stars": 21000,
        "last_updated": "2023",
        "os": "Cross-platform",
        "tags": [
            "JavaScript",
            "3D Engine",
            "WebGL",
            "GameDev"
        ],
        "source": "https://www.babylonjs.com"
    },
    {
        "id": "pixijs",
        "name": "PixiJS",
        "description": "PixiJS is a fast, lightweight 2D rendering library for creating rich, interactive graphics and cross-platform applications. Using WebGL under the hood (with canvas fallback), PixiJS is optimized for high-performance rendering of sprites, textures, and text. It’s often used for making 2D games, interactive web experiences, and other graphics-intensive applications that require a step above standard DOM manipulation. PixiJS provides an accessible API for scene management, animation, and interaction, making HTML5 canvas/WebGL development much easier.",
        "category": "Frontend",
        "license": "MIT",
        "cost": "Free",
        "size": "0.44 MB",
        "version": "7.2.4",
        "stars": 38000,
        "last_updated": "2024",
        "os": "Cross-platform",
        "tags": [
            "JavaScript",
            "Canvas",
            "WebGL",
            "2D"
        ],
        "source": "https://pixijs.com"
    },
    {
        "id": "highcharts",
        "name": "Highcharts",
        "description": "Highcharts is a commercial JavaScript charting library that allows developers to create interactive charts for web applications. It supports a wide range of chart types (line, bar, pie, stock charts, maps, etc.) and features like tooltips, zooming, and exporting out-of-the-box. Highcharts is known for its polished look and cross-browser compatibility. While free for personal and non-commercial use, it requires a paid license for commercial projects. Its API is user-friendly, and it provides wrappers for frameworks like React, Angular, and Vue.",
        "category": "Frontend",
        "license": "Proprietary (Free for non-commercial)",
        "cost": "$1720 (Commercial license)",
        "size": "0.24 MB",
        "version": "10.3.3",
        "stars": 12000,
        "last_updated": "2023",
        "os": "Cross-platform",
        "tags": [
            "JavaScript",
            "Charts",
            "Enterprise",
            "DataViz"
        ],
        "source": "https://www.highcharts.com"
    },
    {
        "id": "echarts",
        "name": "ECharts",
        "description": "Apache ECharts (formerly just ECharts) is a powerful, open-source visualization library written in JavaScript. It provides a rich set of interactive charts including line graphs, bar charts, pie charts, scatter plots, heatmaps, treemaps, and more, with smooth animations. ECharts is highly extensible and configurable, with support for large datasets and real-time updates. It is often used in dashboards and data analysis tools, and being an Apache project, it’s completely free and maintained by a community of contributors.",
        "category": "Frontend",
        "license": "Apache-2.0",
        "cost": "Free",
        "size": "0.78 MB",
        "version": "5.4.2",
        "stars": 55000,
        "last_updated": "2023",
        "os": "Cross-platform",
        "tags": [
            "JavaScript",
            "Charts",
            "Visualization",
            "Apache"
        ],
        "source": "https://echarts.apache.org"
    },
    {
        "id": "lodash",
        "name": "Lodash",
        "description": "Lodash is a widely-used JavaScript utility library that provides dozens of helpful functions for tasks like manipulating arrays, objects, strings, and other data types. It offers convenient methods for cloning, merging, debouncing, throttling, and more, in a consistent cross-browser manner. Lodash was derived from Underscore.js but expanded with more features and better performance. It helps developers write cleaner code by abstracting common patterns, and its modular design allows importing only the needed functions to reduce bundle size.",
        "category": "Frontend",
        "license": "MIT",
        "cost": "Free",
        "size": "0.08 MB",
        "version": "4.17.21",
        "stars": 55000,
        "last_updated": "February 2021",
        "os": "Cross-platform",
        "tags": [
            "JavaScript",
            "Utility",
            "Functional",
            "Data"
        ],
        "source": "https://lodash.com"
    },
    {
        "id": "dayjs",
        "name": "Day.js",
        "description": "Day.js is a minimalist JavaScript library for date and time manipulation, designed to be a modern alternative to Moment.js. It has an almost identical API to Moment, making it easy to replace, but it is much smaller (around 2KB) and immutable. Day.js supports parsing, validating, manipulating, and formatting dates, with internationalization (i18n) support for dozens of locales. Through plugin extensions, it can handle relative time, custom parse formats, advanced calendars, and time zones, all while remaining lightweight.",
        "category": "Frontend",
        "license": "MIT",
        "cost": "Free",
        "size": "0.02 MB",
        "version": "1.11.7",
        "stars": 43000,
        "last_updated": "2023",
        "os": "Cross-platform",
        "tags": [
            "JavaScript",
            "Date",
            "Time",
            "MomentJS-alternative"
        ],
        "source": "https://day.js.org"
    },
    {
        "id": "axios",
        "name": "Axios",
        "description": "Axios is a promise-based HTTP client for the browser and Node.js, used for making HTTP requests (e.g., AJAX calls). It provides a simple API to send asynchronous HTTP requests to REST endpoints and perform CRUD operations. Axios automatically transforms JSON data, supports interceptors (to globally handle request/response or errors), and is easily configurable (base URLs, headers, timeouts). It has become one of the go-to libraries for handling network requests in JavaScript applications due to its ease of use and broad compatibility.",
        "category": "Frontend",
        "license": "MIT",
        "cost": "Free",
        "size": "0.02 MB",
        "version": "1.3.4",
        "stars": 100000,
        "last_updated": "2023",
        "os": "Cross-platform",
        "tags": [
            "JavaScript",
            "HTTP",
            "AJAX",
            "Promise"
        ],
        "source": "https://axios-http.com"
    },
    {
        "id": "redux",
        "name": "Redux",
        "description": "Redux is a predictable state container for JavaScript applications, commonly used with React (though it can integrate with other frameworks or vanilla JS). It implements a unidirectional data flow and centralizes the application’s state in a single store, which can only be modified by dispatching actions that are handled by pure reducer functions. This predictable pattern makes state changes traceable and easier to debug. Redux’s strict architecture offers great developer tools (like time-travel debugging) and is highly valued in complex applications where many components share state.",
        "category": "Frontend",
        "license": "MIT",
        "cost": "Free",
        "size": "0.02 MB",
        "version": "4.2.1",
        "stars": 58000,
        "last_updated": "2022",
        "os": "Cross-platform",
        "tags": [
            "JavaScript",
            "State Management",
            "Flux",
            "React"
        ],
        "source": "https://redux.js.org"
    },
    {
        "id": "mobx",
        "name": "MobX",
        "description": "MobX is a simple yet powerful state management library for JavaScript applications that makes state observable. Instead of a single central store (like Redux), MobX allows multiple observable objects, and any changes to these observables automatically propagate to the parts of the application that use them (observers). This leads to a transparent reactivity model: the UI is always consistent with the current app state without explicit glue code. MobX is often used with React, enabling very terse and intuitive state management, especially for complex forms or data models.",
        "category": "Frontend",
        "license": "MIT",
        "cost": "Free",
        "size": "0.05 MB",
        "version": "6.8.0",
        "stars": 26000,
        "last_updated": "2023",
        "os": "Cross-platform",
        "tags": [
            "JavaScript",
            "State Management",
            "Reactive",
            "Observable"
        ],
        "source": "https://mobx.js.org"
    },
    {
        "id": "rxjs",
        "name": "RxJS",
        "description": "RxJS (Reactive Extensions for JavaScript) is a library for reactive programming using Observables, which makes it easier to compose asynchronous or callback-based code. It provides a wide variety of operators to transform, combine, filter, and manipulate streams of events or data. RxJS is a core part of the Angular framework (as Angular’s HTTP and many other APIs return Observables) but can be used independently in any JS application. It’s powerful for managing complex async flows like UI events, server requests, timers, and more in a declarative way.",
        "category": "Frontend",
        "license": "Apache-2.0",
        "cost": "Free",
        "size": "0.33 MB",
        "version": "7.8.0",
        "stars": 28000,
        "last_updated": "2023",
        "os": "Cross-platform",
        "tags": [
            "JavaScript",
            "ReactiveX",
            "Observables",
            "Async"
        ],
        "source": "https://rxjs.dev"
    },
    {
        "id": "webpack",
        "name": "Webpack",
        "description": "Webpack is a powerful module bundler for JavaScript applications. It takes modules with dependencies (scripts, styles, images, etc.) and bundles them into optimized assets for deployment. Webpack introduced the concept of “loaders” to preprocess files (like bundling CSS, transpiling TypeScript/JSX) and “plugins” to extend its capabilities (such as optimizing output, injecting environment variables, etc.). It supports code splitting, which allows lazy-loading parts of the application. As a core tool in modern frontend development, Webpack ensures that projects of all sizes can be efficiently built and loaded in the browser.",
        "category": "Frontend",
        "license": "MIT",
        "cost": "Free",
        "size": "1.1 MB",
        "version": "5.76.0",
        "stars": 62000,
        "last_updated": "2023",
        "os": "Cross-platform",
        "tags": [
            "Build Tool",
            "Module Bundler",
            "JavaScript",
            "Optimization"
        ],
        "source": "https://webpack.js.org"
    },
    {
        "id": "babel",
        "name": "Babel",
        "description": "Babel is a popular JavaScript compiler (transpiler) that lets developers write code using next-generation JavaScript (ES6/ES7+ and JSX) or other languages (TypeScript) and have it transformed into backwards-compatible version of JavaScript that current and older browsers can execute. Babel is highly configurable with presets and plugins to handle syntax transforms, polyfills, and source maps. It is often used in the build process of web applications, especially those using frameworks like React or Angular, to ensure modern syntax and features run seamlessly in all target environments.",
        "category": "Frontend",
        "license": "MIT",
        "cost": "Free",
        "size": "1.5 MB",
        "version": "7.21.0",
        "stars": 42000,
        "last_updated": "2023",
        "os": "Cross-platform",
        "tags": [
            "JavaScript",
            "Compiler",
            "ES6",
            "Transpiler"
        ],
        "source": "https://babeljs.io"
    },
    {
        "id": "eslint",
        "name": "ESLint",
        "description": "ESLint is a widely used pluggable linting utility for JavaScript and TypeScript. It analyzes code for syntax errors, potential bugs, and style issues based on a set of rules and can automatically fix some problems. ESLint is highly configurable with shareable configs (like Airbnb or Google style guides) and supports custom rule plugins. By integrating ESLint into development workflows (IDE integrations or pre-commit hooks), developers ensure code consistency and catch common mistakes early, improving code quality across large teams and projects.",
        "category": "Frontend",
        "license": "MIT",
        "cost": "Free",
        "size": "7.5 MB",
        "version": "8.35.0",
        "stars": 23000,
        "last_updated": "2025",
        "os": "Cross-platform",
        "tags": [
            "Linting",
            "Quality",
            "Static Analysis",
            "JavaScript"
        ],
        "source": "https://eslint.org"
    },
    {
        "id": "parcel",
        "name": "Parcel",
        "description": "Parcel is a zero-configuration web application bundler that aims to simplify the build process. It automatically handles bundling of JS, CSS, HTML, and assets with no or minimal setup, making it very beginner-friendly. Parcel has out-of-the-box support for many features: it transpiles modern JS, supports React/TypeScript, and even has a development server with hot module replacement. It parallelizes work for fast builds and uses caching for subsequent builds. Developers choose Parcel for small to medium projects or prototypes where ease of setup and speed are top priorities.",
        "category": "Frontend",
        "license": "MIT",
        "cost": "Free",
        "size": "2.9 MB",
        "version": "2.8.3",
        "stars": 42000,
        "last_updated": "2023",
        "os": "Cross-platform",
        "tags": [
            "Build Tool",
            "Bundler",
            "Zero-config",
            "JavaScript"
        ],
        "source": "https://parceljs.org"
    },
    {
        "id": "rollup",
        "name": "Rollup",
        "description": "Rollup is a module bundler for JavaScript, particularly well-suited for bundling libraries and applications that use ES6 modules. It emphasizes the concept of tree-shaking, which automatically removes unused code, resulting in smaller bundles. Rollup outputs code that is often cleaner and more readable by leveraging ES module syntax. It’s commonly used to build libraries (including many frameworks themselves use Rollup to distribute ESM and UMD builds) because it can produce both modern and legacy module formats. Rollup is plugin-extensible and can be configured for a variety of use cases, though it generally requires a bit more setup than tools like Parcel.",
        "category": "Frontend",
        "license": "MIT",
        "cost": "Free",
        "size": "0.21 MB",
        "version": "3.20.5",
        "stars": 23000,
        "last_updated": "2023",
        "os": "Cross-platform",
        "tags": [
            "Bundler",
            "ESM",
            "Tree-shaking",
            "JavaScript"
        ],
        "source": "https://rollupjs.org"
    },
    {
        "id": "storybook",
        "name": "Storybook",
        "description": "Storybook is an open-source tool for developing and documenting UI components in isolation. It provides a development environment where developers can browse a library of visual components (React, Vue, Angular, etc.), and see different states of each component (“stories”) without running the entire app. Storybook aids in UI development, testing, and documentation by allowing for interactive experimentation with components. It supports add-ons for accessibility checks, visual testing, and documentation generation, making it a key tool in design systems and component-driven development.",
        "category": "Frontend",
        "license": "MIT",
        "cost": "Free",
        "size": "21 MB",
        "version": "7.0.3",
        "stars": 79000,
        "last_updated": "2025",
        "os": "Cross-platform",
        "tags": [
            "UI",
            "Components",
            "Documentation",
            "React"
        ],
        "source": "https://storybook.js.org"
    },
    {
        "id": "gsap",
        "name": "GSAP",
        "description": "GreenSock Animation Platform (GSAP) is a robust JavaScript library for creating high-performance animations that work in all major browsers. GSAP can animate CSS properties, SVG, canvas objects, React components, and more with great control and precision. It features a rich timeline system for sequencing animations and numerous plugins (like ScrollTrigger for scroll-based animations, Draggable, etc.). While GSAP’s core is free to use (even for commercial projects), some bonus plugins require a Club GreenSock membership. Developers often choose GSAP for its reliability and smooth, jank-free animations especially in complex interactive projects.",
        "category": "Frontend",
        "license": "Custom (GreenSock)",
        "cost": "Free (Club plugins require paid license)",
        "size": "0.12 MB",
        "version": "3.11.5",
        "stars": 15000,
        "last_updated": "2023",
        "os": "Cross-platform",
        "tags": [
            "Animation",
            "SVG",
            "HTML5",
            "Timeline"
        ],
        "source": "https://greensock.com/gsap"
    },
    {
        "id": "apollo-client",
        "name": "Apollo Client",
        "description": "Apollo Client is a comprehensive state management library for JavaScript that enables developers to manage both local and remote data with GraphQL. Often used with React (via apollo-client React hooks), it simplifies fetching, caching, and modifying application data. Apollo handles GraphQL queries and mutations, automatically caches query results, and updates UI components in response to data changes. It also supports features like optimistic UI (for instant feedback on mutations), subscriptions for real-time data, and devtools for debugging. It’s a critical part of the Apollo GraphQL ecosystem and is widely adopted in apps that use GraphQL APIs.",
        "category": "Frontend",
        "license": "MIT",
        "cost": "Free",
        "size": "0.13 MB",
        "version": "3.7.8",
        "stars": 18000,
        "last_updated": "2023",
        "os": "Cross-platform",
        "tags": [
            "GraphQL",
            "State Management",
            "React",
            "Data"
        ],
        "source": "https://www.apollographql.com/docs/react/"
    },
    {
        "id": "alpinejs",
        "name": "Alpine.js",
        "description": "Alpine.js is a lightweight JavaScript framework characterized as “jQuery for the modern web”. It offers a declarative way to add interactivity to HTML markup with minimal code, inspired by Vue.js and React, but significantly smaller. Using attributes like x-data, x-bind, and x-on, developers can control state and behavior directly in the HTML. Alpine is great for sprucing up server-rendered pages with interactive components without a full build step or framework overhead. It’s often used as a simpler alternative to heavy frameworks for cases where just a bit of JavaScript behavior is needed.",
        "category": "Frontend",
        "license": "MIT",
        "cost": "Free",
        "size": "0.08 MB",
        "version": "3.12.0",
        "stars": 23000,
        "last_updated": "2024",
        "os": "Cross-platform",
        "tags": [
            "JavaScript",
            "Lightweight",
            "Reactive",
            "DOM"
        ],
        "source": "https://alpinejs.dev"
    },
    {
        "id": "preact",
        "name": "Preact",
        "description": "Preact is a fast, lightweight alternative to React, weighing in at only a few kilobytes. It has the same ES6 API and utility as React (stateful components, lifecycle methods, etc.) but with a much smaller footprint and slightly different internal implementation. Preact achieves its size by focusing on the core essentials of React’s API. It can be used as a drop-in replacement for React in many cases, especially when file size is a concern (like on mobile web). Preact’s compatibility layer, preact/compat, even allows many React libraries to work seamlessly with it.",
        "category": "Frontend",
        "license": "MIT",
        "cost": "Free",
        "size": "0.03 MB",
        "version": "10.13.1",
        "stars": 34000,
        "last_updated": "2024",
        "os": "Cross-platform",
        "tags": [
            "JavaScript",
            "React-like",
            "UI",
            "Lightweight"
        ],
        "source": "https://preactjs.com"
    },
    {
        "id": "lit",
        "name": "Lit",
        "description": "Lit (formerly LitElement/Polymer) is an open-source library from Google for building lightweight web components. Lit makes it easy to define custom HTML elements with encapsulated structure, style, and behavior by extending a base LitElement class. It uses tagged template literals for defining HTML templates and a reactive property system to efficiently update the DOM. Under the hood, Lit leverages the native Web Components APIs (Custom Elements and Shadow DOM) and focuses on being minimal and fast. It’s often used to create design systems or to embed reusable components in websites without large framework overhead.",
        "category": "Frontend",
        "license": "BSD-3-Clause",
        "cost": "Free",
        "size": "0.05 MB",
        "version": "2.4.0",
        "stars": 15000,
        "last_updated": "2023",
        "os": "Cross-platform",
        "tags": [
            "Web Components",
            "Custom Elements",
            "Google",
            "Polymer"
        ],
        "source": "https://lit.dev"
    },
    {
        "id": "fullcalendar",
        "name": "FullCalendar",
        "description": "FullCalendar is a full-featured JavaScript calendar library that provides a visually rich and interactive calendar component in the browser. It can display daily, weekly, monthly views and supports drag-and-drop for events, event editing, and integration with external data (like Google Calendar). FullCalendar offers theming (including Bootstrap theme support) and a plugin system for additional features like timeline or resource scheduling. It’s often used in dashboards and scheduling applications where a robust calendar UI is needed. The core is free and open-source, with additional premium plugins available for purchase.",
        "category": "Frontend",
        "license": "MIT",
        "cost": "Free (core); Paid addons",
        "size": "0.17 MB",
        "version": "6.1.4",
        "stars": 14000,
        "last_updated": "2023",
        "os": "Cross-platform",
        "tags": [
            "Calendar",
            "Scheduling",
            "jQuery-plugin",
            "Events"
        ],
        "source": "https://fullcalendar.io"
    },
    {
        "id": "jquery-ui",
        "name": "jQuery UI",
        "description": "jQuery UI is an official suite of user interface widgets, effects, and themes built on top of jQuery. It provides interactive components like draggable/droppable elements, sliders, datepickers, dialogs, tabs, and more, which can be styled via a theme framework. jQuery UI was instrumental in the era before modern frameworks, allowing developers to enrich web pages with ready-made UI elements without building from scratch. It remains relevant for legacy projects and simple applications that still use jQuery, though its active development has slowed as the web moved to newer frameworks.",
        "category": "Frontend",
        "license": "MIT",
        "cost": "Free",
        "size": "0.25 MB",
        "version": "1.13.2",
        "stars": 11300,
        "last_updated": "2021",
        "os": "Cross-platform",
        "tags": [
            "jQuery",
            "Widgets",
            "Themes",
            "Legacy"
        ],
        "source": "https://jqueryui.com"
    },
    {
        "id": "vite",
        "name": "Vite",
        "description": "Vite is a next-generation front-end build tool developed by the creator of Vue.js. It emphasizes speed, using native ES modules in development (leveraging browser support) and bundling the code with Rollup for production. Vite provides a dev server that starts up almost instantly and offers HMR (Hot Module Replacement) that is extremely fast, regardless of application size. It supports Vue, React, and other frameworks via plugins, and it requires minimal configuration to get started. Vite is becoming popular as a lighter, faster alternative to heavy bundlers like Webpack for modern web projects.",
        "category": "Frontend",
        "license": "MIT",
        "cost": "Free",
        "size": "0.15 MB",
        "version": "4.2.0",
        "stars": 60000,
        "last_updated": "2025",
        "os": "Cross-platform",
        "tags": [
            "Build Tool",
            "Dev Server",
            "ESM",
            "Fast"
        ],
        "source": "https://vitejs.dev"
    },
    {
        "id": "sass",
        "name": "Sass",
        "description": "Sass (Syntactically Awesome Stylesheets) is a very mature, stable CSS preprocessor that adds powerful features to CSS such as variables, nested rules, mixins, functions, and inheritance. It helps keep large stylesheets well-organized and allows for easier maintenance of complex CSS. Sass code is compiled into standard CSS that browsers can understand. It has two syntax flavors (the older indented syntax .sass and the newer SCSS syntax which is a superset of CSS). Sass has become a standard tool in web development to produce manageable and DRY (Don’t Repeat Yourself) CSS.",
        "category": "Frontend",
        "license": "MIT",
        "cost": "Free",
        "size": "5 MB",
        "version": "1.62.0",
        "stars": 14500,
        "last_updated": "2025",
        "os": "Cross-platform",
        "tags": [
            "CSS Preprocessor",
            "SCSS",
            "Stylesheets",
            "Compiler"
        ],
        "source": "https://sass-lang.com"
    },
    {
        "id": "less",
        "name": "Less",
        "description": "Less is a CSS preprocessor inspired by Sass, which extends CSS with dynamic behavior such as variables, mixins, operations, and functions. Less can be run on the server side (with Node.js) or client side in the browser. It allows developers to write cleaner modular CSS and then compiles to standard CSS. Many concepts in Less (like nested rules or mixins) influenced later additions to native CSS (like custom properties). While Less was used in projects like Bootstrap 3, it has been somewhat overshadowed by Sass in recent years, but still remains in use in many codebases.",
        "category": "Frontend",
        "license": "Apache-2.0",
        "cost": "Free",
        "size": "0.37 MB",
        "version": "4.1.3",
        "stars": 17000,
        "last_updated": "2022",
        "os": "Cross-platform",
        "tags": [
            "CSS Preprocessor",
            "Stylesheet",
            "Variables",
            "Mixins"
        ],
        "source": "https://lesscss.org"
    },
    {
        "id": "cytoscapejs",
        "name": "Cytoscape.js",
        "description": "Cytoscape.js is an open-source graph theory (network) library for visualizing interactive graphs in the browser. It allows developers to create, manipulate, and style graphs (nodes and edges) and supports a variety of graph layouts (force-directed, concentric, grid, etc.). With Cytoscape.js, users can pan, zoom, and interact with network nodes. It is built for performance even with large graphs and has extensions for additional functionality. Common use cases include social network analysis, bioinformatics (pathway diagrams), and any application that needs to display relationships between entities.",
        "category": "Frontend",
        "license": "MIT",
        "cost": "Free",
        "size": "0.24 MB",
        "version": "3.24.0",
        "stars": 6300,
        "last_updated": "2024",
        "os": "Cross-platform",
        "tags": [
            "Graph",
            "Visualization",
            "Networks",
            "Analysis"
        ],
        "source": "https://js.cytoscape.org"
    },
    {
        "id": "aurelia",
        "name": "Aurelia",
        "description": "Aurelia is a forward-thinking, modular JavaScript framework for web development. It leverages strong conventions to eliminate boilerplate and features two-way data-binding, dependency injection, and powerful templating capabilities. Aurelia is written with modern ES2015+ and has no external dependencies, using native modules. It is designed as a collection of feature-oriented modules, meaning developers can pick and choose parts of Aurelia (like the binding or router) a la carte. Known for its simplicity and clean architecture, Aurelia can be a good choice for building maintainable front-end apps at scale.",
        "category": "Frontend",
        "license": "MIT",
        "cost": "Free",
        "size": "0.50 MB",
        "version": "2.0.0",
        "stars": 13000,
        "last_updated": "2022",
        "os": "Cross-platform",
        "tags": [
            "JavaScript",
            "Framework",
            "MVC",
            "Two-way binding"
        ],
        "source": "https://aurelia.io"
    },
    {
        "id": "mithril",
        "name": "Mithril",
        "description": "Mithril is a modern client-side JavaScript framework for building Single Page Applications. It’s very small (around 8KB gzipped) yet provides routing and XHR utilities out of the box. Mithril uses a virtual DOM like React, and it emphasizes simplicity and speed. Its API is straightforward – components are simple JavaScript objects with a view function that returns virtual DOM (hyperscript or JSX). Mithril gained popularity for its fast performance and minimalistic approach, and has been used in production by companies like Vimeo and Nike for certain projects.",
        "category": "Frontend",
        "license": "MIT",
        "cost": "Free",
        "size": "0.008 MB",
        "version": "2.3.1",
        "stars": 14000,
        "last_updated": "2023",
        "os": "Cross-platform",
        "tags": [
            "JavaScript",
            "Framework",
            "Lightweight",
            "SPA"
        ],
        "source": "https://mithril.js.org"
    },
    {
        "id": "extjs",
        "name": "Ext JS",
        "description": "Ext JS is a mature JavaScript framework for building data-intensive, enterprise-grade web applications. It provides a comprehensive set of GUI components like grids, forms, trees, menus with a robust MVC/MVVM architecture. Ext JS is known for its rich feature set (such as powerful grid with virtual scrolling, locking, and editing) and a consistent look-and-feel via theming. Originally developed by Sencha, Ext JS is distributed under a dual licensing model: open-source GPL for open applications and a commercial license for proprietary use. It’s often used in enterprise environments where a full-stack front-end solution is desired.",
        "category": "Frontend",
        "license": "GPL-3.0 / Commercial",
        "cost": "$1295/developer",
        "size": "7 MB",
        "version": "7.6.0",
        "stars": 11000,
        "last_updated": "2023",
        "os": "Cross-platform",
        "tags": [
            "JavaScript",
            "Framework",
            "Enterprise",
            "Widgets"
        ],
        "source": "https://sencha.com/products/extjs"
    },
    {
        "id": "kendoui",
        "name": "Kendo UI",
        "description": "Kendo UI is a commercial UI toolkit by Progress Telerik that offers a wide array of widgets and components for building modern web apps. It provides UI libraries for jQuery, Angular, React, and Vue, all adhering to a consistent theme and API design. Components include rich data grids, schedulers, charts, drop-downs, and many more, suitable for enterprise applications. Kendo UI components are known for extensive features (pagination, virtualization, editing, export, etc.) and professional support. It is a paid product, often chosen by companies that need ready-to-use, high-quality UI components to accelerate development.",
        "category": "Frontend",
        "license": "Proprietary",
        "cost": "$999/developer",
        "size": "10 MB",
        "version": "2023.1.314",
        "stars": 1000,
        "last_updated": "2023",
        "os": "Cross-platform",
        "tags": [
            "UI Components",
            "Enterprise",
            "jQuery",
            "Angular"
        ],
        "source": "https://www.telerik.com/kendo-ui"
    },
    {
        "id": "ag-grid",
        "name": "AG Grid",
        "description": "AG Grid is a feature-rich data grid component available in both open-source (Community Edition) and commercial (Enterprise Edition) versions. It supports plain JavaScript as well as Angular, React, and Vue integrations. AG Grid is known for high performance with large data sets and offers advanced functionalities like filtering, sorting, grouping, aggregation, pivoting, and live updates. The Enterprise version adds even more features like Excel export, clipboard operations, and master-detail. It’s widely used in enterprise applications where a powerful and customizable datagrid is a central requirement.",
        "category": "Frontend",
        "license": "MIT (Community), Proprietary (Enterprise)",
        "cost": "Free / ~$1500 per developer (Enterprise)",
        "size": "2 MB",
        "version": "29.3.3",
        "stars": 11000,
        "last_updated": "2025",
        "os": "Cross-platform",
        "tags": [
            "Data Grid",
            "Tables",
            "Enterprise",
            "Angular"
        ],
        "source": "https://www.ag-grid.com"
    },
    {
        "id": "datatables",
        "name": "DataTables",
        "description": "DataTables is a jQuery plugin that adds advanced interactive controls to HTML tables. It provides features like pagination, instant search filtering, sorting by columns, and the ability to fetch data via AJAX to populate the table. DataTables is highly extensible with a plugin architecture—additional functionalities such as column reordering, fixed headers, and export buttons can be added. It is often used in dashboards and admin interfaces to handle tabular data elegantly without needing to reinvent table behaviors. The core library is open-source (MIT), with some optional plug-ins under GPL.",
        "category": "Frontend",
        "license": "MIT",
        "cost": "Free",
        "size": "0.07 MB",
        "version": "1.13.4",
        "stars": 7000,
        "last_updated": "2023",
        "os": "Cross-platform",
        "tags": [
            "jQuery",
            "Table",
            "Grid",
            "Pagination"
        ],
        "source": "https://datatables.net"
    },
    {
        "id": "select2",
        "name": "Select2",
        "description": "Select2 is a jQuery-based replacement for HTML select dropdowns, offering search capability, multi-select, and AJAX loading of options. It turns simple <select> elements into feature-rich components that can handle tagging (user-created options), remote data sources, infinite scrolling of results, and theming (including Bootstrap integration). Select2 is highly configurable (placeholders, disabling, templating of results, etc.) and is widely used in forms where a better user experience for long or multiple selection lists is needed beyond the native HTML capabilities.",
        "category": "Frontend",
        "license": "MIT",
        "cost": "Free",
        "size": "0.09 MB",
        "version": "4.0.13",
        "stars": 25000,
        "last_updated": "2022",
        "os": "Cross-platform",
        "tags": [
            "jQuery",
            "Dropdown",
            "Autocomplete",
            "Plugin"
        ],
        "source": "https://select2.org"
    },
    {
        "id": "leaflet",
        "name": "Leaflet",
        "description": "Leaflet is an open-source JavaScript library for mobile-friendly interactive maps. It allows developers to easily display tiled web maps (with providers like OpenStreetMap) and add map layers, markers, popups, and interactions. Leaflet is lightweight (~39KB gzipped) yet has most features needed for basic mapping and supports plugins for additional functionality (like drawing, heatmaps, clustering markers). It’s widely used for mapping needs in web projects due to its simplicity and performance, especially on mobile devices, without the need for heavy GIS frameworks.",
        "category": "Frontend",
        "license": "BSD-2-Clause",
        "cost": "Free",
        "size": "0.04 MB",
        "version": "1.9.3",
        "stars": 36000,
        "last_updated": "2023",
        "os": "Cross-platform",
        "tags": [
            "Maps",
            "Geospatial",
            "OpenStreetMap",
            "Markers"
        ],
        "source": "https://leafletjs.com"
    },
    {
        "id": "openlayers",
        "name": "OpenLayers",
        "description": "OpenLayers is a high-performance, open-source JavaScript library for displaying maps and geospatial data in web browsers. It supports a variety of map sources (OSM, Bing, custom tile servers), vector data formats (GeoJSON, KML, etc.), and advanced features like vector editing, clustering, and reprojection of coordinates. OpenLayers is very powerful and often used in GIS applications, offering fine-grained control over the map and layers. It is framework-agnostic and can be integrated with vanilla JS or any front-end framework.",
        "category": "Frontend",
        "license": "BSD-2-Clause",
        "cost": "Free",
        "size": "1.1 MB",
        "version": "7.2.2",
        "stars": 11000,
        "last_updated": "2024",
        "os": "Cross-platform",
        "tags": [
            "Maps",
            "GIS",
            "WebGL",
            "Geospatial"
        ],
        "source": "https://openlayers.org"
    },
    {
        "id": "animejs",
        "name": "Anime.js",
        "description": "Anime.js is a lightweight JavaScript animation library with a simple but powerful API. It works with CSS properties, SVG, DOM attributes, and JavaScript objects, making it versatile for different kinds of animations. With Anime.js, developers can create complex animation sequences (including timelines) with play, pause, seek controls, and it supports easing functions, motion along paths, and other advanced features. Its small size and broad browser compatibility make it a go-to choice for adding polished animations and effects to web pages without heavy overhead.",
        "category": "Frontend",
        "license": "MIT",
        "cost": "Free",
        "size": "0.02 MB",
        "version": "3.2.1",
        "stars": 15000,
        "last_updated": "2021",
        "os": "Cross-platform",
        "tags": [
            "Animation",
            "SVG",
            "Canvas",
            "Tweening"
        ],
        "source": "https://animejs.com"
    },
    {
        "id": "velocityjs",
        "name": "Velocity.js",
        "description": "Velocity.js is an animation engine that re-implements jQuery’s $.animate() for speed and also extends it with features like color animations, transforms, loops, and easings. It bypasses jQuery’s slower animation stack by directly manipulating DOM elements, achieving high performance. Velocity can be used with or without jQuery and is a convenient way to animate UI elements with more control than CSS transitions provide. It also supports scrolling animations and reverse animations. For a time, Velocity was a popular choice for complex single-page app animations before widespread adoption of CSS and other libraries.",
        "category": "Frontend",
        "license": "MIT",
        "cost": "Free",
        "size": "0.03 MB",
        "version": "2.0.6",
        "stars": 17000,
        "last_updated": "2020",
        "os": "Cross-platform",
        "tags": [
            "Animation",
            "jQuery-plugin",
            "UI",
            "Tweening"
        ],
        "source": "http://velocityjs.org"
    },
    {
        "id": "revealjs",
        "name": "Reveal.js",
        "description": "Reveal.js is an open-source framework for creating interactive, touch-friendly slide presentations using HTML, CSS, and JavaScript. It allows you to write slides in HTML (with Markdown support) and comes with a variety of transition effects, slide backgrounds, and features like speaker notes and PDF export. Slides can navigate both horizontally and vertically, and it supports embedded media, code syntax highlighting, and even interactive fragments within slides. Reveal.js enables web developers to create presentation decks directly in a browser, which can be hosted and viewed anywhere without specialized software like PowerPoint.",
        "category": "Frontend",
        "license": "MIT",
        "cost": "Free",
        "size": "0.11 MB",
        "version": "4.4.0",
        "stars": 62000,
        "last_updated": "2022",
        "os": "Cross-platform",
        "tags": [
            "Presentation",
            "Slides",
            "HTML",
            "CSS3D"
        ],
        "source": "https://revealjs.com"
    },
    {
        "id": "ace-editor",
        "name": "Ace",
        "description": "Ace (Ajax.org Cloud9 Editor) is a standalone code editor written in JavaScript. It embeds a fully-featured code editor (like the one in VSCode or Sublime) into any web page. Ace supports syntax highlighting for dozens of languages, automatic indentation, themes, keybindings (Emacs, Vim), and large file handling. It powers many web-based IDEs and code playgrounds thanks to its flexibility and performance. Ace can be easily integrated into web applications to provide users with a rich editing experience (for example, editing code, configuration files, or other text content directly in the browser).",
        "category": "Frontend",
        "license": "BSD-3-Clause",
        "cost": "Free",
        "size": "1.4 MB",
        "version": "1.10.1",
        "stars": 25000,
        "last_updated": "2023",
        "os": "Cross-platform",
        "tags": [
            "Code Editor",
            "IDE",
            "Syntax Highlight",
            "Browser"
        ],
        "source": "https://ace.c9.io"
    },
    {
        "id": "monaco-editor",
        "name": "Monaco Editor",
        "description": "Monaco Editor is the code editor that powers Visual Studio Code, provided as a standalone library that can be embedded in web pages. It provides the same advanced features as VS Code’s editor: syntax highlighting for many languages, IntelliSense (auto-completion), theming, find/replace, and more. Monaco is built in TypeScript and is extremely extensible, allowing custom language definitions and behaviors. It’s used in many online coding environments (like VS Code for Web, StackBlitz, etc.) and is an excellent choice when a full-fledged code editing experience is needed in a browser-based application.",
        "category": "Frontend",
        "license": "MIT",
        "cost": "Free",
        "size": "5 MB",
        "version": "0.38.0",
        "stars": 33000,
        "last_updated": "2025",
        "os": "Cross-platform",
        "tags": [
            "Code Editor",
            "VSCode",
            "IntelliSense",
            "TypeScript"
        ],
        "source": "https://microsoft.github.io/monaco-editor"
    },
    {
        "id": "highlightjs",
        "name": "Highlight.js",
        "description": "Highlight.js is a popular syntax highlighting library for code blocks in web pages. It automatically detects the programming language of a code snippet (or you can specify the language) and applies syntax highlighting by wrapping code in styled <span> tags. It supports over 180 languages and comes with dozens of color themes. Often used in documentation sites, blogs, and forums, Highlight.js allows for client-side highlighting without additional server-side processing. It is lightweight and can be configured to include only desired languages to reduce its footprint.",
        "category": "Frontend",
        "license": "BSD-3-Clause",
        "cost": "Free",
        "size": "0.05 MB",
        "version": "11.7.0",
        "stars": 21000,
        "last_updated": "2023",
        "os": "Cross-platform",
        "tags": [
            "Syntax Highlighting",
            "Code",
            "Documentation",
            "Client-side"
        ],
        "source": "https://highlightjs.org"
    },
    {
        "id": "mathjax",
        "name": "MathJax",
        "description": "MathJax is a JavaScript library that displays mathematical notation in web browsers, using LaTeX, MathML, or AsciiMath notation. It typesets mathematics beautifully in HTML with CSS and, if needed, scalable vector graphics. MathJax is highly configurable and works across all modern browsers (and even older ones), ensuring consistent display of formulas. It is commonly used in educational and scientific web platforms (like Stack Exchange, Moodle, etc.), allowing authors to include complex equations that render correctly for readers without them needing any plugins.",
        "category": "Frontend",
        "license": "Apache-2.0",
        "cost": "Free",
        "size": "2.7 MB",
        "version": "3.2.2",
        "stars": 9400,
        "last_updated": "2022",
        "os": "Cross-platform",
        "tags": [
            "Math",
            "LaTeX",
            "Typesetting",
            "Education"
        ],
        "source": "https://www.mathjax.org"
    },
    {
        "id": "chartist",
        "name": "Chartist",
        "description": "Chartist.js is a simple, responsive, and lightweight charting library that uses SVG to render charts. It aims to offer cool-looking charts out of the box with sensible defaults, while allowing easy customization via CSS and JavaScript options. Chartist supports line, bar, pie, and other basic chart types, and automatically adapts to different screen sizes (responsive). While not as feature-rich as larger chart libraries, Chartist’s focus on responsiveness and small size makes it ideal for dashboards or reports where only basic charts are needed without a large library overhead.",
        "category": "Frontend",
        "license": "MIT",
        "cost": "Free",
        "size": "0.02 MB",
        "version": "0.11.4",
        "stars": 13000,
        "last_updated": "2018",
        "os": "Cross-platform",
        "tags": [
            "Charts",
            "SVG",
            "Responsive",
            "Lightweight"
        ],
        "source": "https://gionkunz.github.io/chartist-js"
    },
    {
        "id": "svelte",
        "name": "Svelte",
        "description": "Svelte is a modern frontend JavaScript framework that shifts the work from the browser to the build step. Unlike traditional frameworks like React or Vue, Svelte compiles your code into highly efficient vanilla JavaScript at build time. This results in faster runtime performance, smaller bundles, and zero virtual DOM. Svelte is ideal for building highly interactive and performant UIs with minimal overhead.",
        "category": "Frontend",
        "license": "MIT",
        "cost": "Free",
        "size": "2 MB",
        "version": "4.2.9",
        "stars": 75000,
        "last_updated": "Updated on 05/11/2024",
        "os": "Cross-platform",
        "tags": [
            "JavaScript Framework",
            "No Virtual DOM",
            "Compile-time",
            "Performance",
            "SPA"
        ],
        "source": "https://svelte.dev/"
    },
    {
        "id": "qwik",
        "name": "Qwik",
        "description": "Qwik is a next-generation JavaScript framework designed for instant-loading web applications. It uses a novel approach called 'resumability' that allows server-rendered HTML to remain interactive without rehydration. Qwik delivers exceptional performance for dynamic sites, making it ideal for content-heavy pages that need SEO and responsiveness.",
        "category": "Frontend",
        "license": "MIT",
        "cost": "Free",
        "size": "1.5 MB",
        "version": "1.3.1",
        "stars": 19000,
        "last_updated": "Updated on 05/11/2024",
        "os": "Cross-platform",
        "tags": [
            "Resumability",
            "Instant Load",
            "SEO",
            "JavaScript Framework",
            "Hydration-free"
        ],
        "source": "https://qwik.builder.io/"
    },
    {
        "id": "lit",
        "name": "Lit",
        "description": "Lit is a lightweight library for building fast, reusable web components. Created by the Polymer team at Google, Lit uses standard web components and reactive templates to simplify UI development. It provides excellent performance, small bundle sizes, and native browser support without relying on heavy abstractions.",
        "category": "Frontend",
        "license": "BSD-3-Clause",
        "cost": "Free",
        "size": "1.3 MB",
        "version": "3.1.2",
        "stars": 14000,
        "last_updated": "Updated on 05/11/2024",
        "os": "Cross-platform",
        "tags": [
            "Web Components",
            "Templates",
            "Reactive",
            "Lightweight",
            "Standards-based"
        ],
        "source": "https://lit.dev/"
    },
    {
        "id": "solid-js",
        "name": "SolidJS",
        "description": "SolidJS is a highly performant declarative JavaScript library for building UIs. It offers fine-grained reactivity with no virtual DOM, resulting in excellent rendering speed. SolidJS supports JSX syntax, a familiar developer experience, and reactive primitives that enable predictable updates and minimal overhead.",
        "category": "Frontend",
        "license": "MIT",
        "cost": "Free",
        "size": "3 MB",
        "version": "1.8.5",
        "stars": 27000,
        "last_updated": "Updated on 05/11/2024",
        "os": "Cross-platform",
        "tags": [
            "No Virtual DOM",
            "Reactivity",
            "JSX",
            "Fast Rendering",
            "Declarative UI"
        ],
        "source": "https://www.solidjs.com/"
    },
    {
        "id": "marko",
        "name": "Marko",
        "description": "Marko is a declarative, component-based JavaScript framework designed for high-performance server-side rendering (SSR) and partial hydration. Developed by eBay, Marko achieves excellent time-to-interactive and progressive hydration, making it ideal for building modern eCommerce and dynamic applications.",
        "category": "Frontend",
        "license": "MIT",
        "cost": "Free",
        "size": "3 MB",
        "version": "5.28.0",
        "stars": 13000,
        "last_updated": "Updated on 05/11/2024",
        "os": "Cross-platform",
        "tags": [
            "Server-side Rendering",
            "Hydration",
            "Components",
            "Progressive Enhancement",
            "eCommerce"
        ],
        "source": "https://markojs.com/"
    },
    {
        "id": "alpinejs",
        "name": "Alpine.js",
        "description": "Alpine.js is a minimal JavaScript framework for composing behavior directly in your HTML markup. It provides reactivity and declarative bindings in a syntax similar to Vue, but without requiring a full frontend build system. Alpine is perfect for adding interactivity to server-rendered applications or static sites with minimal overhead.",
        "category": "Frontend",
        "license": "MIT",
        "cost": "Free",
        "size": "10 KB",
        "version": "3.13.5",
        "stars": 26000,
        "last_updated": "Updated on 05/11/2024",
        "os": "Cross-platform",
        "tags": [
            "Minimal",
            "Declarative",
            "Reactive",
            "HTML-first",
            "JavaScript"
        ],
        "source": "https://alpinejs.dev/"
    },
    {
        "id": "petite-vue",
        "name": "Petite Vue",
        "description": "Petite Vue is a lightweight subset of Vue.js optimized for progressive enhancement. It allows developers to add interactivity to static HTML with minimal configuration and zero build steps. Petite Vue is ideal for static sites, documentation pages, or landing pages where full SPA frameworks are overkill.",
        "category": "Frontend",
        "license": "MIT",
        "cost": "Free",
        "size": "5 KB",
        "version": "0.4.1",
        "stars": 6200,
        "last_updated": "Updated on 05/11/2024",
        "os": "Cross-platform",
        "tags": [
            "Vue",
            "Progressive Enhancement",
            "Lightweight",
            "HTML Interactivity",
            "Static Sites"
        ],
        "source": "https://github.com/vuejs/petite-vue"
    },
    {
        "id": "preact",
        "name": "Preact",
        "description": "Preact is a fast 3KB alternative to React with the same modern API and component model. It delivers near-instant performance for SPAs while supporting React compatibility through the preact/compat module. Preact is widely used in embedded UIs, PWAs, and performance-critical frontend applications.",
        "category": "Frontend",
        "license": "MIT",
        "cost": "Free",
        "size": "3 KB",
        "version": "10.20.1",
        "stars": 36000,
        "last_updated": "Updated on 05/11/2024",
        "os": "Cross-platform",
        "tags": [
            "React Alternative",
            "Lightweight",
            "Performance",
            "SPA",
            "Compatibility"
        ],
        "source": "https://preactjs.com/"
    },
    {
        "id": "hyperapp",
        "name": "Hyperapp",
        "description": "Hyperapp is a tiny JavaScript library for building web interfaces with a functional approach. It combines a declarative view engine with a state management system in under 1 KB. Inspired by The Elm Architecture, Hyperapp encourages simplicity, immutability, and minimalism for small-to-medium projects.",
        "category": "Frontend",
        "license": "MIT",
        "cost": "Free",
        "size": "1 KB",
        "version": "2.0.15",
        "stars": 19000,
        "last_updated": "Updated on 05/11/2024",
        "os": "Cross-platform",
        "tags": [
            "Tiny Framework",
            "Functional",
            "Minimal",
            "Elm-style",
            "Single Page App"
        ],
        "source": "https://hyperapp.dev/"
    },
    {
        "id": "htmx",
        "name": "htmx",
        "description": "htmx is a lightweight JavaScript library that enables server-driven web development using HTML attributes. It allows making AJAX requests, triggering events, and replacing HTML fragments without writing JavaScript. htmx is ideal for enhancing traditional server-rendered pages with modern interactivity and partial updates.",
        "category": "Frontend",
        "license": "BSD-2-Clause",
        "cost": "Free",
        "size": "10 KB",
        "version": "1.9.5",
        "stars": 18000,
        "last_updated": "Updated on 05/11/2024",
        "os": "Cross-platform",
        "tags": [
            "HTML-first",
            "AJAX",
            "Progressive Enhancement",
            "No Build Step",
            "Server-driven"
        ],
        "source": "https://htmx.org/"
    },
    {
        "id": "nano-jsx",
        "name": "Nano JSX",
        "description": "Nano JSX is a 1KB React-like library for building UI components with JSX. It is optimized for speed, minimalism, and modern JavaScript environments such as Deno, Bun, and Node.js. Nano JSX supports server-side rendering (SSR) and is ideal for edge computing and ultra-lightweight frontend applications.",
        "category": "Frontend",
        "license": "MIT",
        "cost": "Free",
        "size": "1 KB",
        "version": "0.0.31",
        "stars": 1400,
        "last_updated": "Updated on 05/11/2024",
        "os": "Cross-platform",
        "tags": [
            "JSX",
            "Lightweight",
            "React Alternative",
            "SSR",
            "Deno"
        ],
        "source": "https://nanojsx.io/"
    },
    {
        "id": "reflexjs",
        "name": "ReflexJS",
        "description": "ReflexJS is a modern React-based framework focused on building performant websites with styled-components and MDX. It comes with a built-in design system, page builder support, and integrations for CMSs and eCommerce platforms. Ideal for startups building fast, customizable marketing and documentation websites.",
        "category": "Frontend",
        "license": "MIT",
        "cost": "Free",
        "size": "4 MB",
        "version": "1.0.0",
        "stars": 1100,
        "last_updated": "Updated on 05/11/2024",
        "os": "Cross-platform",
        "tags": [
            "React",
            "MDX",
            "Design System",
            "Static Site",
            "Customizable"
        ],
        "source": "https://reflexjs.org/"
    },
    {
        "id": "vitepress",
        "name": "VitePress",
        "description": "VitePress is a static site generator powered by Vite and Vue. It offers lightning-fast hot module replacement and minimal configuration for building documentation websites. VitePress supports Markdown with Vue components, custom theming, and deploys easily on platforms like GitHub Pages and Netlify.",
        "category": "Frontend",
        "license": "MIT",
        "cost": "Free",
        "size": "2 MB",
        "version": "1.0.0",
        "stars": 11000,
        "last_updated": "Updated on 05/11/2024",
        "os": "Cross-platform",
        "tags": [
            "Vue",
            "Static Site Generator",
            "Markdown",
            "Vite",
            "Documentation"
        ],
        "source": "https://vitepress.vuejs.org/"
    },
    {
        "id": "eleventy",
        "name": "Eleventy",
        "description": "Eleventy (11ty) is a simple and flexible static site generator that transforms Markdown, HTML, and templates into fast websites. It supports multiple template languages like Nunjucks, Liquid, and Handlebars, and is known for its speed and zero-config philosophy. Ideal for blogs, portfolios, and JAMstack sites.",
        "category": "Frontend",
        "license": "MIT",
        "cost": "Free",
        "size": "3 MB",
        "version": "2.0.1",
        "stars": 17000,
        "last_updated": "Updated on 05/11/2024",
        "os": "Cross-platform",
        "tags": [
            "Static Site Generator",
            "Markdown",
            "Templates",
            "JAMstack",
            "Blogs"
        ],
        "source": "https://www.11ty.dev/"
    },
    {
        "id": "astro",
        "name": "Astro",
        "description": "Astro is a modern static site builder designed for performance and flexibility. It enables developers to use multiple frontend frameworks (React, Vue, Svelte, etc.) together in one project. Astro renders components to static HTML by default and loads JavaScript only as needed, delivering optimal performance for modern websites.",
        "category": "Frontend",
        "license": "MIT",
        "cost": "Free",
        "size": "4 MB",
        "version": "4.3.1",
        "stars": 41000,
        "last_updated": "Updated on 05/11/2024",
        "os": "Cross-platform",
        "tags": [
            "Static Site",
            "Framework Agnostic",
            "Performance",
            "JAMstack",
            "Partial Hydration"
        ],
        "source": "https://astro.build/"
    },
    {
        "id": "gridsome",
        "name": "Gridsome",
        "description": "Gridsome is a Vue-powered static site generator that uses GraphQL for data sourcing and builds blazing-fast websites. It is ideal for JAMstack development and SEO-optimized sites. Gridsome supports content from Markdown, CMSs, and APIs, and compiles pages with automatic code splitting and progressive images.",
        "category": "Frontend",
        "license": "MIT",
        "cost": "Free",
        "size": "5 MB",
        "version": "0.7.28",
        "stars": 8500,
        "last_updated": "Updated on 05/11/2024",
        "os": "Cross-platform",
        "tags": [
            "Vue",
            "GraphQL",
            "Static Site Generator",
            "JAMstack",
            "SEO"
        ],
        "source": "https://gridsome.org/"
    },
    {
        "id": "docusaurus",
        "name": "Docusaurus",
        "description": "Docusaurus is a documentation site generator built by Facebook. It uses React, Markdown, and a plugin system to create optimized, SEO-friendly documentation sites with versioning, search, and i18n support. Popular among open-source and enterprise projects, Docusaurus simplifies technical writing with built-in theming and deployment.",
        "category": "Frontend",
        "license": "MIT",
        "cost": "Free",
        "size": "6 MB",
        "version": "3.2.1",
        "stars": 51000,
        "last_updated": "Updated on 05/11/2024",
        "os": "Cross-platform",
        "tags": [
            "Documentation",
            "React",
            "Markdown",
            "SEO",
            "Versioning"
        ],
        "source": "https://docusaurus.io/"
    },
    {
        "id": "next-mdx-remote",
        "name": "next-mdx-remote",
        "description": "next-mdx-remote is a package that allows you to render MDX content from remote sources in Next.js applications. It provides flexibility to handle dynamic content like blog posts or documentation pages from headless CMSs or APIs. Great for combining Markdown content with interactive components in server-rendered or static pages.",
        "category": "Frontend",
        "license": "MIT",
        "cost": "Free",
        "size": "1 MB",
        "version": "4.2.0",
        "stars": 2200,
        "last_updated": "Updated on 05/11/2024",
        "os": "Cross-platform",
        "tags": [
            "MDX",
            "Next.js",
            "Markdown",
            "Dynamic Content",
            "CMS Integration"
        ],
        "source": "https://github.com/hashicorp/next-mdx-remote"
    },
    {
        "id": "plasmic",
        "name": "Plasmic",
        "description": "Plasmic is a visual builder for React and headless CMSs that enables developers and designers to collaborate on frontend UIs. It supports full-code export, integrations with Next.js, Gatsby, and Remix, and delivers production-grade components that are themeable and performant. Used to accelerate web app and landing page development.",
        "category": "Frontend",
        "license": "Commercial",
        "cost": "Free / Paid",
        "size": "Hosted / CLI",
        "version": "0.99.2",
        "stars": 5000,
        "last_updated": "Updated on 05/11/2024",
        "os": "Cross-platform",
        "tags": [
            "Visual Builder",
            "React",
            "Design to Code",
            "CMS",
            "Gatsby"
        ],
        "source": "https://www.plasmic.app/"
    },
    {
        "id": "mdx-deck",
        "name": "MDX Deck",
        "description": "MDX Deck is a presentation tool built with MDX and React. It allows developers to write slide decks using Markdown and embed React components for interactivity. It's ideal for tech talks, documentation-based demos, and developer presentations, offering themes, transitions, and export options.",
        "category": "Frontend",
        "license": "MIT",
        "cost": "Free",
        "size": "2 MB",
        "version": "5.1.0",
        "stars": 11000,
        "last_updated": "Updated on 05/11/2024",
        "os": "Cross-platform",
        "tags": [
            "Presentations",
            "MDX",
            "React",
            "Slides",
            "Developer Tools"
        ],
        "source": "https://github.com/jxnblk/mdx-deck"
    },
    {
        "id": "nano-jsx",
        "name": "Nano JSX",
        "description": "Nano JSX is a 1KB React-like library for building UI components with JSX. It is optimized for speed, minimalism, and modern JavaScript environments such as Deno, Bun, and Node.js. Nano JSX supports server-side rendering (SSR) and is ideal for edge computing and ultra-lightweight frontend applications.",
        "category": "Frontend",
        "license": "MIT",
        "cost": "Free",
        "size": "1 KB",
        "version": "0.0.31",
        "stars": 1400,
        "last_updated": "Updated on 05/11/2024",
        "os": "Cross-platform",
        "tags": [
            "JSX",
            "Lightweight",
            "React Alternative",
            "SSR",
            "Deno"
        ],
        "source": "https://nanojsx.io/"
    },
    {
        "id": "reflexjs",
        "name": "ReflexJS",
        "description": "ReflexJS is a modern React-based framework focused on building performant websites with styled-components and MDX. It comes with a built-in design system, page builder support, and integrations for CMSs and eCommerce platforms. Ideal for startups building fast, customizable marketing and documentation websites.",
        "category": "Frontend",
        "license": "MIT",
        "cost": "Free",
        "size": "4 MB",
        "version": "1.0.0",
        "stars": 1100,
        "last_updated": "Updated on 05/11/2024",
        "os": "Cross-platform",
        "tags": [
            "React",
            "MDX",
            "Design System",
            "Static Site",
            "Customizable"
        ],
        "source": "https://reflexjs.org/"
    },
    {
        "id": "vitepress",
        "name": "VitePress",
        "description": "VitePress is a static site generator powered by Vite and Vue. It offers lightning-fast hot module replacement and minimal configuration for building documentation websites. VitePress supports Markdown with Vue components, custom theming, and deploys easily on platforms like GitHub Pages and Netlify.",
        "category": "Frontend",
        "license": "MIT",
        "cost": "Free",
        "size": "2 MB",
        "version": "1.0.0",
        "stars": 11000,
        "last_updated": "Updated on 05/11/2024",
        "os": "Cross-platform",
        "tags": [
            "Vue",
            "Static Site Generator",
            "Markdown",
            "Vite",
            "Documentation"
        ],
        "source": "https://vitepress.vuejs.org/"
    },
    {
        "id": "eleventy",
        "name": "Eleventy",
        "description": "Eleventy (11ty) is a simple and flexible static site generator that transforms Markdown, HTML, and templates into fast websites. It supports multiple template languages like Nunjucks, Liquid, and Handlebars, and is known for its speed and zero-config philosophy. Ideal for blogs, portfolios, and JAMstack sites.",
        "category": "Frontend",
        "license": "MIT",
        "cost": "Free",
        "size": "3 MB",
        "version": "2.0.1",
        "stars": 17000,
        "last_updated": "Updated on 05/11/2024",
        "os": "Cross-platform",
        "tags": [
            "Static Site Generator",
            "Markdown",
            "Templates",
            "JAMstack",
            "Blogs"
        ],
        "source": "https://www.11ty.dev/"
    },
    {
        "id": "astro",
        "name": "Astro",
        "description": "Astro is a modern static site builder designed for performance and flexibility. It enables developers to use multiple frontend frameworks (React, Vue, Svelte, etc.) together in one project. Astro renders components to static HTML by default and loads JavaScript only as needed, delivering optimal performance for modern websites.",
        "category": "Frontend",
        "license": "MIT",
        "cost": "Free",
        "size": "4 MB",
        "version": "4.3.1",
        "stars": 41000,
        "last_updated": "Updated on 05/11/2024",
        "os": "Cross-platform",
        "tags": [
            "Static Site",
            "Framework Agnostic",
            "Performance",
            "JAMstack",
            "Partial Hydration"
        ],
        "source": "https://astro.build/"
    },
    {
        "id": "gridsome",
        "name": "Gridsome",
        "description": "Gridsome is a Vue-powered static site generator that uses GraphQL for data sourcing and builds blazing-fast websites. It is ideal for JAMstack development and SEO-optimized sites. Gridsome supports content from Markdown, CMSs, and APIs, and compiles pages with automatic code splitting and progressive images.",
        "category": "Frontend",
        "license": "MIT",
        "cost": "Free",
        "size": "5 MB",
        "version": "0.7.28",
        "stars": 8500,
        "last_updated": "Updated on 05/11/2024",
        "os": "Cross-platform",
        "tags": [
            "Vue",
            "GraphQL",
            "Static Site Generator",
            "JAMstack",
            "SEO"
        ],
        "source": "https://gridsome.org/"
    },
    {
        "id": "docusaurus",
        "name": "Docusaurus",
        "description": "Docusaurus is a documentation site generator built by Facebook. It uses React, Markdown, and a plugin system to create optimized, SEO-friendly documentation sites with versioning, search, and i18n support. Popular among open-source and enterprise projects, Docusaurus simplifies technical writing with built-in theming and deployment.",
        "category": "Frontend",
        "license": "MIT",
        "cost": "Free",
        "size": "6 MB",
        "version": "3.2.1",
        "stars": 51000,
        "last_updated": "Updated on 05/11/2024",
        "os": "Cross-platform",
        "tags": [
            "Documentation",
            "React",
            "Markdown",
            "SEO",
            "Versioning"
        ],
        "source": "https://docusaurus.io/"
    },
    {
        "id": "next-mdx-remote",
        "name": "next-mdx-remote",
        "description": "next-mdx-remote is a package that allows you to render MDX content from remote sources in Next.js applications. It provides flexibility to handle dynamic content like blog posts or documentation pages from headless CMSs or APIs. Great for combining Markdown content with interactive components in server-rendered or static pages.",
        "category": "Frontend",
        "license": "MIT",
        "cost": "Free",
        "size": "1 MB",
        "version": "4.2.0",
        "stars": 2200,
        "last_updated": "Updated on 05/11/2024",
        "os": "Cross-platform",
        "tags": [
            "MDX",
            "Next.js",
            "Markdown",
            "Dynamic Content",
            "CMS Integration"
        ],
        "source": "https://github.com/hashicorp/next-mdx-remote"
    },
    {
        "id": "plasmic",
        "name": "Plasmic",
        "description": "Plasmic is a visual builder for React and headless CMSs that enables developers and designers to collaborate on frontend UIs. It supports full-code export, integrations with Next.js, Gatsby, and Remix, and delivers production-grade components that are themeable and performant. Used to accelerate web app and landing page development.",
        "category": "Frontend",
        "license": "Commercial",
        "cost": "Free / Paid",
        "size": "Hosted / CLI",
        "version": "0.99.2",
        "stars": 5000,
        "last_updated": "Updated on 05/11/2024",
        "os": "Cross-platform",
        "tags": [
            "Visual Builder",
            "React",
            "Design to Code",
            "CMS",
            "Gatsby"
        ],
        "source": "https://www.plasmic.app/"
    },
    {
        "id": "mdx-deck",
        "name": "MDX Deck",
        "description": "MDX Deck is a presentation tool built with MDX and React. It allows developers to write slide decks using Markdown and embed React components for interactivity. It's ideal for tech talks, documentation-based demos, and developer presentations, offering themes, transitions, and export options.",
        "category": "Frontend",
        "license": "MIT",
        "cost": "Free",
        "size": "2 MB",
        "version": "5.1.0",
        "stars": 11000,
        "last_updated": "Updated on 05/11/2024",
        "os": "Cross-platform",
        "tags": [
            "Presentations",
            "MDX",
            "React",
            "Slides",
            "Developer Tools"
        ],
        "source": "https://github.com/jxnblk/mdx-deck"
    },
    {
        "id": "vanilla-extract",
        "name": "Vanilla Extract",
        "description": "Vanilla Extract is a zero-runtime CSS-in-TypeScript framework. It allows you to write type-safe styles with full theme support, scoped class generation, and framework-agnostic output. Designed for scalability, it's ideal for teams using TypeScript to build large, maintainable design systems.",
        "category": "Frontend",
        "license": "MIT",
        "cost": "Free",
        "size": "1 MB",
        "version": "1.13.3",
        "stars": 8700,
        "last_updated": "Updated on 05/11/2024",
        "os": "Cross-platform",
        "tags": [
            "CSS-in-TypeScript",
            "Themeable",
            "Zero Runtime",
            "Design Systems",
            "Type-safe"
        ],
        "source": "https://vanilla-extract.style/"
    },
    {
        "id": "stitches",
        "name": "Stitches",
        "description": "Stitches is a modern CSS-in-JS library focused on performance and developer ergonomics. It features zero-runtime, atomic CSS output, theming, variants, and server-side rendering support. Stitches integrates easily with React and TypeScript and is well-suited for design systems and component libraries.",
        "category": "Frontend",
        "license": "MIT",
        "cost": "Free",
        "size": "800 KB",
        "version": "1.2.8",
        "stars": 7300,
        "last_updated": "Updated on 05/11/2024",
        "os": "Cross-platform",
        "tags": [
            "CSS-in-JS",
            "Theming",
            "SSR",
            "Atomic CSS",
            "Variants"
        ],
        "source": "https://stitches.dev/"
    },
    {
        "id": "emotion",
        "name": "Emotion",
        "description": "Emotion is a powerful and flexible CSS-in-JS library that allows developers to style components using JavaScript or TypeScript. It supports both styled components and the `css` prop, offering full control over styles, theming, and class composition. Emotion works well in both server and client environments.",
        "category": "Frontend",
        "license": "MIT",
        "cost": "Free",
        "size": "1.5 MB",
        "version": "11.11.3",
        "stars": 17000,
        "last_updated": "Updated on 05/11/2024",
        "os": "Cross-platform",
        "tags": [
            "CSS-in-JS",
            "React",
            "Styled Components",
            "Theming",
            "SSR"
        ],
        "source": "https://emotion.sh/"
    },
    {
        "id": "jotai",
        "name": "Jotai",
        "description": "Jotai is a minimalistic atomic state management library for React. It provides a simple, scalable, and primitive-based API for managing application state without boilerplate. Jotai supports derived atoms, async atoms, and React Suspense integration, making it perfect for modern, lightweight React apps.",
        "category": "Frontend",
        "license": "MIT",
        "cost": "Free",
        "size": "750 KB",
        "version": "2.3.4",
        "stars": 15000,
        "last_updated": "Updated on 05/11/2024",
        "os": "Cross-platform",
        "tags": [
            "State Management",
            "React",
            "Atoms",
            "Suspense",
            "Minimal"
        ],
        "source": "https://jotai.org/"
    },
    {
        "id": "valtio",
        "name": "Valtio",
        "description": "Valtio is a proxy-based state management library for React that allows direct mutation of state. It uses JavaScript proxies to track changes and trigger re-renders with minimal effort. Valtio supports derived values, snapshots, and works with concurrent rendering in React 18.",
        "category": "Frontend",
        "license": "MIT",
        "cost": "Free",
        "size": "600 KB",
        "version": "1.14.0",
        "stars": 13000,
        "last_updated": "Updated on 05/11/2024",
        "os": "Cross-platform",
        "tags": [
            "State Management",
            "Proxies",
            "React",
            "Minimal",
            "Reactive"
        ],
        "source": "https://valtio.pmnd.rs/"
    },
    {
        "id": "zustand",
        "name": "Zustand",
        "description": "Zustand is a fast and simple state management library built by the creators of Jotai and React Spring. It features a minimal API, built-in persistence, and no boilerplate. Zustand is ideal for managing global or local component state in scalable React applications without using context or reducers.",
        "category": "Frontend",
        "license": "MIT",
        "cost": "Free",
        "size": "850 KB",
        "version": "4.5.2",
        "stars": 36000,
        "last_updated": "Updated on 05/11/2024",
        "os": "Cross-platform",
        "tags": [
            "React",
            "State Management",
            "Global State",
            "Minimal",
            "Hooks"
        ],
        "source": "https://zustand-demo.pmnd.rs/"
    },
    {
        "id": "effector",
        "name": "Effector",
        "description": "Effector is a powerful and reactive state manager for building predictable applications. It supports TypeScript out of the box, has first-class stores, and features a declarative API for complex state interactions. Effector is framework-agnostic and supports both React and Vanilla JS environments.",
        "category": "Frontend",
        "license": "MIT",
        "cost": "Free",
        "size": "1.2 MB",
        "version": "22.4.2",
        "stars": 4500,
        "last_updated": "Updated on 05/11/2024",
        "os": "Cross-platform",
        "tags": [
            "State Manager",
            "Reactive",
            "TypeScript",
            "Predictable",
            "Stores"
        ],
        "source": "https://effector.dev/"
    },
    {
        "id": "xstate",
        "name": "XState",
        "description": "XState is a state machine and statechart library for JavaScript and TypeScript applications. It models complex UI logic using finite state machines and hierarchical statecharts, which provide predictability and maintainability. XState works across frontend frameworks and integrates well with React, Vue, and Svelte.",
        "category": "Frontend",
        "license": "MIT",
        "cost": "Free",
        "size": "2 MB",
        "version": "5.12.1",
        "stars": 25000,
        "last_updated": "Updated on 05/11/2024",
        "os": "Cross-platform",
        "tags": [
            "Statecharts",
            "FSM",
            "React",
            "Logic Modeling",
            "Predictable"
        ],
        "source": "https://xstate.js.org/"
    },
    {
        "id": "nanostores",
        "name": "Nano Stores",
        "description": "Nano Stores is a tiny state manager for React, Preact, and Vanilla JS applications. It offers atomic state structures with efficient updates and low memory footprint. With support for persistent storage, lazy loading, and TypeScript, Nano Stores is ideal for modern SPAs that require performance and modularity.",
        "category": "Frontend",
        "license": "MIT",
        "cost": "Free",
        "size": "350 KB",
        "version": "0.9.3",
        "stars": 2700,
        "last_updated": "Updated on 05/11/2024",
        "os": "Cross-platform",
        "tags": [
            "Tiny",
            "State Management",
            "Atomic",
            "React",
            "Performance"
        ],
        "source": "https://nanostores.org/"
    },
    {
        "id": "storeon",
        "name": "Storeon",
        "description": "Storeon is a tiny event-based state manager with a size of only 173 bytes. It is framework-agnostic and supports Redux-like patterns without the boilerplate. Storeon includes plugins for persistence, routing, and logging, and is ideal for small apps or projects where simplicity and performance are critical.",
        "category": "Frontend",
        "license": "MIT",
        "cost": "Free",
        "size": "173 B",
        "version": "3.1.5",
        "stars": 1700,
        "last_updated": "Updated on 05/11/2024",
        "os": "Cross-platform",
        "tags": [
            "Event-based",
            "Tiny",
            "Redux Alternative",
            "Plugin Support",
            "Lightweight"
        ],
        "source": "https://github.com/storeon/storeon"
    },
    {
        "id": "react-query",
        "name": "React Query",
        "description": "React Query is a data-fetching and state management library for React that simplifies handling remote data. It provides powerful caching, synchronization, pagination, and background updating capabilities. React Query is ideal for frontend apps that depend heavily on server data and asynchronous operations.",
        "category": "Frontend",
        "license": "MIT",
        "cost": "Free",
        "size": "2 MB",
        "version": "5.27.2",
        "stars": 40000,
        "last_updated": "Updated on 05/11/2024",
        "os": "Cross-platform",
        "tags": [
            "React",
            "Data Fetching",
            "Caching",
            "Async",
            "API"
        ],
        "source": "https://tanstack.com/query/latest"
    },
    {
        "id": "swr",
        "name": "SWR",
        "description": "SWR (Stale-While-Revalidate) is a React data-fetching library developed by Vercel. It focuses on simplicity and speed, using caching and revalidation strategies to keep UI in sync with server state. SWR is ideal for stateless frontend applications and integrates seamlessly with Next.js.",
        "category": "Frontend",
        "license": "MIT",
        "cost": "Free",
        "size": "1.5 MB",
        "version": "2.2.2",
        "stars": 28000,
        "last_updated": "Updated on 05/11/2024",
        "os": "Cross-platform",
        "tags": [
            "Data Fetching",
            "Caching",
            "React",
            "Revalidation",
            "Next.js"
        ],
        "source": "https://swr.vercel.app/"
    },
    {
        "id": "axios",
        "name": "Axios",
        "description": "Axios is a popular promise-based HTTP client for the browser and Node.js. It simplifies making HTTP requests and handling responses, with support for interceptors, cancellation, and automatic JSON parsing. Axios is widely used in frontend frameworks like React, Vue, and Angular for API communication.",
        "category": "Frontend",
        "license": "MIT",
        "cost": "Free",
        "size": "2 MB",
        "version": "1.6.0",
        "stars": 102000,
        "last_updated": "Updated on 05/11/2024",
        "os": "Cross-platform",
        "tags": [
            "HTTP",
            "API",
            "Promise",
            "Request",
            "Frontend"
        ],
        "source": "https://axios-http.com/"
    },
    {
        "id": "ky",
        "name": "Ky",
        "description": "Ky is a tiny and elegant HTTP client built on top of the native Fetch API. It provides a simpler API, auto retries, timeout support, and JSON handling out of the box. Ky is ideal for frontend projects where size and simplicity matter, offering a modern alternative to Axios.",
        "category": "Frontend",
        "license": "MIT",
        "cost": "Free",
        "size": "600 KB",
        "version": "1.1.4",
        "stars": 9500,
        "last_updated": "Updated on 05/11/2024",
        "os": "Cross-platform",
        "tags": [
            "HTTP",
            "Fetch",
            "Tiny",
            "Promise",
            "API Client"
        ],
        "source": "https://github.com/sindresorhus/ky"
    },
    {
        "id": "react-hook-form",
        "name": "React Hook Form",
        "description": "React Hook Form is a performant form validation library for React. It reduces re-renders, integrates with UI libraries, and supports schema validation with libraries like Yup and Zod. Designed with simplicity and performance in mind, it's widely adopted for building scalable, accessible forms.",
        "category": "Frontend",
        "license": "MIT",
        "cost": "Free",
        "size": "1.2 MB",
        "version": "7.51.3",
        "stars": 42000,
        "last_updated": "Updated on 05/11/2024",
        "os": "Cross-platform",
        "tags": [
            "Forms",
            "Validation",
            "React",
            "Accessibility",
            "Performance"
        ],
        "source": "https://react-hook-form.com/"
    },
    {
        "id": "formik",
        "name": "Formik",
        "description": "Formik is a form library for React that helps with managing form state, validation, and submission. It supports integration with Yup for schema validation and works well with controlled and uncontrolled form components. Formik is ideal for building robust, large-scale forms in enterprise applications.",
        "category": "Frontend",
        "license": "MIT",
        "cost": "Free",
        "size": "1.6 MB",
        "version": "2.4.4",
        "stars": 33000,
        "last_updated": "Updated on 05/11/2024",
        "os": "Cross-platform",
        "tags": [
            "Forms",
            "Validation",
            "React",
            "Schema",
            "Enterprise"
        ],
        "source": "https://formik.org/"
    },
    {
        "id": "yup",
        "name": "Yup",
        "description": "Yup is a JavaScript schema builder for value parsing and validation. It is commonly used with React forms and libraries like Formik and React Hook Form. Yup allows defining complex validation rules with a fluent API and supports asynchronous and conditional logic.",
        "category": "Frontend",
        "license": "MIT",
        "cost": "Free",
        "size": "700 KB",
        "version": "1.3.0",
        "stars": 22000,
        "last_updated": "Updated on 05/11/2024",
        "os": "Cross-platform",
        "tags": [
            "Validation",
            "Schema",
            "Forms",
            "JavaScript",
            "Fluent API"
        ],
        "source": "https://github.com/jquense/yup"
    },
    {
        "id": "zod",
        "name": "Zod",
        "description": "Zod is a TypeScript-first schema declaration and validation library. It provides a declarative and immutable API, with strong TypeScript inference. Zod is ideal for form validation, API input parsing, and type-safe data handling across frontend and backend codebases.",
        "category": "Frontend",
        "license": "MIT",
        "cost": "Free",
        "size": "800 KB",
        "version": "3.23.4",
        "stars": 24000,
        "last_updated": "Updated on 05/11/2024",
        "os": "Cross-platform",
        "tags": [
            "TypeScript",
            "Validation",
            "Schema",
            "Forms",
            "Safe Parsing"
        ],
        "source": "https://zod.dev/"
    },
    {
        "id": "react-final-form",
        "name": "React Final Form",
        "description": "React Final Form is a form state management library for React. Built on top of Final Form, it provides performance-optimized form handling and declarative APIs. It supports subscription-based rendering, validation, and field-level customization, making it a great choice for complex form flows.",
        "category": "Frontend",
        "license": "MIT",
        "cost": "Free",
        "size": "1.4 MB",
        "version": "6.5.9",
        "stars": 7300,
        "last_updated": "Updated on 05/11/2024",
        "os": "Cross-platform",
        "tags": [
            "Forms",
            "React",
            "Final Form",
            "Validation",
            "Custom Fields"
        ],
        "source": "https://final-form.org/react"
    },
    {
        "id": "vee-validate",
        "name": "VeeValidate",
        "description": "VeeValidate is a form validation framework for Vue.js. It offers flexible validation rules, schema-based validation with Yup or Zod, and integration with Vue’s composition API. VeeValidate supports custom components and internationalization, making it a robust solution for Vue form validation.",
        "category": "Frontend",
        "license": "MIT",
        "cost": "Free",
        "size": "1.5 MB",
        "version": "4.12.1",
        "stars": 11000,
        "last_updated": "Updated on 05/11/2024",
        "os": "Cross-platform",
        "tags": [
            "Vue",
            "Forms",
            "Validation",
            "Composition API",
            "i18n"
        ],
        "source": "https://vee-validate.logaretm.com/"
    },
    {
        "id": "vuelidate",
        "name": "Vuelidate",
        "description": "Vuelidate is a model-based validation library for Vue.js. It provides reactive validation logic with minimal boilerplate and supports both synchronous and asynchronous rules. Vuelidate integrates well with Vue 2 and Vue 3 and is a preferred choice for developers who want simple, maintainable form validation.",
        "category": "Frontend",
        "license": "MIT",
        "cost": "Free",
        "size": "1 MB",
        "version": "2.1.4",
        "stars": 8000,
        "last_updated": "Updated on 05/11/2024",
        "os": "Cross-platform",
        "tags": [
            "Vue",
            "Validation",
            "Forms",
            "Reactive",
            "Simple"
        ],
        "source": "https://vuelidate-next.netlify.app/"
    },
    {
        "id": "vueuse",
        "name": "VueUse",
        "description": "VueUse is a collection of essential Vue 3 composition utilities. It provides over 200 composables covering browser APIs, reactivity, sensors, and animation. VueUse improves productivity and consistency in Vue projects and integrates smoothly with Nuxt and Vite ecosystems.",
        "category": "Frontend",
        "license": "MIT",
        "cost": "Free",
        "size": "2.2 MB",
        "version": "10.2.0",
        "stars": 18000,
        "last_updated": "Updated on 05/11/2024",
        "os": "Cross-platform",
        "tags": [
            "Vue 3",
            "Composition API",
            "Hooks",
            "Utilities",
            "Nuxt"
        ],
        "source": "https://vueuse.org/"
    },
    {
        "id": "pinia",
        "name": "Pinia",
        "description": "Pinia is the official state management library for Vue 3. It replaces Vuex with a simpler API, full TypeScript support, and devtools integration. Pinia supports multiple stores, modular design, and SSR, making it suitable for both small and large-scale applications.",
        "category": "Frontend",
        "license": "MIT",
        "cost": "Free",
        "size": "1.4 MB",
        "version": "2.1.7",
        "stars": 16000,
        "last_updated": "Updated on 05/11/2024",
        "os": "Cross-platform",
        "tags": [
            "Vue",
            "State Management",
            "Vuex Alternative",
            "Modular",
            "Devtools"
        ],
        "source": "https://pinia.vuejs.org/"
    },
    {
        "id": "naive-ui",
        "name": "Naive UI",
        "description": "Naive UI is a fully customizable, Vue 3 component library with a modern aesthetic. It supports dark mode, SSR, TypeScript, and internationalization out of the box. Naive UI offers a full suite of form controls, layouts, charts, and admin dashboard components, making it ideal for modern web apps.",
        "category": "Frontend",
        "license": "MIT",
        "cost": "Free",
        "size": "7 MB",
        "version": "3.39.6",
        "stars": 15000,
        "last_updated": "Updated on 05/11/2024",
        "os": "Cross-platform",
        "tags": [
            "Vue 3",
            "UI Library",
            "Customizable",
            "SSR",
            "Dark Mode"
        ],
        "source": "https://www.naiveui.com/"
    },
    {
        "id": "primevue",
        "name": "PrimeVue",
        "description": "PrimeVue is a comprehensive UI component library for Vue.js, offering over 90 components including data tables, forms, overlays, and charts. It supports accessibility, theming, and integration with form libraries like VeeValidate. Ideal for enterprise-level applications with complex UI needs.",
        "category": "Frontend",
        "license": "MIT / Commercial",
        "cost": "Free / Paid",
        "size": "12 MB",
        "version": "3.47.0",
        "stars": 5500,
        "last_updated": "Updated on 05/11/2024",
        "os": "Cross-platform",
        "tags": [
            "Vue",
            "Component Library",
            "Enterprise",
            "Accessibility",
            "Theming"
        ],
        "source": "https://www.primefaces.org/primevue/"
    },
    {
        "id": "element-plus",
        "name": "Element Plus",
        "description": "Element Plus is a Vue 3-based component library that continues the popular Element UI framework. It features elegant, well-documented components like buttons, modals, date pickers, and form inputs. Built with TypeScript and Sass, it’s optimized for modern apps and design systems.",
        "category": "Frontend",
        "license": "MIT",
        "cost": "Free",
        "size": "8 MB",
        "version": "2.4.3",
        "stars": 21000,
        "last_updated": "Updated on 05/11/2024",
        "os": "Cross-platform",
        "tags": [
            "Vue",
            "Component Library",
            "TypeScript",
            "Elegant UI",
            "Design System"
        ],
        "source": "https://element-plus.org/"
    },
    {
        "id": "quasar",
        "name": "Quasar Framework",
        "description": "Quasar is a Vue-based frontend framework for building responsive SPAs, PWAs, SSR apps, mobile apps (via Cordova or Capacitor), and Electron desktop apps. It includes a complete set of UI components, CLI tooling, and performance optimization features, making it a full-stack solution for Vue developers.",
        "category": "Frontend",
        "license": "MIT",
        "cost": "Free",
        "size": "10 MB",
        "version": "2.15.5",
        "stars": 24000,
        "last_updated": "Updated on 05/11/2024",
        "os": "Cross-platform",
        "tags": [
            "Vue",
            "Fullstack",
            "PWA",
            "Electron",
            "Mobile"
        ],
        "source": "https://quasar.dev/"
    },
    {
        "id": "vuetify",
        "name": "Vuetify",
        "description": "Vuetify is a popular Material Design component framework for Vue.js. It provides a comprehensive set of responsive and accessible UI components built to align with Google’s Material Design specs. Vuetify supports Vue 2 and Vue 3 and integrates with Vue CLI, Nuxt, and Vite.",
        "category": "Frontend",
        "license": "MIT",
        "cost": "Free",
        "size": "13 MB",
        "version": "3.5.4",
        "stars": 39000,
        "last_updated": "Updated on 05/11/2024",
        "os": "Cross-platform",
        "tags": [
            "Vue",
            "Material Design",
            "Responsive",
            "Accessibility",
            "UI Framework"
        ],
        "source": "https://vuetifyjs.com/"
    },
    {
        "id": "vue-material",
        "name": "Vue Material",
        "description": "Vue Material is a lightweight UI framework that brings Google Material Design components to Vue 2 projects. It provides easy-to-use and responsive UI elements like buttons, inputs, cards, and navigation drawers. Vue Material is ideal for small-to-medium Vue applications that require material styling with minimal dependencies.",
        "category": "Frontend",
        "license": "MIT",
        "cost": "Free",
        "size": "5 MB",
        "version": "1.0.0-beta-15",
        "stars": 9500,
        "last_updated": "Updated on 05/11/2024",
        "os": "Cross-platform",
        "tags": [
            "Vue",
            "Material Design",
            "UI",
            "Lightweight",
            "Responsive"
        ],
        "source": "https://vuematerial.io/"
    },
    {
        "id": "buefy",
        "name": "Buefy",
        "description": "Buefy is a lightweight UI library for Vue.js based on Bulma CSS framework. It combines Bulma’s responsive design philosophy with Vue components, offering simplicity, flexibility, and a small footprint. Buefy is great for quick UI development using familiar HTML-like classes and Vue bindings.",
        "category": "Frontend",
        "license": "MIT",
        "cost": "Free",
        "size": "4 MB",
        "version": "0.9.24",
        "stars": 9500,
        "last_updated": "Updated on 05/11/2024",
        "os": "Cross-platform",
        "tags": [
            "Vue",
            "Bulma",
            "Lightweight",
            "Responsive",
            "UI Kit"
        ],
        "source": "https://buefy.org/"
    },
    {
        "id": "inkline",
        "name": "Inkline",
        "description": "Inkline is a modern, customizable UI/UX component framework for Vue.js. Built with accessibility in mind, it includes responsive grid systems, form controls, modals, tabs, and notifications. Inkline uses Sass and offers dark mode, internationalization, and excellent TypeScript support out of the box.",
        "category": "Frontend",
        "license": "MIT",
        "cost": "Free",
        "size": "6 MB",
        "version": "3.2.0",
        "stars": 1800,
        "last_updated": "Updated on 05/11/2024",
        "os": "Cross-platform",
        "tags": [
            "Vue",
            "UI Library",
            "Accessibility",
            "Responsive",
            "Sass"
        ],
        "source": "https://inkline.io/"
    },
    {
        "id": "oruga",
        "name": "Oruga UI",
        "description": "Oruga UI is a lightweight, themeable UI component library for Vue.js that focuses on flexibility and minimalism. It’s framework-agnostic, integrates seamlessly with CSS frameworks like Bulma or Tailwind, and allows you to fully customize components without being tied to a design system.",
        "category": "Frontend",
        "license": "MIT",
        "cost": "Free",
        "size": "3 MB",
        "version": "0.8.7",
        "stars": 1300,
        "last_updated": "Updated on 05/11/2024",
        "os": "Cross-platform",
        "tags": [
            "Vue",
            "Lightweight",
            "UI Framework",
            "Themeable",
            "Bulma"
        ],
        "source": "https://oruga.io/"
    },
    {
        "id": "vue-treeselect",
        "name": "Vue Treeselect",
        "description": "Vue Treeselect is a powerful multi-select component for Vue.js featuring a hierarchical tree UI. It supports async options loading, filtering, and tagging, and is optimized for performance with large datasets. Ideal for forms that require nested or grouped selections.",
        "category": "Frontend",
        "license": "MIT",
        "cost": "Free",
        "size": "1.5 MB",
        "version": "0.4.0",
        "stars": 4100,
        "last_updated": "Updated on 05/11/2024",
        "os": "Cross-platform",
        "tags": [
            "Vue",
            "Tree Select",
            "Forms",
            "Multiselect",
            "Hierarchical"
        ],
        "source": "https://vue-treeselect.js.org/"
    },
    {
        "id": "vue-multiselect",
        "name": "Vue Multiselect",
        "description": "Vue Multiselect is a flexible multi-select dropdown component for Vue.js with tagging, searching, and async options support. It’s ideal for highly customizable input forms and supports single or multi-select, custom templates, and remote data binding.",
        "category": "Frontend",
        "license": "MIT",
        "cost": "Free",
        "size": "1.8 MB",
        "version": "3.0.0-beta.2",
        "stars": 9400,
        "last_updated": "Updated on 05/11/2024",
        "os": "Cross-platform",
        "tags": [
            "Vue",
            "Dropdown",
            "Multiselect",
            "Async",
            "Custom UI"
        ],
        "source": "https://vue-multiselect.js.org/"
    },
    {
        "id": "v-calendar",
        "name": "V-Calendar",
        "description": "V-Calendar is a highly customizable date picker and calendar component for Vue.js. It supports single, range, and multiple date selection, along with localization, accessibility, and dark mode. Useful for forms, bookings, and scheduling interfaces in Vue applications.",
        "category": "Frontend",
        "license": "MIT",
        "cost": "Free",
        "size": "2 MB",
        "version": "3.0.2",
        "stars": 4100,
        "last_updated": "Updated on 05/11/2024",
        "os": "Cross-platform",
        "tags": [
            "Vue",
            "Calendar",
            "Date Picker",
            "Forms",
            "Customizable"
        ],
        "source": "https://vcalendar.io/"
    },
    {
        "id": "vue-notification",
        "name": "Vue Notification",
        "description": "Vue Notification is a lightweight toast notification plugin for Vue.js with configurable options for positioning, timing, styling, and actions. It integrates easily into Vue apps and provides a clean API for showing user feedback and alerts.",
        "category": "Frontend",
        "license": "MIT",
        "cost": "Free",
        "size": "800 KB",
        "version": "1.3.20",
        "stars": 3200,
        "last_updated": "Updated on 05/11/2024",
        "os": "Cross-platform",
        "tags": [
            "Vue",
            "Notifications",
            "Toast",
            "Plugin",
            "Alerts"
        ],
        "source": "https://github.com/euvl/vue-notification"
    },
    {
        "id": "vue-toastification",
        "name": "Vue Toastification",
        "description": "Vue Toastification is a sleek, customizable toast notification library for Vue 2 and 3. It supports auto-dismiss, transitions, click-to-close, and dynamic updates. Built with accessibility and performance in mind, it’s perfect for clean alert systems in modern Vue apps.",
        "category": "Frontend",
        "license": "MIT",
        "cost": "Free",
        "size": "1 MB",
        "version": "2.0.0-rc.5",
        "stars": 3800,
        "last_updated": "Updated on 05/11/2024",
        "os": "Cross-platform",
        "tags": [
            "Vue",
            "Toast",
            "Alerts",
            "Transitions",
            "Notifications"
        ],
        "source": "https://vue-toastification.maronato.dev/"
    },
    {
        "id": "vue-chartjs",
        "name": "Vue Chart.js",
        "description": "Vue Chart.js is a wrapper around the Chart.js library for Vue 2 and Vue 3. It simplifies chart integration by offering reactive and declarative components for bar, line, pie, radar, and doughnut charts. Ideal for dashboards, analytics, and real-time visualizations.",
        "category": "Frontend",
        "license": "MIT",
        "cost": "Free",
        "size": "3 MB",
        "version": "5.2.0",
        "stars": 5000,
        "last_updated": "Updated on 05/11/2024",
        "os": "Cross-platform",
        "tags": [
            "Charts",
            "Visualization",
            "Vue",
            "Data",
            "Analytics"
        ],
        "source": "https://vue-chartjs.org/"
    },
    {
        "id": "vue-echarts",
        "name": "Vue ECharts",
        "description": "Vue ECharts is an elegant wrapper for Apache ECharts, enabling reactive charts and rich data visualizations in Vue applications. It supports dynamic datasets, responsive resizing, and deep customization of options, making it a go-to tool for dashboards and complex analytics.",
        "category": "Frontend",
        "license": "MIT",
        "cost": "Free",
        "size": "5 MB",
        "version": "6.5.1",
        "stars": 7000,
        "last_updated": "Updated on 05/11/2024",
        "os": "Cross-platform",
        "tags": [
            "Charts",
            "Vue",
            "ECharts",
            "Data Visualization",
            "Responsive"
        ],
        "source": "https://echarts.apache.org/en/index.html"
    },
    {
        "id": "vue-grid-layout",
        "name": "Vue Grid Layout",
        "description": "Vue Grid Layout is a responsive, draggable, and resizable grid layout system inspired by React-Grid-Layout. It’s ideal for building customizable dashboards, Kanban boards, and widget panels. Supports drag handles, layout persistence, and breakpoint-based layouts.",
        "category": "Frontend",
        "license": "MIT",
        "cost": "Free",
        "size": "3.5 MB",
        "version": "3.0.0-beta1",
        "stars": 7500,
        "last_updated": "Updated on 05/11/2024",
        "os": "Cross-platform",
        "tags": [
            "Vue",
            "Grid",
            "Dashboard",
            "Draggable",
            "Responsive"
        ],
        "source": "https://jbaysolutions.github.io/vue-grid-layout/"
    },
    {
        "id": "vue-draggable-next",
        "name": "Vue Draggable Next",
        "description": "Vue Draggable Next is a Vue 3-compatible wrapper around the popular SortableJS library. It provides drag-and-drop functionality for lists and grids with full support for touch, animations, and custom drag handles. Ideal for sortable lists, Kanban boards, and dynamic layouts in Vue apps.",
        "category": "Frontend",
        "license": "MIT",
        "cost": "Free",
        "size": "2.1 MB",
        "version": "2.2.1",
        "stars": 2700,
        "last_updated": "Updated on 05/11/2024",
        "os": "Cross-platform",
        "tags": [
            "Vue",
            "Drag and Drop",
            "Sortable",
            "Grid",
            "Touch"
        ],
        "source": "https://github.com/SortableJS/vue.draggable.next"
    },
    {
        "id": "vue-slick-carousel",
        "name": "Vue Slick Carousel",
        "description": "Vue Slick Carousel is a Vue wrapper for the Slick carousel library, offering responsive, touch-enabled sliders. It supports lazy loading, autoplay, variable width, and custom arrows. Great for media galleries, product showcases, or interactive carousels in Vue applications.",
        "category": "Frontend",
        "license": "MIT",
        "cost": "Free",
        "size": "1.8 MB",
        "version": "1.1.16",
        "stars": 1600,
        "last_updated": "Updated on 05/11/2024",
        "os": "Cross-platform",
        "tags": [
            "Vue",
            "Carousel",
            "Slider",
            "Touch",
            "Responsive"
        ],
        "source": "https://github.com/gs-shop/vue-slick-carousel"
    },
    {
        "id": "keen-slider",
        "name": "Keen Slider",
        "description": "Keen Slider is a lightweight touch slider library with native performance and zero dependencies. It supports carousels, galleries, and multi-slider setups with flexible configuration. Keen Slider works with any frontend framework including Vue, React, and plain JavaScript.",
        "category": "Frontend",
        "license": "MIT",
        "cost": "Free",
        "size": "30 KB",
        "version": "6.8.0",
        "stars": 4300,
        "last_updated": "Updated on 05/11/2024",
        "os": "Cross-platform",
        "tags": [
            "Slider",
            "Touch",
            "JavaScript",
            "Vue",
            "Lightweight"
        ],
        "source": "https://keen-slider.io/"
    },
    {
        "id": "glidejs",
        "name": "Glide.js",
        "description": "Glide.js is a dependency-free JavaScript ES6 slider and carousel library. It features smooth transitions, responsive design, and touch support. Glide is ideal for lightweight web apps, landing pages, and mobile-friendly image galleries.",
        "category": "Frontend",
        "license": "MIT",
        "cost": "Free",
        "size": "23 KB",
        "version": "3.6.0",
        "stars": 6900,
        "last_updated": "Updated on 05/11/2024",
        "os": "Cross-platform",
        "tags": [
            "Carousel",
            "Slider",
            "Touch",
            "Responsive",
            "Minimal"
        ],
        "source": "https://glidejs.com/"
    },
    {
        "id": "vue-awesome-swiper",
        "name": "Vue Awesome Swiper",
        "description": "Vue Awesome Swiper integrates the Swiper slider library with Vue.js, offering powerful features like nested slides, mouse wheel control, 3D effects, and pagination. It's ideal for image sliders, product showcases, and swipe-based interactions in Vue apps.",
        "category": "Frontend",
        "license": "MIT",
        "cost": "Free",
        "size": "2.4 MB",
        "version": "5.0.1",
        "stars": 13000,
        "last_updated": "Updated on 05/11/2024",
        "os": "Cross-platform",
        "tags": [
            "Vue",
            "Swiper",
            "Touch Slider",
            "Pagination",
            "3D Effects"
        ],
        "source": "https://github.com/surmon-china/vue-awesome-swiper"
    },
    {
        "id": "swiper",
        "name": "Swiper",
        "description": "Swiper is a modern mobile touch slider with hardware-accelerated transitions, rich features, and zero dependencies. It supports vertical and horizontal modes, nested slides, autoplay, parallax, and 3D effects. It's framework-agnostic and widely used in mobile-first UIs and progressive web apps.",
        "category": "Frontend",
        "license": "MIT",
        "cost": "Free",
        "size": "1.5 MB",
        "version": "11.1.3",
        "stars": 38000,
        "last_updated": "Updated on 05/11/2024",
        "os": "Cross-platform",
        "tags": [
            "Touch Slider",
            "Mobile",
            "3D Effects",
            "No Dependencies",
            "PWA"
        ],
        "source": "https://swiperjs.com/"
    },
    {
        "id": "splide",
        "name": "Splide",
        "description": "Splide is a lightweight, extensible, and responsive slider written in pure JavaScript. It offers extensive customization, lazy loading, multiple breakpoints, and accessibility out of the box. Splide works with any frontend framework and is excellent for high-performance sliders and galleries.",
        "category": "Frontend",
        "license": "MIT",
        "cost": "Free",
        "size": "50 KB",
        "version": "4.1.4",
        "stars": 3900,
        "last_updated": "Updated on 05/11/2024",
        "os": "Cross-platform",
        "tags": [
            "Slider",
            "JavaScript",
            "Framework-agnostic",
            "Accessibility",
            "Responsive"
        ],
        "source": "https://splidejs.com/"
    },
    {
        "id": "vue-carousel",
        "name": "Vue Carousel",
        "description": "Vue Carousel is a responsive, touch-friendly carousel component for Vue 2. It includes features such as infinite scrolling, autoplay, pagination, and mobile swipe gestures. Ideal for simple image or content carousels with minimal setup and high customizability.",
        "category": "Frontend",
        "license": "MIT",
        "cost": "Free",
        "size": "1.2 MB",
        "version": "0.18.0",
        "stars": 2200,
        "last_updated": "Updated on 05/11/2024",
        "os": "Cross-platform",
        "tags": [
            "Vue",
            "Carousel",
            "Touch",
            "Autoplay",
            "Pagination"
        ],
        "source": "https://ssense.github.io/vue-carousel/"
    },
    {
        "id": "vue-cool-lightbox",
        "name": "Vue Cool Lightbox",
        "description": "Vue Cool Lightbox is a modern lightbox gallery plugin for Vue.js. It supports responsive image and video displays, keyboard navigation, zoom, and custom UI slots. Designed for media-rich applications like portfolios, product pages, and blogs.",
        "category": "Frontend",
        "license": "MIT",
        "cost": "Free",
        "size": "1 MB",
        "version": "2.4.2",
        "stars": 950,
        "last_updated": "Updated on 05/11/2024",
        "os": "Cross-platform",
        "tags": [
            "Vue",
            "Lightbox",
            "Gallery",
            "Responsive",
            "Zoom"
        ],
        "source": "https://github.com/timothyjoseph/vue-cool-lightbox"
    },
    {
        "id": "lightgallery",
        "name": "LightGallery",
        "description": "LightGallery is a highly customizable and full-featured lightbox gallery plugin written in vanilla JavaScript. It supports images, videos, iframes, autoplay, zoom, and fullscreen. With its plugin system, developers can extend and style it easily across any frontend stack.",
        "category": "Frontend",
        "license": "GPL-3.0 / Commercial",
        "cost": "Free / Paid",
        "size": "2 MB",
        "version": "2.7.1",
        "stars": 5800,
        "last_updated": "Updated on 05/11/2024",
        "os": "Cross-platform",
        "tags": [
            "Lightbox",
            "Gallery",
            "JavaScript",
            "Media",
            "Fullscreen"
        ],
        "source": "https://www.lightgalleryjs.com/"
    },
    {
        "id": "baguettebox",
        "name": "BaguetteBox.js",
        "description": "BaguetteBox.js is a simple and lightweight JavaScript lightbox library for images. It offers responsive design, keyboard navigation, touch support, and lazy loading. It requires zero dependencies and is great for quick implementation of mobile-ready photo galleries.",
        "category": "Frontend",
        "license": "MIT",
        "cost": "Free",
        "size": "12 KB",
        "version": "1.11.1",
        "stars": 2400,
        "last_updated": "Updated on 05/11/2024",
        "os": "Cross-platform",
        "tags": [
            "Lightbox",
            "Images",
            "Lazy Load",
            "Keyboard Navigation",
            "Responsive"
        ],
        "source": "https://feimosi.github.io/baguetteBox.js/"
    },
    {
        "id": "fancybox",
        "name": "Fancybox",
        "description": "Fancybox is a professional JavaScript lightbox library for displaying images, HTML, and videos. It supports touch, drag, zoom, slideshow, and fullscreen modes. Fancybox is well-suited for premium web apps, portfolios, and e-commerce sites needing advanced media presentation.",
        "category": "Frontend",
        "license": "GPLv3 / Commercial",
        "cost": "Free / Paid",
        "size": "2.5 MB",
        "version": "5.0.28",
        "stars": 7400,
        "last_updated": "Updated on 05/11/2024",
        "os": "Cross-platform",
        "tags": [
            "Lightbox",
            "Zoom",
            "Fullscreen",
            "Gallery",
            "JavaScript"
        ],
        "source": "https://fancyapps.com/fancybox/"
    },
    {
        "id": "photoswipe",
        "name": "PhotoSwipe",
        "description": "PhotoSwipe is a JavaScript gallery library for mobile and desktop with native-like gesture support. It features zooming, pinch, swiping, fullscreen, and caption support. Used in major image-heavy websites, it emphasizes performance, touch accuracy, and ease of integration.",
        "category": "Frontend",
        "license": "MIT",
        "cost": "Free",
        "size": "35 KB",
        "version": "5.4.2",
        "stars": 23000,
        "last_updated": "Updated on 05/11/2024",
        "os": "Cross-platform",
        "tags": [
            "Gallery",
            "Lightbox",
            "Touch",
            "Zoom",
            "JavaScript"
        ],
        "source": "https://photoswipe.com/"
    },
    {
        "id": "justifiedGallery",
        "name": "Justified Gallery",
        "description": "Justified Gallery is a jQuery-based image gallery plugin that creates justified, Flickr-style layouts. It balances rows dynamically and supports lightbox integrations for high-quality photo displays. Best suited for portfolio pages and professional image showcases.",
        "category": "Frontend",
        "license": "MIT",
        "cost": "Free",
        "size": "40 KB",
        "version": "3.8.1",
        "stars": 1900,
        "last_updated": "Updated on 05/11/2024",
        "os": "Cross-platform",
        "tags": [
            "Gallery",
            "jQuery",
            "Justified Layout",
            "Images",
            "Responsive"
        ],
        "source": "https://miromannino.github.io/Justified-Gallery/"
    },
    {
        "id": "vue-gallery",
        "name": "Vue Gallery",
        "description": "Vue Gallery is a responsive and minimalist gallery component for Vue 2 apps. It supports swipe gestures, zooming, lazy loading, and customizable transitions. Built for simplicity, it's ideal for image portfolios and blogs using Vue.",
        "category": "Frontend",
        "license": "MIT",
        "cost": "Free",
        "size": "1.1 MB",
        "version": "1.5.1",
        "stars": 1400,
        "last_updated": "Updated on 05/11/2024",
        "os": "Cross-platform",
        "tags": [
            "Vue",
            "Gallery",
            "Touch",
            "Zoom",
            "Lazy Load"
        ],
        "source": "https://github.com/RobinCK/vue-gallery"
    },
    {
        "id": "vue-picture-swipe",
        "name": "Vue Picture Swipe",
        "description": "Vue Picture Swipe is a Vue wrapper for PhotoSwipe, offering a mobile-friendly image gallery with pinch-to-zoom and swipe navigation. It allows declarative syntax and integrates seamlessly with Vue 2. Great for full-screen gallery views with performance in mind.",
        "category": "Frontend",
        "license": "MIT",
        "cost": "Free",
        "size": "900 KB",
        "version": "1.1.3",
        "stars": 500,
        "last_updated": "Updated on 05/11/2024",
        "os": "Cross-platform",
        "tags": [
            "Vue",
            "PhotoSwipe",
            "Gallery",
            "Touch",
            "Responsive"
        ],
        "source": "https://github.com/rap2hpoutre/vue-picture-swipe"
    },
    {
        "id": "vue-masonry-css",
        "name": "Vue Masonry CSS",
        "description": "Vue Masonry CSS is a lightweight masonry layout library for Vue.js that relies on pure CSS columns. It avoids JavaScript layout calculations for better performance and responsiveness. Ideal for image-heavy layouts, grids, and Pinterest-style designs.",
        "category": "Frontend",
        "license": "MIT",
        "cost": "Free",
        "size": "500 KB",
        "version": "1.1.2",
        "stars": 1100,
        "last_updated": "Updated on 05/11/2024",
        "os": "Cross-platform",
        "tags": [
            "Vue",
            "Masonry",
            "CSS",
            "Grid",
            "Responsive"
        ],
        "source": "https://github.com/paulcollett/vue-masonry-css"
    },
    {
        "id": "macy",
        "name": "Macy.js",
        "description": "Macy.js is a tiny layout library for building responsive, grid-based, and masonry-style layouts. It supports column-based layouts, image preloading, and breakpoints. Macy is framework-agnostic and ideal for creating Pinterest-style UIs without relying on large dependencies.",
        "category": "Frontend",
        "license": "MIT",
        "cost": "Free",
        "size": "15 KB",
        "version": "2.5.1",
        "stars": 3000,
        "last_updated": "Updated on 05/11/2024",
        "os": "Cross-platform",
        "tags": [
            "Grid",
            "Layout",
            "Masonry",
            "Responsive",
            "JavaScript"
        ],
        "source": "https://macyjs.com/"
    },
    {
        "id": "vue-waterfall",
        "name": "Vue Waterfall",
        "description": "Vue Waterfall is a Vue.js component for creating waterfall layouts (masonry-like) optimized for image-heavy sites. It supports infinite scroll, lazy loading, and responsive column widths. Ideal for building Pinterest-style galleries or portfolios in Vue applications.",
        "category": "Frontend",
        "license": "MIT",
        "cost": "Free",
        "size": "1 MB",
        "version": "2.0.2",
        "stars": 600,
        "last_updated": "Updated on 05/11/2024",
        "os": "Cross-platform",
        "tags": [
            "Vue",
            "Waterfall",
            "Layout",
            "Gallery",
            "Responsive"
        ],
        "source": "https://github.com/MopTym/vue-waterfall"
    },
    {
        "id": "bricklayer",
        "name": "Bricklayer",
        "description": "Bricklayer is a lightweight masonry-style layout library written in pure JavaScript. It dynamically arranges elements into balanced columns and works well with responsive and lazy-loaded content. Bricklayer is framework-agnostic and great for blogs, portfolios, and card UIs.",
        "category": "Frontend",
        "license": "MIT",
        "cost": "Free",
        "size": "30 KB",
        "version": "0.4.0",
        "stars": 2200,
        "last_updated": "Updated on 05/11/2024",
        "os": "Cross-platform",
        "tags": [
            "Layout",
            "Masonry",
            "Responsive",
            "JavaScript",
            "Minimal"
        ],
        "source": "https://github.com/ademilter/bricklayer"
    },
    {
        "id": "muuri",
        "name": "Muuri",
        "description": "Muuri is a responsive, sortable, and filterable layout engine for web apps. It combines the features of Packery, Masonry, and Sortable into one customizable grid system. With drag-and-drop and dynamic filtering, Muuri is ideal for dashboards, visual organizers, and media galleries.",
        "category": "Frontend",
        "license": "MIT",
        "cost": "Free",
        "size": "150 KB",
        "version": "0.10.2",
        "stars": 11000,
        "last_updated": "Updated on 05/11/2024",
        "os": "Cross-platform",
        "tags": [
            "Layout",
            "Grid",
            "Sortable",
            "Filterable",
            "Responsive"
        ],
        "source": "https://haltu.github.io/muuri/"
    },
    {
        "id": "isotope",
        "name": "Isotope",
        "description": "Isotope is a powerful layout and filtering library that supports masonry, fitRows, and other dynamic layouts. It allows sorting, filtering, and real-time DOM manipulation for creating interactive galleries and portfolios. Available under commercial license with robust documentation.",
        "category": "Frontend",
        "license": "Commercial / GPLv3",
        "cost": "Free / Paid",
        "size": "160 KB",
        "version": "3.0.6",
        "stars": 9600,
        "last_updated": "Updated on 05/11/2024",
        "os": "Cross-platform",
        "tags": [
            "Layout",
            "Grid",
            "Filter",
            "Masonry",
            "Animation"
        ],
        "source": "https://isotope.metafizzy.co/"
    },
    {
        "id": "packery",
        "name": "Packery",
        "description": "Packery is a JavaScript layout engine that creates cascading grid layouts with draggable support. It fills gaps intelligently and supports touch and mouse drag-and-drop. Frequently used in dashboard and CMS interfaces, Packery makes responsive UIs easy to manage.",
        "category": "Frontend",
        "license": "Commercial / GPLv3",
        "cost": "Free / Paid",
        "size": "90 KB",
        "version": "2.1.2",
        "stars": 7500,
        "last_updated": "Updated on 05/11/2024",
        "os": "Cross-platform",
        "tags": [
            "Masonry",
            "Drag",
            "Grid",
            "Responsive",
            "Gapless"
        ],
        "source": "https://packery.metafizzy.co/"
    },
    {
        "id": "react-beautiful-dnd",
        "name": "React Beautiful DnD",
        "description": "React Beautiful DnD is a popular drag-and-drop library by Atlassian. It provides natural movement, keyboard support, and reordering for lists and grids with full a11y compliance. Ideal for Trello-style boards, Kanban workflows, and interactive dashboards.",
        "category": "Frontend",
        "license": "Apache-2.0",
        "cost": "Free",
        "size": "2.4 MB",
        "version": "13.1.1",
        "stars": 31000,
        "last_updated": "Updated on 05/11/2024",
        "os": "Cross-platform",
        "tags": [
            "React",
            "Drag and Drop",
            "Accessibility",
            "Grid",
            "List"
        ],
        "source": "https://github.com/atlassian/react-beautiful-dnd"
    },
    {
        "id": "dnd-kit",
        "name": "dnd-kit",
        "description": "dnd-kit is a modern, extensible drag-and-drop toolkit for React apps. Built with accessibility and modularity in mind, it provides sensor support, drag overlays, sorting primitives, and custom drop logic. It’s a flexible alternative to older drag libraries.",
        "category": "Frontend",
        "license": "MIT",
        "cost": "Free",
        "size": "1.8 MB",
        "version": "7.0.3",
        "stars": 14000,
        "last_updated": "Updated on 05/11/2024",
        "os": "Cross-platform",
        "tags": [
            "React",
            "DnD",
            "Hooks",
            "Accessibility",
            "Customizable"
        ],
        "source": "https://dndkit.com/"
    },
    {
        "id": "react-dnd",
        "name": "React DnD",
        "description": "React DnD is a set of React utilities for building complex drag-and-drop interfaces. It supports multi-backend setups, nested dragging, and preview customization. Backed by HTML5 DnD APIs, it’s a robust solution for sortable lists and modular UIs.",
        "category": "Frontend",
        "license": "MIT",
        "cost": "Free",
        "size": "3.2 MB",
        "version": "16.0.1",
        "stars": 20000,
        "last_updated": "Updated on 05/11/2024",
        "os": "Cross-platform",
        "tags": [
            "React",
            "Drag",
            "Drop",
            "Customizable",
            "DnD"
        ],
        "source": "https://react-dnd.github.io/react-dnd/"
    },
    {
        "id": "sortablejs",
        "name": "SortableJS",
        "description": "SortableJS is a minimal, dependency-free JavaScript library for reordering lists via drag-and-drop. It supports touch events, animation, multi-drag, and swap modes. SortableJS is framework-agnostic and used in complex UI systems like dashboards and CMSs.",
        "category": "Frontend",
        "license": "MIT",
        "cost": "Free",
        "size": "130 KB",
        "version": "1.15.2",
        "stars": 28000,
        "last_updated": "Updated on 05/11/2024",
        "os": "Cross-platform",
        "tags": [
            "Drag",
            "Drop",
            "JavaScript",
            "List",
            "Sortable"
        ],
        "source": "https://sortablejs.github.io/Sortable/"
    },
    {
        "id": "react-grid-layout",
        "name": "React Grid Layout",
        "description": "React Grid Layout is a draggable and resizable grid layout system built for React. It supports breakpoints, responsive resizing, and layout persistence. Commonly used for dashboards and admin panels where users can customize their layout in real time.",
        "category": "Frontend",
        "license": "MIT",
        "cost": "Free",
        "size": "2.1 MB",
        "version": "1.3.4",
        "stars": 18000,
        "last_updated": "Updated on 05/11/2024",
        "os": "Cross-platform",
        "tags": [
            "React",
            "Grid",
            "Layout",
            "Resizable",
            "Draggable"
        ],
        "source": "https://github.com/react-grid-layout/react-grid-layout"
    },
    {
        "id": "gridstack",
        "name": "Gridstack.js",
        "description": "Gridstack.js is a responsive drag-and-drop grid layout system supporting multi-column layouts, resizing, and nesting. Written in TypeScript, it integrates with frameworks like Angular, React, and Vue and is often used for data dashboards and content editors.",
        "category": "Frontend",
        "license": "MIT",
        "cost": "Free",
        "size": "2.3 MB",
        "version": "8.4.0",
        "stars": 6000,
        "last_updated": "Updated on 05/11/2024",
        "os": "Cross-platform",
        "tags": [
            "Drag",
            "Drop",
            "Grid",
            "Resizable",
            "Dashboard"
        ],
        "source": "https://gridstackjs.com/"
    },
    {
        "id": "gridlex",
        "name": "Gridlex",
        "description": "Gridlex is a flexbox-based grid system that enables rapid responsive layouts with minimal classes. It simplifies column alignment, spacing, and ordering with mobile-first principles. Useful for lightweight landing pages and apps that don’t require complex grid logic.",
        "category": "Frontend",
        "license": "MIT",
        "cost": "Free",
        "size": "25 KB",
        "version": "2.7.1",
        "stars": 1200,
        "last_updated": "Updated on 05/11/2024",
        "os": "Cross-platform",
        "tags": [
            "Grid",
            "Flexbox",
            "Responsive",
            "Lightweight",
            "CSS Framework"
        ],
        "source": "https://gridlex.devlint.fr/"
    },
    {
        "id": "reflexbox",
        "name": "Reflexbox",
        "description": "Reflexbox is a responsive grid and layout utility built with Styled System and React. It offers flexbox utilities with responsive props and integrates seamlessly with theme-based design systems. Best for rapid layout prototyping in React apps.",
        "category": "Frontend",
        "license": "MIT",
        "cost": "Free",
        "size": "350 KB",
        "version": "4.0.6",
        "stars": 2400,
        "last_updated": "Updated on 05/11/2024",
        "os": "Cross-platform",
        "tags": [
            "React",
            "Flexbox",
            "Grid",
            "Styled System",
            "Theming"
        ],
        "source": "https://reflexjs.org/components/reflexbox/"
    },
    {
        "id": "vue-flexboxgrid",
        "name": "Vue Flexboxgrid",
        "description": "Vue Flexboxgrid is a Vue wrapper for the popular Flexbox Grid CSS framework. It allows developers to use familiar grid layout syntax with Vue components. Ideal for quickly building responsive layouts in Vue 2 projects.",
        "category": "Frontend",
        "license": "MIT",
        "cost": "Free",
        "size": "400 KB",
        "version": "1.0.4",
        "stars": 500,
        "last_updated": "Updated on 05/11/2024",
        "os": "Cross-platform",
        "tags": [
            "Vue",
            "Grid",
            "Flexbox",
            "Responsive",
            "Wrapper"
        ],
        "source": "https://github.com/rafaelpimpa/vue-flexboxgrid"
    },
    {
        "id": "vue-layout-system",
        "name": "Vue Layout System",
        "description": "Vue Layout System is a Vue 3 utility-first layout engine that enables custom, responsive section building. It supports grid rows, columns, spacing, and media breakpoints. Perfect for developing sectioned layouts for CMSs or page builders.",
        "category": "Frontend",
        "license": "MIT",
        "cost": "Free",
        "size": "1 MB",
        "version": "1.2.0",
        "stars": 400,
        "last_updated": "Updated on 05/11/2024",
        "os": "Cross-platform",
        "tags": [
            "Vue",
            "Layout",
            "Responsive",
            "Sections",
            "Utility-first"
        ],
        "source": "https://github.com/johndatserakis/vue-layout-system"
    },
    {
        "id": "tailblocks",
        "name": "Tailblocks",
        "description": "Tailblocks is a collection of ready-to-use Tailwind CSS UI components and landing page sections. It includes headers, features, pricing tables, footers, and more. Developers can copy and paste blocks into Tailwind projects to rapidly prototype websites.",
        "category": "Frontend",
        "license": "MIT",
        "cost": "Free",
        "size": "8 MB",
        "version": "2.1.0",
        "stars": 9500,
        "last_updated": "Updated on 05/11/2024",
        "os": "Cross-platform",
        "tags": [
            "Tailwind",
            "UI Kit",
            "Landing Pages",
            "Components",
            "Blocks"
        ],
        "source": "https://tailblocks.cc/"
    },
    {
        "id": "vue-tailwind",
        "name": "Vue Tailwind",
        "description": "Vue Tailwind is a set of fully customizable Vue.js components styled with Tailwind CSS. It includes inputs, buttons, selects, and modals that adapt to your design system. Components are themeable and work with Vue 2 and 3.",
        "category": "Frontend",
        "license": "MIT",
        "cost": "Free",
        "size": "2.5 MB",
        "version": "2.5.1",
        "stars": 2300,
        "last_updated": "Updated on 05/11/2024",
        "os": "Cross-platform",
        "tags": [
            "Vue",
            "Tailwind",
            "UI Components",
            "Theming",
            "Reusable"
        ],
        "source": "https://vue-tailwind.com/"
    },
    {
        "id": "headlessui",
        "name": "Headless UI",
        "description": "Headless UI is a library of completely unstyled, fully accessible UI components designed to integrate with Tailwind CSS. Created by the Tailwind Labs team, it includes dialogs, menus, popovers, and tabs that offer complete control over styling and structure.",
        "category": "Frontend",
        "license": "MIT",
        "cost": "Free",
        "size": "1.8 MB",
        "version": "1.7.15",
        "stars": 24000,
        "last_updated": "Updated on 05/11/2024",
        "os": "Cross-platform",
        "tags": [
            "Tailwind",
            "Accessibility",
            "UI Components",
            "Headless",
            "Unstyled"
        ],
        "source": "https://headlessui.dev/"
    },
    {
        "id": "tailwind-elements",
        "name": "Tailwind Elements",
        "description": "Tailwind Elements is a large set of UI components built with Tailwind CSS and based on Material Design. It includes over 500 components like modals, carousels, forms, and tables, with ready-to-use examples and theme customization options. It’s ideal for building sleek, modern UIs using Tailwind.",
        "category": "Frontend",
        "license": "MIT",
        "cost": "Free / Paid (Pro)",
        "size": "10 MB",
        "version": "1.0.0",
        "stars": 5000,
        "last_updated": "Updated on 05/11/2024",
        "os": "Cross-platform",
        "tags": [
            "Tailwind",
            "Material Design",
            "UI Components",
            "Forms",
            "Tables"
        ],
        "source": "https://tailwind-elements.com/"
    },
    {
        "id": "tw-elements",
        "name": "TW Elements",
        "description": "TW Elements is a collection of over 800 UI components built with Tailwind CSS and inspired by Bootstrap. It offers tabs, cards, accordions, charts, and complete templates. All components are fully responsive and customizable via Tailwind’s utility classes.",
        "category": "Frontend",
        "license": "MIT",
        "cost": "Free / Paid",
        "size": "11 MB",
        "version": "2.0.3",
        "stars": 4300,
        "last_updated": "Updated on 05/11/2024",
        "os": "Cross-platform",
        "tags": [
            "Tailwind",
            "Bootstrap-like",
            "UI Kit",
            "Responsive",
            "Charts"
        ],
        "source": "https://tw-elements.com/"
    },
    {
        "id": "daisyui",
        "name": "DaisyUI",
        "description": "DaisyUI is a popular Tailwind CSS plugin that adds pre-styled components using Tailwind’s utility classes. It includes buttons, navbars, cards, and alerts, with built-in themes and dark mode support. Ideal for developers who want ready-to-use design without leaving Tailwind's utility-based workflow.",
        "category": "Frontend",
        "license": "MIT",
        "cost": "Free",
        "size": "3 MB",
        "version": "4.5.0",
        "stars": 27000,
        "last_updated": "Updated on 05/11/2024",
        "os": "Cross-platform",
        "tags": [
            "Tailwind",
            "Components",
            "Themes",
            "Dark Mode",
            "Plugin"
        ],
        "source": "https://daisyui.com/"
    },
    {
        "id": "windstrap",
        "name": "Windstrap",
        "description": "Windstrap is a utility-first UI kit that merges Tailwind CSS with Bootstrap-like component structures. It includes classes for alerts, forms, tables, modals, and navigation bars, offering a Bootstrap-like syntax but built entirely with Tailwind utilities.",
        "category": "Frontend",
        "license": "MIT",
        "cost": "Free",
        "size": "2 MB",
        "version": "1.2.3",
        "stars": 800,
        "last_updated": "Updated on 05/11/2024",
        "os": "Cross-platform",
        "tags": [
            "Tailwind",
            "Bootstrap Style",
            "UI Components",
            "Forms",
            "Modals"
        ],
        "source": "https://github.com/sh20raj/windstrap"
    },
    {
        "id": "merakiui",
        "name": "Meraki UI",
        "description": "Meraki UI is a Tailwind-based UI components library that includes clean and minimal templates for headers, footers, cards, and forms. Designed for minimal setup and fast prototyping, Meraki UI is useful for modern websites and landing pages.",
        "category": "Frontend",
        "license": "MIT",
        "cost": "Free",
        "size": "1.5 MB",
        "version": "1.1.0",
        "stars": 1500,
        "last_updated": "Updated on 05/11/2024",
        "os": "Cross-platform",
        "tags": [
            "Tailwind",
            "Templates",
            "Landing Pages",
            "Cards",
            "Forms"
        ],
        "source": "https://merakiui.com/"
    },
    {
        "id": "flowbite",
        "name": "Flowbite",
        "description": "Flowbite is an open-source UI component library built with Tailwind CSS. It includes hundreds of interactive elements like modals, dropdowns, navbars, and tables powered by Alpine.js. It offers Figma design kits and is often used for SaaS dashboards and admin UIs.",
        "category": "Frontend",
        "license": "MIT / Commercial",
        "cost": "Free / Paid",
        "size": "12 MB",
        "version": "2.2.2",
        "stars": 11000,
        "last_updated": "Updated on 05/11/2024",
        "os": "Cross-platform",
        "tags": [
            "Tailwind",
            "UI Components",
            "Admin Dashboard",
            "Alpine.js",
            "Templates"
        ],
        "source": "https://flowbite.com/"
    },
    {
        "id": "kutty",
        "name": "Kutty UI",
        "description": "Kutty is a Tailwind CSS plugin with accessible and composable components for UI development. It includes alerts, modals, tabs, and form elements that follow accessibility standards and minimal design patterns. Great for developers prioritizing accessibility and simplicity.",
        "category": "Frontend",
        "license": "MIT",
        "cost": "Free",
        "size": "1 MB",
        "version": "1.0.6",
        "stars": 1200,
        "last_updated": "Updated on 05/11/2024",
        "os": "Cross-platform",
        "tags": [
            "Tailwind",
            "Accessible",
            "Minimal",
            "Forms",
            "Alerts"
        ],
        "source": "https://kutty.netlify.app/"
    },
    {
        "id": "tailkit",
        "name": "Tailkit",
        "description": "Tailkit is a premium Tailwind UI component kit that includes over 250+ professionally designed components and page examples. It’s built for React and Laravel developers looking for ready-made admin panels, e-commerce templates, and landing pages with Tailwind styling.",
        "category": "Frontend",
        "license": "Commercial",
        "cost": "Paid",
        "size": "15 MB",
        "version": "1.0.0",
        "stars": 700,
        "last_updated": "Updated on 05/11/2024",
        "os": "Cross-platform",
        "tags": [
            "Tailwind",
            "Premium",
            "Templates",
            "Admin UI",
            "E-commerce"
        ],
        "source": "https://tailkit.com/"
    },
    {
        "id": "tailblocks-ui",
        "name": "Tailblocks UI",
        "description": "Tailblocks UI offers a drag-and-drop editor for designing web pages using Tailwind CSS blocks. It includes responsive UI sections for hero areas, testimonials, call-to-actions, and more. Useful for designers who want low-code Tailwind page design without writing HTML manually.",
        "category": "Frontend",
        "license": "MIT",
        "cost": "Free / Paid",
        "size": "10 MB",
        "version": "1.0.3",
        "stars": 3500,
        "last_updated": "Updated on 05/11/2024",
        "os": "Cross-platform",
        "tags": [
            "Tailwind",
            "Low Code",
            "Landing Pages",
            "Blocks",
            "Drag-and-Drop"
        ],
        "source": "https://tailblocks.cc/"
    },
    {
        "id": "blocks-ui",
        "name": "Blocks UI",
        "description": "Blocks UI is a visual editor for React and MDX that helps build UIs using a drag-and-drop canvas. It integrates with Gatsby and Theme UI to produce clean code as output. Great for teams who want to design and code components visually with custom themes.",
        "category": "Frontend",
        "license": "MIT",
        "cost": "Free",
        "size": "8 MB",
        "version": "0.0.66",
        "stars": 3000,
        "last_updated": "Updated on 05/11/2024",
        "os": "Cross-platform",
        "tags": [
            "React",
            "MDX",
            "Visual Editor",
            "Drag-and-Drop",
            "Theme UI"
        ],
        "source": "https://blocks-ui.com/"
    },
    {
        "id": "grommet",
        "name": "Grommet",
        "description": "Grommet is a React-based framework for responsive and accessible web apps. It offers components like grids, buttons, forms, and data visualizations, all with built-in accessibility support. Grommet is widely used in enterprise apps and design systems.",
        "category": "Frontend",
        "license": "Apache-2.0",
        "cost": "Free",
        "size": "5 MB",
        "version": "2.35.0",
        "stars": 8500,
        "last_updated": "Updated on 05/11/2024",
        "os": "Cross-platform",
        "tags": [
            "React",
            "Accessibility",
            "UI Components",
            "Responsive",
            "Enterprise"
        ],
        "source": "https://v2.grommet.io/"
    },
    {
        "id": "baseweb",
        "name": "Base Web",
        "description": "Base Web is Uber's React component library that provides a robust foundation for scalable web apps. It includes theming, accessibility, and responsive design support. Built with Styletron, Base Web is suited for large applications needing consistency and modularity.",
        "category": "Frontend",
        "license": "MIT",
        "cost": "Free",
        "size": "7 MB",
        "version": "12.25.0",
        "stars": 8300,
        "last_updated": "Updated on 05/11/2024",
        "os": "Cross-platform",
        "tags": [
            "React",
            "Enterprise UI",
            "Theming",
            "Accessibility",
            "Scalable"
        ],
        "source": "https://baseweb.design/"
    },
    {
        "id": "mantine",
        "name": "Mantine",
        "description": "Mantine is a modern React component library with over 100 customizable components, hooks, and dark mode support. It provides out-of-the-box form management, date pickers, modals, notifications, and layout tools. Mantine also supports server-side rendering and works well with Next.js.",
        "category": "Frontend",
        "license": "MIT",
        "cost": "Free",
        "size": "7 MB",
        "version": "7.0.0",
        "stars": 22000,
        "last_updated": "Updated on 05/11/2024",
        "os": "Cross-platform",
        "tags": [
            "React",
            "Component Library",
            "SSR",
            "Forms",
            "Dark Mode"
        ],
        "source": "https://mantine.dev/"
    },
    {
        "id": "react-spectrum",
        "name": "React Spectrum",
        "description": "React Spectrum is Adobe’s design system and component library for React. Built with accessibility, internationalization, and theme support at its core, it powers enterprise-grade applications. It includes data grids, modals, buttons, pickers, and layout utilities.",
        "category": "Frontend",
        "license": "Apache-2.0",
        "cost": "Free",
        "size": "8 MB",
        "version": "3.29.0",
        "stars": 9000,
        "last_updated": "Updated on 05/11/2024",
        "os": "Cross-platform",
        "tags": [
            "React",
            "Adobe",
            "Design System",
            "Accessibility",
            "i18n"
        ],
        "source": "https://react-spectrum.adobe.com/"
    },
    {
        "id": "react95",
        "name": "React95",
        "description": "React95 is a nostalgic React component library that mimics Windows 95 UI elements. It includes classic components like windows, buttons, text fields, and start menus. Great for retro-themed projects and fun UI experiments with a unique aesthetic.",
        "category": "Frontend",
        "license": "MIT",
        "cost": "Free",
        "size": "2 MB",
        "version": "3.1.1",
        "stars": 5700,
        "last_updated": "Updated on 05/11/2024",
        "os": "Cross-platform",
        "tags": [
            "React",
            "Retro",
            "Windows 95",
            "UI Kit",
            "Themed"
        ],
        "source": "https://react95.io/"
    },
    {
        "id": "shadcn-ui",
        "name": "shadcn/ui",
        "description": "shadcn/ui is a modern component library that combines Radix primitives with Tailwind CSS for maximum flexibility. It ships with accessible, themeable components like buttons, cards, forms, and tooltips, designed for use in modern React and Next.js applications.",
        "category": "Frontend",
        "license": "MIT",
        "cost": "Free",
        "size": "3.5 MB",
        "version": "1.0.0",
        "stars": 24000,
        "last_updated": "Updated on 05/11/2024",
        "os": "Cross-platform",
        "tags": [
            "React",
            "Tailwind",
            "Radix",
            "Next.js",
            "Accessible"
        ],
        "source": "https://ui.shadcn.dev/"
    },
    {
        "id": "geist",
        "name": "Geist",
        "description": "Geist is Vercel’s official design system and component library. It provides a set of React components and accompanying styles optimized for clean, consistent, and minimal UI across Vercel products. Geist supports dark mode, typography utilities, and advanced theming.",
        "category": "Frontend",
        "license": "MIT",
        "cost": "Free",
        "size": "2.5 MB",
        "version": "2.3.1",
        "stars": 11000,
        "last_updated": "Updated on 05/11/2024",
        "os": "Cross-platform",
        "tags": [
            "Vercel",
            "React",
            "Design System",
            "Dark Mode",
            "Minimal"
        ],
        "source": "https://geist.vercel.app/"
    },
    {
        "id": "react-admin",
        "name": "React Admin",
        "description": "React Admin is a frontend framework for building admin panels on top of REST and GraphQL APIs. It includes authentication, theming, filtering, pagination, and form generation. It’s widely used in enterprise applications and is customizable with Material UI.",
        "category": "Frontend",
        "license": "MIT / Commercial",
        "cost": "Free / Paid",
        "size": "9 MB",
        "version": "4.12.1",
        "stars": 23000,
        "last_updated": "Updated on 05/11/2024",
        "os": "Cross-platform",
        "tags": [
            "Admin Panel",
            "React",
            "GraphQL",
            "REST",
            "Enterprise"
        ],
        "source": "https://marmelab.com/react-admin/"
    },
    {
        "id": "adminjs",
        "name": "AdminJS",
        "description": "AdminJS is a full-stack admin panel for managing application data, built with Node.js and React. It supports multiple ORMs and databases, custom themes, role-based access control, and Express integration. Ideal for building custom dashboards and back-office tools.",
        "category": "Frontend",
        "license": "MIT",
        "cost": "Free / Paid",
        "size": "12 MB",
        "version": "6.8.0",
        "stars": 6800,
        "last_updated": "Updated on 05/11/2024",
        "os": "Cross-platform",
        "tags": [
            "Admin Panel",
            "Dashboard",
            "React",
            "Node.js",
            "Access Control"
        ],
        "source": "https://adminjs.co/"
    },
    {
        "id": "tabler",
        "name": "Tabler",
        "description": "Tabler is a free and open-source dashboard UI kit with over 100 components built on Bootstrap. It offers pre-built layouts, responsive charts, modals, and form elements, designed for fast development of modern admin interfaces.",
        "category": "Frontend",
        "license": "MIT",
        "cost": "Free",
        "size": "10 MB",
        "version": "1.0.0-beta18",
        "stars": 35000,
        "last_updated": "Updated on 05/11/2024",
        "os": "Cross-platform",
        "tags": [
            "Dashboard",
            "Bootstrap",
            "Admin",
            "Components",
            "UI Kit"
        ],
        "source": "https://tabler.io/"
    },
    {
        "id": "coreui",
        "name": "CoreUI",
        "description": "CoreUI is an open-source Bootstrap admin template with Vue, React, and Angular versions. It provides widgets, charts, icons, and customizable layouts for building responsive dashboards and management interfaces quickly.",
        "category": "Frontend",
        "license": "MIT / Commercial",
        "cost": "Free / Paid",
        "size": "14 MB",
        "version": "5.0.0",
        "stars": 18000,
        "last_updated": "Updated on 05/11/2024",
        "os": "Cross-platform",
        "tags": [
            "Admin",
            "Dashboard",
            "Bootstrap",
            "Templates",
            "Vue",
            "React"
        ],
        "source": "https://coreui.io/"
    },
    {
        "id": "vuestic-ui",
        "name": "Vuestic UI",
        "description": "Vuestic UI is a feature-rich Vue 3 component library designed for dashboards and admin interfaces. It includes ready-to-use charts, tables, and form controls with full theming and responsive support. Ideal for Vue-based enterprise applications.",
        "category": "Frontend",
        "license": "MIT",
        "cost": "Free",
        "size": "6 MB",
        "version": "1.7.6",
        "stars": 9500,
        "last_updated": "Updated on 05/11/2024",
        "os": "Cross-platform",
        "tags": [
            "Vue",
            "Admin UI",
            "Dashboard",
            "Components",
            "Charts"
        ],
        "source": "https://vuestic.dev/"
    },
    {
        "id": "vue-material-admin",
        "name": "Vue Material Admin",
        "description": "Vue Material Admin is a clean and minimal dashboard template based on Vue.js and Vuetify. It comes with charts, authentication pages, and responsive layouts. It’s ideal for projects that require Material Design aesthetics and Vue integration.",
        "category": "Frontend",
        "license": "MIT",
        "cost": "Free / Paid",
        "size": "8 MB",
        "version": "2.1.0",
        "stars": 2600,
        "last_updated": "Updated on 05/11/2024",
        "os": "Cross-platform",
        "tags": [
            "Vue",
            "Vuetify",
            "Material",
            "Dashboard",
            "Responsive"
        ],
        "source": "https://github.com/tookit/vue-material-admin"
    },
    {
        "id": "volt-react-dashboard",
        "name": "Volt React Dashboard",
        "description": "Volt React Dashboard is a free and open-source admin dashboard template built with React and Bootstrap 5. It features chart components, user profile pages, tables, and modals. Great for quick dashboard development using familiar Bootstrap elements.",
        "category": "Frontend",
        "license": "MIT",
        "cost": "Free",
        "size": "9 MB",
        "version": "1.4.2",
        "stars": 2400,
        "last_updated": "Updated on 05/11/2024",
        "os": "Cross-platform",
        "tags": [
            "React",
            "Dashboard",
            "Bootstrap",
            "Charts",
            "Admin UI"
        ],
        "source": "https://github.com/app-generator/react-dashboard-volt"
    },
    {
        "id": "react-bootstrap-admin-template",
        "name": "React Bootstrap Admin Template",
        "description": "A responsive React admin template based on Bootstrap 4 and Reactstrap. It includes pre-built components like tables, cards, forms, and profile pages with flexible layout options. Good for rapid prototyping and business management tools.",
        "category": "Frontend",
        "license": "MIT",
        "cost": "Free / Paid",
        "size": "11 MB",
        "version": "1.3.0",
        "stars": 1200,
        "last_updated": "Updated on 05/11/2024",
        "os": "Cross-platform",
        "tags": [
            "React",
            "Bootstrap",
            "Admin Template",
            "Responsive",
            "UI Kit"
        ],
        "source": "https://github.com/reactstrap/reactstrap-admin-template"
    },
    {
        "id": "light-bootstrap-dashboard-react",
        "name": "Light Bootstrap Dashboard React",
        "description": "Light Bootstrap Dashboard React is a sleek and lightweight admin dashboard template based on React and Bootstrap. It includes table components, modals, charts, and multiple layout pages. Suitable for clean and modern web app backends.",
        "category": "Frontend",
        "license": "MIT",
        "cost": "Free / Paid",
        "size": "8 MB",
        "version": "1.4.0",
        "stars": 1400,
        "last_updated": "Updated on 05/11/2024",
        "os": "Cross-platform",
        "tags": [
            "Dashboard",
            "React",
            "Bootstrap",
            "Admin",
            "Lightweight"
        ],
        "source": "https://github.com/creativetimofficial/light-bootstrap-dashboard-react"
    },
    {
        "id": "datta-able-react",
        "name": "Datta Able React",
        "description": "Datta Able is a clean and elegant React admin dashboard built on Bootstrap 4. It includes over 150 UI components, pre-designed pages, and charts for managing dashboards, analytics, and back-office tools. Ideal for scalable and customizable enterprise dashboards.",
        "category": "Frontend",
        "license": "MIT / Commercial",
        "cost": "Free / Paid",
        "size": "11 MB",
        "version": "1.0.1",
        "stars": 1700,
        "last_updated": "Updated on 05/11/2024",
        "os": "Cross-platform",
        "tags": [
            "React",
            "Admin Dashboard",
            "Bootstrap",
            "Charts",
            "Analytics"
        ],
        "source": "https://github.com/codedthemes/datta-able-free-react-admin-template"
    },
    {
        "id": "notus-react",
        "name": "Notus React",
        "description": "Notus React is a free Tailwind CSS and React UI Kit and admin template developed by Creative Tim. It comes with prebuilt examples, login/register pages, UI components, and charts designed for mobile-first dashboards and landing pages.",
        "category": "Frontend",
        "license": "MIT",
        "cost": "Free",
        "size": "9 MB",
        "version": "1.1.0",
        "stars": 5700,
        "last_updated": "Updated on 05/11/2024",
        "os": "Cross-platform",
        "tags": [
            "React",
            "Tailwind",
            "Admin",
            "Landing Pages",
            "UI Kit"
        ],
        "source": "https://github.com/creativetimofficial/notus-react"
    },
    {
        "id": "argon-dashboard-react",
        "name": "Argon Dashboard React",
        "description": "Argon Dashboard React is a beautifully designed admin panel template using Bootstrap 4 and React. It offers reusable components, custom plugins, and example pages for user management, tables, charts, and authentication flows.",
        "category": "Frontend",
        "license": "MIT",
        "cost": "Free / Paid",
        "size": "10 MB",
        "version": "1.2.0",
        "stars": 3400,
        "last_updated": "Updated on 05/11/2024",
        "os": "Cross-platform",
        "tags": [
            "React",
            "Bootstrap",
            "Dashboard",
            "Components",
            "Authentication"
        ],
        "source": "https://github.com/creativetimofficial/argon-dashboard-react"
    },
    {
        "id": "vue-black-dashboard",
        "name": "Vue Black Dashboard",
        "description": "Vue Black Dashboard is a beautiful, dark-themed admin panel template made with Vue.js and Bootstrap. It features charts, maps, tables, and user profile components. It's perfect for applications requiring a sleek, modern admin interface.",
        "category": "Frontend",
        "license": "MIT",
        "cost": "Free / Paid",
        "size": "8.5 MB",
        "version": "1.0.1",
        "stars": 3000,
        "last_updated": "Updated on 05/11/2024",
        "os": "Cross-platform",
        "tags": [
            "Vue",
            "Bootstrap",
            "Dashboard",
            "Dark Mode",
            "Admin"
        ],
        "source": "https://github.com/creativetimofficial/vue-black-dashboard"
    },
    {
        "id": "windmill-dashboard",
        "name": "Windmill Dashboard",
        "description": "Windmill Dashboard is a multi-theme, fully responsive admin template built with Tailwind CSS and Alpine.js. It includes dashboard UI blocks, chart components, and layout scaffolding, making it suitable for SaaS admin panels and data-heavy applications.",
        "category": "Frontend",
        "license": "MIT",
        "cost": "Free",
        "size": "7.2 MB",
        "version": "1.2.3",
        "stars": 3200,
        "last_updated": "Updated on 05/11/2024",
        "os": "Cross-platform",
        "tags": [
            "Tailwind",
            "Alpine.js",
            "Dashboard",
            "Admin Panel",
            "Dark Mode"
        ],
        "source": "https://github.com/estevanmaito/windmill-dashboard"
    },
    {
        "id": "berry-dashboard-react",
        "name": "Berry Dashboard React",
        "description": "Berry is a free admin dashboard template built using React and MUI (Material-UI). It comes with ready-to-use authentication flows, customizable sidebar layouts, and dashboard widgets for managing users and reports in enterprise systems.",
        "category": "Frontend",
        "license": "MIT / Commercial",
        "cost": "Free / Paid",
        "size": "10 MB",
        "version": "3.0.0",
        "stars": 4800,
        "last_updated": "Updated on 05/11/2024",
        "os": "Cross-platform",
        "tags": [
            "React",
            "Material UI",
            "Dashboard",
            "Authentication",
            "Widgets"
        ],
        "source": "https://github.com/codedthemes/berry-free-react-admin-template"
    },
    {
        "id": "material-kit-react",
        "name": "Material Kit React",
        "description": "Material Kit React is a free UI kit built with Material-UI and React. It includes buttons, inputs, navbars, tabs, and cards with modern design and consistent theming. Useful for dashboards, portfolios, and small business websites.",
        "category": "Frontend",
        "license": "MIT",
        "cost": "Free",
        "size": "6 MB",
        "version": "1.1.0",
        "stars": 5700,
        "last_updated": "Updated on 05/11/2024",
        "os": "Cross-platform",
        "tags": [
            "React",
            "Material Design",
            "UI Kit",
            "Components",
            "Portfolio"
        ],
        "source": "https://github.com/creativetimofficial/material-kit-react"
    },
    {
        "id": "tailwind-admin-template",
        "name": "Tailwind Admin Template",
        "description": "Tailwind Admin Template is a minimalist dashboard layout built using Tailwind CSS. It offers authentication pages, tables, charts, and reusable components for rapid admin panel development with zero JavaScript dependencies.",
        "category": "Frontend",
        "license": "MIT",
        "cost": "Free",
        "size": "3.5 MB",
        "version": "1.0.0",
        "stars": 1600,
        "last_updated": "Updated on 05/11/2024",
        "os": "Cross-platform",
        "tags": [
            "Tailwind",
            "Admin",
            "Dashboard",
            "Minimal",
            "CSS Only"
        ],
        "source": "https://github.com/justboil/admin-tailwind"
    },
    {
        "id": "vue-notus",
        "name": "Notus Vue",
        "description": "Notus Vue is a Vue.js admin dashboard and UI kit using Tailwind CSS. It provides cards, buttons, modals, input fields, and dark/light themes. Ideal for projects using Vue and Tailwind with clean design expectations.",
        "category": "Frontend",
        "license": "MIT",
        "cost": "Free",
        "size": "7 MB",
        "version": "1.1.0",
        "stars": 1800,
        "last_updated": "Updated on 05/11/2024",
        "os": "Cross-platform",
        "tags": [
            "Vue",
            "Tailwind",
            "UI Kit",
            "Admin",
            "Clean Design"
        ],
        "source": "https://github.com/creativetimofficial/notus-vue"
    },
    {
        "id": "vue-material-dashboard",
        "name": "Vue Material Dashboard",
        "description": "Vue Material Dashboard is a Vue.js admin panel based on the Material Design system. It includes Google Maps integration, notifications, responsive tables, and charts. Built on Vue 2 and Vue Router, it’s ideal for simple business dashboards.",
        "category": "Frontend",
        "license": "MIT",
        "cost": "Free / Paid",
        "size": "8 MB",
        "version": "1.3.2",
        "stars": 11000,
        "last_updated": "Updated on 05/11/2024",
        "os": "Cross-platform",
        "tags": [
            "Vue",
            "Material Design",
            "Admin",
            "Vue Router",
            "Charts"
        ],
        "source": "https://github.com/creativetimofficial/vue-material-dashboard"
    },
    {
        "id": "nuxt-dashboard",
        "name": "Nuxt Dashboard",
        "description": "Nuxt Dashboard is a clean and simple dashboard starter built with Nuxt.js and Tailwind CSS. It includes preconfigured layouts, dark mode support, and component examples for charts, navigation, and forms. Ideal for creating fast, modern Vue-based admin UIs.",
        "category": "Frontend",
        "license": "MIT",
        "cost": "Free",
        "size": "6 MB",
        "version": "1.0.0",
        "stars": 1300,
        "last_updated": "Updated on 05/11/2024",
        "os": "Cross-platform",
        "tags": [
            "Nuxt",
            "Vue",
            "Tailwind",
            "Admin Panel",
            "Dashboard"
        ],
        "source": "https://github.com/creativetimofficial/nuxt-dashboard"
    },
    {
        "id": "vue-tailwind-dashboard",
        "name": "Vue Tailwind Dashboard",
        "description": "Vue Tailwind Dashboard is a responsive and customizable admin panel starter built using Vue 3 and Tailwind CSS. It provides layout presets, charts, and data tables, and is perfect for lightweight internal tools and SaaS dashboards.",
        "category": "Frontend",
        "license": "MIT",
        "cost": "Free",
        "size": "4.7 MB",
        "version": "1.0.5",
        "stars": 1400,
        "last_updated": "Updated on 05/11/2024",
        "os": "Cross-platform",
        "tags": [
            "Vue",
            "Tailwind",
            "Dashboard",
            "SaaS",
            "Admin UI"
        ],
        "source": "https://github.com/justboil/vue-tailwind-dashboard"
    },
    {
        "id": "tailadmin",
        "name": "TailAdmin",
        "description": "TailAdmin is a modern Tailwind CSS admin dashboard template featuring charts, forms, tables, and authentication pages. It is highly customizable and includes both free and premium versions for building modern backend tools and analytics portals.",
        "category": "Frontend",
        "license": "MIT / Commercial",
        "cost": "Free / Paid",
        "size": "9 MB",
        "version": "2.0.0",
        "stars": 2300,
        "last_updated": "Updated on 05/11/2024",
        "os": "Cross-platform",
        "tags": [
            "Tailwind",
            "Admin",
            "Analytics",
            "Dashboard",
            "UI Template"
        ],
        "source": "https://tailadmin.com/"
    },
    {
        "id": "vue-argon-dashboard",
        "name": "Vue Argon Dashboard",
        "description": "Vue Argon Dashboard is a beautiful Vue.js admin panel template based on Bootstrap 4 and Argon Design System. It includes fully coded pages, reusable components, charts, and plugins, making it perfect for quick Vue-based project setups.",
        "category": "Frontend",
        "license": "MIT",
        "cost": "Free / Paid",
        "size": "7.2 MB",
        "version": "1.2.0",
        "stars": 3500,
        "last_updated": "Updated on 05/11/2024",
        "os": "Cross-platform",
        "tags": [
            "Vue",
            "Bootstrap",
            "Admin UI",
            "Argon",
            "Charts"
        ],
        "source": "https://github.com/creativetimofficial/vue-argon-dashboard"
    },
    {
        "id": "voler",
        "name": "Voler",
        "description": "Voler is a simple and lightweight Bootstrap 5 admin dashboard template. It provides basic layout structure, prebuilt widgets, and essential components like tables, modals, and sidebars, suited for basic internal tools and small admin panels.",
        "category": "Frontend",
        "license": "MIT",
        "cost": "Free",
        "size": "5 MB",
        "version": "1.0.0",
        "stars": 1000,
        "last_updated": "Updated on 05/11/2024",
        "os": "Cross-platform",
        "tags": [
            "Bootstrap",
            "Admin",
            "Simple",
            "Responsive",
            "Internal Tools"
        ],
        "source": "https://github.com/zuramai/voler"
    },
    {
        "id": "nice-admin-lite",
        "name": "Nice Admin Lite",
        "description": "Nice Admin Lite is a basic version of the Nice Admin dashboard template based on Bootstrap 5. It includes chart libraries, responsive widgets, and a starter UI for developing basic analytics dashboards and control panels.",
        "category": "Frontend",
        "license": "MIT / Commercial",
        "cost": "Free / Paid",
        "size": "9 MB",
        "version": "1.0.0",
        "stars": 1600,
        "last_updated": "Updated on 05/11/2024",
        "os": "Cross-platform",
        "tags": [
            "Bootstrap",
            "Dashboard",
            "Lite Version",
            "Widgets",
            "Charts"
        ],
        "source": "https://github.com/wrappixel/nice-admin-lite"
    },
    {
        "id": "matrix-admin",
        "name": "Matrix Admin",
        "description": "Matrix Admin is a feature-rich dashboard template built on Bootstrap 5. It includes multiple layout versions, UI elements, icons, tables, and forms. Used for developing internal systems, analytics dashboards, and SaaS admin panels.",
        "category": "Frontend",
        "license": "MIT / Commercial",
        "cost": "Free / Paid",
        "size": "11 MB",
        "version": "1.0.2",
        "stars": 1800,
        "last_updated": "Updated on 05/11/2024",
        "os": "Cross-platform",
        "tags": [
            "Bootstrap",
            "Admin",
            "SaaS",
            "Internal Tools",
            "UI Blocks"
        ],
        "source": "https://github.com/wrappixel/matrix-bootstrap-dashboard"
    },
    {
        "id": "soft-ui-dashboard-react",
        "name": "Soft UI Dashboard React",
        "description": "Soft UI Dashboard React is a sleek, modern dashboard template built on React and Material UI. It includes charts, forms, calendars, notifications, and ready-to-use user management pages, designed for SaaS and admin platforms.",
        "category": "Frontend",
        "license": "MIT / Commercial",
        "cost": "Free / Paid",
        "size": "12 MB",
        "version": "1.0.1",
        "stars": 2900,
        "last_updated": "Updated on 05/11/2024",
        "os": "Cross-platform",
        "tags": [
            "React",
            "Material UI",
            "Admin Panel",
            "SaaS",
            "Soft UI"
        ],
        "source": "https://github.com/creativetimofficial/soft-ui-dashboard-react"
    },
    {
        "id": "sneat-vue-dashboard",
        "name": "Sneat Vue Dashboard",
        "description": "Sneat is a modern Vue 3 admin dashboard template with clean design, light/dark themes, and UI components. It includes form validation, charts, and authentication support. Ideal for data-heavy enterprise applications and admin tools.",
        "category": "Frontend",
        "license": "MIT / Commercial",
        "cost": "Free / Paid",
        "size": "10 MB",
        "version": "1.0.0",
        "stars": 2200,
        "last_updated": "Updated on 05/11/2024",
        "os": "Cross-platform",
        "tags": [
            "Vue 3",
            "Dashboard",
            "Dark Mode",
            "Enterprise",
            "Forms"
        ],
        "source": "https://themeselection.com/item/sneat-vue-admin-dashboard-template"
    },
    {
        "id": "material-dashboard-react",
        "name": "Material Dashboard React",
        "description": "Material Dashboard React is a free React admin panel template based on Material UI. It features Google Maps integration, vector charts, tables, forms, and profile pages. Well-suited for management dashboards, CRM tools, and SaaS apps.",
        "category": "Frontend",
        "license": "MIT / Commercial",
        "cost": "Free / Paid",
        "size": "11 MB",
        "version": "1.3.1",
        "stars": 7600,
        "last_updated": "Updated on 05/11/2024",
        "os": "Cross-platform",
        "tags": [
            "React",
            "Material UI",
            "Dashboard",
            "CRM",
            "Admin"
        ],
        "source": "https://github.com/creativetimofficial/material-dashboard-react"
    },
    {
        "id": "atlantis-lite-react",
        "name": "Atlantis Lite React",
        "description": "Atlantis Lite React is a lightweight and free React admin template featuring charts, tables, and forms. It offers basic UI blocks and layout examples suited for internal tools, CMS dashboards, and backend portals.",
        "category": "Frontend",
        "license": "MIT / Commercial",
        "cost": "Free / Paid",
        "size": "9 MB",
        "version": "1.0.0",
        "stars": 1500,
        "last_updated": "Updated on 05/11/2024",
        "os": "Cross-platform",
        "tags": [
            "React",
            "Admin Template",
            "Internal Tools",
            "CMS",
            "Lightweight"
        ],
        "source": "https://github.com/themekita/atlantis-lite-react"
    },
    {
        "id": "argon-dashboard-bootstrap",
        "name": "Argon Dashboard Bootstrap",
        "description": "Argon Dashboard Bootstrap is a responsive Bootstrap 4 admin panel with ready-made cards, user flows, authentication pages, and form validation. Useful for full-stack apps requiring sleek dashboard UIs.",
        "category": "Frontend",
        "license": "MIT",
        "cost": "Free",
        "size": "10 MB",
        "version": "1.2.2",
        "stars": 3800,
        "last_updated": "Updated on 05/11/2024",
        "os": "Cross-platform",
        "tags": [
            "Bootstrap",
            "Dashboard",
            "Forms",
            "Authentication",
            "Admin"
        ],
        "source": "https://github.com/creativetimofficial/argon-dashboard"
    },
    {
        "id": "focus-bootstrap-admin",
        "name": "Focus Bootstrap Admin",
        "description": "Focus Bootstrap Admin is a flat admin dashboard template using Bootstrap 4. It includes charts, widgets, and email inbox templates and is best used for building back-office and CRM tools.",
        "category": "Frontend",
        "license": "MIT / Commercial",
        "cost": "Free / Paid",
        "size": "8 MB",
        "version": "1.3.0",
        "stars": 1900,
        "last_updated": "Updated on 05/11/2024",
        "os": "Cross-platform",
        "tags": [
            "Bootstrap",
            "Admin",
            "CRM",
            "Charts",
            "Email Templates"
        ],
        "source": "https://github.com/dashforge/focus-bootstrap-admin"
    },
    {
        "id": "skote-react",
        "name": "Skote React",
        "description": "Skote React is a premium admin dashboard template built using React and Redux. It includes ecommerce layouts, Kanban boards, calendar views, chat modules, and dark mode. Ideal for SaaS applications and backend systems.",
        "category": "Frontend",
        "license": "Commercial",
        "cost": "Paid",
        "size": "15 MB",
        "version": "2.4.0",
        "stars": 1200,
        "last_updated": "Updated on 05/11/2024",
        "os": "Cross-platform",
        "tags": [
            "React",
            "Redux",
            "SaaS",
            "Kanban",
            "Dark Mode"
        ],
        "source": "https://themesbrand.com/skote-react"
    },
    {
        "id": "vuexy-react",
        "name": "Vuexy React",
        "description": "Vuexy React is a developer-friendly and customizable React admin template. It includes Laravel integration, JWT auth, charts, email modules, and eCommerce dashboards. Perfect for enterprise and cross-platfor apps.",
        "category": "Frontend",
        "license": "Commercial",
        "cost": "Paid",
        "size": "17 MB",
        "version": "3.2.1",
        "stars": 2100,
        "last_updated": "Updated on 05/11/2024",
        "os": "Cross-platform",
        "tags": [
            "React",
            "eCommerce",
            "Laravel",
            "Admin UI",
            "JWT"
        ],
        "source": "https://pixinvent.com/demo/vuexy-react-admin-dashboard-template"
    },
    {
        "id": "dashkit",
        "name": "Dashkit",
        "description": "Dashkit is a flexible and clean dashboard UI template for developers. Built on Bootstrap 4, it supports charts, tables, notifications, and form validations. Useful for analytics and internal project dashboards.",
        "category": "Frontend",
        "license": "Commercial",
        "cost": "Paid",
        "size": "12 MB",
        "version": "1.5.3",
        "stars": 1700,
        "last_updated": "Updated on 05/11/2024",
        "os": "Cross-platform",
        "tags": [
            "Bootstrap",
            "Charts",
            "Dashboard",
            "Clean UI",
            "Notifications"
        ],
        "source": "https://themes.getbootstrap.com/product/dashkit"
    },
    {
        "id": "metronic",
        "name": "Metronic",
        "description": "Metronic is one of the most popular admin dashboard themes with versions in React, Angular, Vue, and HTML. It includes layout generators, RTL support, ecommerce features, and enterprise-ready integrations.",
        "category": "Frontend",
        "license": "Commercial",
        "cost": "Paid",
        "size": "25 MB",
        "version": "8.1.6",
        "stars": 5800,
        "last_updated": "Updated on 05/11/2024",
        "os": "Cross-platform",
        "tags": [
            "Admin",
            "Enterprise",
            "Multiframe",
            "eCommerce",
            "Responsive"
        ],
        "source": "https://keenthemes.com/metronic"
    },
    {
        "id": "material-dashboard-angular",
        "name": "Material Dashboard Angular",
        "description": "Material Dashboard Angular is a fully responsive admin dashboard template built with Angular and Google’s Material Design. It includes over 60 components, customizable pages, and charts for building robust web apps.",
        "category": "Frontend",
        "license": "MIT",
        "cost": "Free / Paid",
        "size": "11 MB",
        "version": "2.5.0",
        "stars": 6200,
        "last_updated": "Updated on 05/11/2024",
        "os": "Cross-platform",
        "tags": [
            "Angular",
            "Material Design",
            "Dashboard",
            "Charts",
            "Admin UI"
        ],
        "source": "https://github.com/creativetimofficial/material-dashboard-angular2"
    },
    {
        "id": "ng-dash",
        "name": "Ng-Dash",
        "description": "Ng-Dash is an Angular admin dashboard with responsive UI, prebuilt modules, and clean architecture. It includes collapsible sidebars, UI widgets, and Angular forms integration — ideal for mid-scale admin panels.",
        "category": "Frontend",
        "license": "Commercial",
        "cost": "Paid",
        "size": "10 MB",
        "version": "1.1.1",
        "stars": 800,
        "last_updated": "Updated on 05/11/2024",
        "os": "Cross-platform",
        "tags": [
            "Angular",
            "Admin Panel",
            "Responsive",
            "Widgets",
            "Forms"
        ],
        "source": "https://ng-dash.wrappixel.com/"
    },
    {
        "id": "ngx-admin",
        "name": "ngx-admin",
        "description": "ngx-admin is a full-featured Angular dashboard template with support for Bootstrap and Nebular. It features auth modules, role-based access, smart tables, and responsive layout options. Best suited for admin systems, CMSs, and enterprise tools.",
        "category": "Frontend",
        "license": "MIT",
        "cost": "Free",
        "size": "14 MB",
        "version": "9.0.0",
        "stars": 25000,
        "last_updated": "Updated on 05/11/2024",
        "os": "Cross-platform",
        "tags": [
            "Angular",
            "Dashboard",
            "Nebular",
            "Bootstrap",
            "CMS"
        ],
        "source": "https://github.com/akveo/ngx-admin"
    },
    {
        "id": "vue-final-modal",
        "name": "Vue Final Modal",
        "description": "Vue Final Modal is a powerful, flexible modal component for Vue 3 and 2. It supports SSR, teleport, multiple instances, transitions, and dynamic modals with asynchronous logic. Useful for custom dialog flows, confirmation boxes, and form modals in Vue apps.",
        "category": "Frontend",
        "license": "MIT",
        "cost": "Free",
        "size": "800 KB",
        "version": "3.5.1",
        "stars": 1300,
        "last_updated": "Updated on 05/11/2024",
        "os": "Cross-platform",
        "tags": [
            "Vue",
            "Modal",
            "Teleport",
            "Transitions",
            "Dialog"
        ],
        "source": "https://vue-final-modal.org/"
    },
    {
        "id": "vue-js-toggle-button",
        "name": "Vue.js Toggle Button",
        "description": "Vue.js Toggle Button is a simple, customizable toggle switch component for Vue.js. It supports both v-model binding and custom styles, making it useful for forms, preference panels, and settings toggles in Vue applications.",
        "category": "Frontend",
        "license": "MIT",
        "cost": "Free",
        "size": "300 KB",
        "version": "1.3.3",
        "stars": 1300,
        "last_updated": "Updated on 05/11/2024",
        "os": "Cross-platform",
        "tags": [
            "Vue",
            "Toggle",
            "Switch",
            "Forms",
            "UI Component"
        ],
        "source": "https://github.com/euvl/vue-js-toggle-button"
    },
    {
        "id": "vue-loading-overlay",
        "name": "Vue Loading Overlay",
        "description": "Vue Loading Overlay provides animated loading indicators that can be used globally or inside components. It supports custom messages, color themes, and full-screen overlays. Ideal for AJAX loading, form submission feedback, and async content.",
        "category": "Frontend",
        "license": "MIT",
        "cost": "Free",
        "size": "450 KB",
        "version": "6.0.3",
        "stars": 2100,
        "last_updated": "Updated on 05/11/2024",
        "os": "Cross-platform",
        "tags": [
            "Vue",
            "Loading",
            "Overlay",
            "Spinner",
            "Async"
        ],
        "source": "https://github.com/ankurk91/vue-loading-overlay"
    },
    {
        "id": "vue-tabs-component",
        "name": "Vue Tabs Component",
        "description": "Vue Tabs Component is a simple and highly customizable tab container for Vue. It supports nested tabs, slots, and dynamic content loading, making it suitable for dashboards, profile sections, and admin panels.",
        "category": "Frontend",
        "license": "MIT",
        "cost": "Free",
        "size": "400 KB",
        "version": "2.0.0",
        "stars": 800,
        "last_updated": "Updated on 05/11/2024",
        "os": "Cross-platform",
        "tags": [
            "Vue",
            "Tabs",
            "Dynamic Content",
            "Slot",
            "Dashboard"
        ],
        "source": "https://github.com/spatie/vue-tabs-component"
    },
    {
        "id": "vue-color",
        "name": "Vue Color",
        "description": "Vue Color is a collection of color pickers from Sketch, Photoshop, Chrome, and others implemented for Vue.js. It supports alpha sliders, saturation inputs, and customizable palettes, useful for design tools and theme configurators.",
        "category": "Frontend",
        "license": "MIT",
        "cost": "Free",
        "size": "1 MB",
        "version": "2.8.1",
        "stars": 2300,
        "last_updated": "Updated on 05/11/2024",
        "os": "Cross-platform",
        "tags": [
            "Vue",
            "Color Picker",
            "UI",
            "Design",
            "Sketch"
        ],
        "source": "https://github.com/xiaokaike/vue-color"
    },
    {
        "id": "vue-toast-notification",
        "name": "Vue Toast Notification",
        "description": "Vue Toast Notification provides lightweight, animated toast messages for Vue apps. It supports positioning, themes, icons, and auto-dismiss functionality, and is ideal for alerts, feedback messages, and system notifications.",
        "category": "Frontend",
        "license": "MIT",
        "cost": "Free",
        "size": "500 KB",
        "version": "3.0.1",
        "stars": 1200,
        "last_updated": "Updated on 05/11/2024",
        "os": "Cross-platform",
        "tags": [
            "Vue",
            "Toast",
            "Notification",
            "Alert",
            "Feedback"
        ],
        "source": "https://github.com/ankurk91/vue-toast-notification"
    },
    {
        "id": "vue-json-pretty",
        "name": "Vue JSON Pretty",
        "description": "Vue JSON Pretty is a Vue component for displaying JSON data in a readable, colorful, and collapsible format. It’s useful for debugging, API explorers, developer tools, and config editors in Vue applications.",
        "category": "Frontend",
        "license": "MIT",
        "cost": "Free",
        "size": "400 KB",
        "version": "3.1.0",
        "stars": 1000,
        "last_updated": "Updated on 05/11/2024",
        "os": "Cross-platform",
        "tags": [
            "Vue",
            "JSON Viewer",
            "Developer Tool",
            "Formatting",
            "Debugging"
        ],
        "source": "https://github.com/leezng/vue-json-pretty"
    },
    {
        "id": "vue-context",
        "name": "Vue Context",
        "description": "Vue Context is a simple yet customizable right-click context menu component for Vue. It supports nested menus, icons, and programmatic control. Useful for file managers, dashboards, and interactive UIs.",
        "category": "Frontend",
        "license": "MIT",
        "cost": "Free",
        "size": "350 KB",
        "version": "5.0.0",
        "stars": 900,
        "last_updated": "Updated on 05/11/2024",
        "os": "Cross-platform",
        "tags": [
            "Vue",
            "Context Menu",
            "Right Click",
            "Nested",
            "Custom Menu"
        ],
        "source": "https://github.com/rawilk/vue-context"
    },
    {
        "id": "vue-slider-component",
        "name": "Vue Slider Component",
        "description": "Vue Slider Component is a highly customizable slider control for Vue.js. It supports range selection, tooltips, vertical mode, and custom styling. It's great for filters, settings panels, and input ranges in modern UIs.",
        "category": "Frontend",
        "license": "MIT",
        "cost": "Free",
        "size": "700 KB",
        "version": "4.0.0",
        "stars": 2700,
        "last_updated": "Updated on 05/11/2024",
        "os": "Cross-platform",
        "tags": [
            "Vue",
            "Slider",
            "Range",
            "Forms",
            "Interactive"
        ],
        "source": "https://github.com/NightCatSama/vue-slider-component"
    },
    {
        "id": "vue-good-table",
        "name": "Vue Good Table",
        "description": "Vue Good Table is a powerful and flexible table component for Vue with support for sorting, filtering, pagination, and inline editing. It's ideal for data-heavy apps, admin dashboards, and content management systems.",
        "category": "Frontend",
        "license": "MIT",
        "cost": "Free",
        "size": "1.1 MB",
        "version": "2.23.0",
        "stars": 2900,
        "last_updated": "Updated on 05/11/2024",
        "os": "Cross-platform",
        "tags": [
            "Vue",
            "Table",
            "Data Grid",
            "Sorting",
            "Pagination"
        ],
        "source": "https://xaksis.github.io/vue-good-table/"
    },
    {
        "id": "vue-good-table-next",
        "name": "Vue Good Table Next",
        "description": "Vue Good Table Next is the Vue 3-compatible version of the original Vue Good Table. It offers powerful data table features like sorting, searching, filtering, pagination, and expandable rows with high performance and minimal setup.",
        "category": "Frontend",
        "license": "MIT",
        "cost": "Free",
        "size": "1.2 MB",
        "version": "3.0.2",
        "stars": 900,
        "last_updated": "Updated on 05/11/2024",
        "os": "Cross-platform",
        "tags": [
            "Vue 3",
            "Table",
            "Data Grid",
            "Filtering",
            "Pagination"
        ],
        "source": "https://github.com/hosseinmd/vue-good-table-next"
    },
    {
        "id": "vue-advanced-cropper",
        "name": "Vue Advanced Cropper",
        "description": "Vue Advanced Cropper is a robust image cropping tool for Vue.js. It supports custom aspect ratios, zooming, rotation, canvas-based transformations, and overlays. Ideal for image upload workflows in dashboards and CMSs.",
        "category": "Frontend",
        "license": "MIT",
        "cost": "Free",
        "size": "1.5 MB",
        "version": "2.8.3",
        "stars": 1600,
        "last_updated": "Updated on 05/11/2024",
        "os": "Cross-platform",
        "tags": [
            "Vue",
            "Image Cropper",
            "Canvas",
            "Upload",
            "Photo Editing"
        ],
        "source": "https://advanced-cropper.github.io/vue-advanced-cropper/"
    },
    {
        "id": "vue-sweetalert2",
        "name": "Vue Sweetalert2",
        "description": "Vue Sweetalert2 is a wrapper for the popular SweetAlert2 library that brings beautiful and customizable alert boxes to Vue applications. It supports modals, confirmations, input prompts, and auto-dismissed notifications.",
        "category": "Frontend",
        "license": "MIT",
        "cost": "Free",
        "size": "650 KB",
        "version": "5.0.7",
        "stars": 1600,
        "last_updated": "Updated on 05/11/2024",
        "os": "Cross-platform",
        "tags": [
            "Vue",
            "SweetAlert2",
            "Alerts",
            "Modals",
            "Notifications"
        ],
        "source": "https://github.com/avil13/vue-sweetalert2"
    },
    {
        "id": "vue-scrollto",
        "name": "Vue ScrollTo",
        "description": "Vue ScrollTo is a lightweight, dependency-free plugin for smooth scrolling in Vue.js apps. It enables animated navigation between elements with options for easing, offset, and duration. Useful for single-page apps and landing pages.",
        "category": "Frontend",
        "license": "MIT",
        "cost": "Free",
        "size": "320 KB",
        "version": "2.20.0",
        "stars": 2200,
        "last_updated": "Updated on 05/11/2024",
        "os": "Cross-platform",
        "tags": [
            "Vue",
            "Smooth Scroll",
            "Animation",
            "Single Page",
            "Navigation"
        ],
        "source": "https://github.com/rigor789/vue-scrollto"
    },
    {
        "id": "vue-page-transition",
        "name": "Vue Page Transition",
        "description": "Vue Page Transition provides animated transitions between routes or components in Vue apps. It supports various CSS and JavaScript-based effects like fades, slides, and zooms. Ideal for SPAs looking for smooth UX transitions.",
        "category": "Frontend",
        "license": "MIT",
        "cost": "Free",
        "size": "500 KB",
        "version": "1.2.3",
        "stars": 600,
        "last_updated": "Updated on 05/11/2024",
        "os": "Cross-platform",
        "tags": [
            "Vue",
            "Transitions",
            "Routing",
            "Animation",
            "SPA"
        ],
        "source": "https://github.com/Orlandster/vue-page-transition"
    },
    {
        "id": "vue-virtual-scroller",
        "name": "Vue Virtual Scroller",
        "description": "Vue Virtual Scroller is a high-performance scrolling component for large lists. It renders only the visible items, reducing DOM load and improving performance. Ideal for tables, feeds, and data grids with thousands of rows.",
        "category": "Frontend",
        "license": "MIT",
        "cost": "Free",
        "size": "750 KB",
        "version": "2.0.0",
        "stars": 2900,
        "last_updated": "Updated on 05/11/2024",
        "os": "Cross-platform",
        "tags": [
            "Vue",
            "Virtual Scrolling",
            "Performance",
            "Lists",
            "Tables"
        ],
        "source": "https://github.com/Akryum/vue-virtual-scroller"
    },
    {
        "id": "vue2-datepicker",
        "name": "Vue2 Datepicker",
        "description": "Vue2 Datepicker is a customizable and lightweight date and time picker for Vue.js 2. It supports localization, range selection, inline display, and shortcuts. Great for form UIs requiring flexible date input handling.",
        "category": "Frontend",
        "license": "MIT",
        "cost": "Free",
        "size": "550 KB",
        "version": "3.11.0",
        "stars": 1800,
        "last_updated": "Updated on 05/11/2024",
        "os": "Cross-platform",
        "tags": [
            "Vue",
            "Date Picker",
            "Forms",
            "Localization",
            "Range Picker"
        ],
        "source": "https://github.com/mengxiong10/vue2-datepicker"
    },
    {
        "id": "vue-tooltip",
        "name": "Vue Tooltip",
        "description": "Vue Tooltip is a Vue directive and component for creating lightweight, customizable tooltips. It supports HTML content, themes, placement control, and delay settings. Ideal for adding contextual help or hints to UI elements.",
        "category": "Frontend",
        "license": "MIT",
        "cost": "Free",
        "size": "400 KB",
        "version": "2.0.2",
        "stars": 1300,
        "last_updated": "Updated on 05/11/2024",
        "os": "Cross-platform",
        "tags": [
            "Vue",
            "Tooltip",
            "UI Hint",
            "Custom Theme",
            "Overlay"
        ],
        "source": "https://github.com/Akryum/vue-tooltip"
    },
    {
        "id": "vue-the-mask",
        "name": "Vue The Mask",
        "description": "Vue The Mask provides input masking functionality for Vue 2 and 3 applications. It allows formatting of user inputs like phone numbers, dates, or currency with minimal setup and v-mask directive support.",
        "category": "Frontend",
        "license": "MIT",
        "cost": "Free",
        "size": "300 KB",
        "version": "0.11.1",
        "stars": 2500,
        "last_updated": "Updated on 05/11/2024",
        "os": "Cross-platform",
        "tags": [
            "Vue",
            "Input Mask",
            "Forms",
            "Validation",
            "v-mask"
        ],
        "source": "https://github.com/vuejs-tips/vue-the-mask"
    },
    {
        "id": "vue-content-loader",
        "name": "Vue Content Loader",
        "description": "Vue Content Loader allows developers to create customizable SVG skeleton screens to improve loading UX. It replicates the layout of content while it loads, with animation and theming support. Inspired by Facebook’s content placeholder design.",
        "category": "Frontend",
        "license": "MIT",
        "cost": "Free",
        "size": "550 KB",
        "version": "0.3.4",
        "stars": 3300,
        "last_updated": "Updated on 05/11/2024",
        "os": "Cross-platform",
        "tags": [
            "Vue",
            "Skeleton Loader",
            "SVG",
            "Placeholder",
            "Loading"
        ],
        "source": "https://github.com/egoist/vue-content-loader"
    },
    {
        "id": "vue-autosuggest",
        "name": "Vue Autosuggest",
        "description": "Vue Autosuggest is a flexible autocomplete component for Vue.js. It supports asynchronous data sources, keyboard navigation, custom rendering, and multiple suggestion sections. Ideal for search bars, form inputs, and command palettes.",
        "category": "Frontend",
        "license": "MIT",
        "cost": "Free",
        "size": "600 KB",
        "version": "2.2.1",
        "stars": 1700,
        "last_updated": "Updated on 05/11/2024",
        "os": "Cross-platform",
        "tags": [
            "Vue",
            "Autocomplete",
            "Search",
            "Forms",
            "Async"
        ],
        "source": "https://github.com/Educents/vue-autosuggest"
    },
    {
        "id": "vue-infinite-loading",
        "name": "Vue Infinite Loading",
        "description": "Vue Infinite Loading is an infinite scroll component for Vue 2 that detects when a user has scrolled to the bottom of a container and triggers a callback. Supports loading indicators, error retry, and customizable messages.",
        "category": "Frontend",
        "license": "MIT",
        "cost": "Free",
        "size": "700 KB",
        "version": "2.4.5",
        "stars": 2600,
        "last_updated": "Updated on 05/11/2024",
        "os": "Cross-platform",
        "tags": [
            "Vue",
            "Infinite Scroll",
            "Lazy Load",
            "Pagination",
            "List"
        ],
        "source": "https://github.com/PeachScript/vue-infinite-loading"
    },
    {
        "id": "vue-drag-resize",
        "name": "Vue Drag Resize",
        "description": "Vue Drag Resize is a Vue component that allows elements to be dragged, resized, and rotated within a container. It supports snapping, aspect ratio locking, and handles customization. Useful for design apps and editors.",
        "category": "Frontend",
        "license": "MIT",
        "cost": "Free",
        "size": "950 KB",
        "version": "2.0.0",
        "stars": 1800,
        "last_updated": "Updated on 05/11/2024",
        "os": "Cross-platform",
        "tags": [
            "Vue",
            "Drag",
            "Resize",
            "Design Tools",
            "Custom Layout"
        ],
        "source": "https://github.com/kirillmurashov/vue-drag-resize"
    },
    {
        "id": "vue-multiselect",
        "name": "Vue Multiselect",
        "description": "Vue Multiselect is a powerful select/dropdown component for Vue.js. It supports single and multiple selection, tagging, filtering, search, and asynchronous options. Ideal for form-heavy applications and complex filter UIs.",
        "category": "Frontend",
        "license": "MIT",
        "cost": "Free",
        "size": "1 MB",
        "version": "2.1.6",
        "stars": 9600,
        "last_updated": "Updated on 05/11/2024",
        "os": "Cross-platform",
        "tags": [
            "Vue",
            "Select",
            "Dropdown",
            "Tags",
            "Async Options"
        ],
        "source": "https://vue-multiselect.js.org/"
    },
    {
        "id": "vue-tags-input",
        "name": "Vue Tags Input",
        "description": "Vue Tags Input is a Vue component for managing user-generated tags. It supports custom validation, autocomplete suggestions, deletions, and max limits. Often used in tagging systems, CMSs, and filter builders.",
        "category": "Frontend",
        "license": "MIT",
        "cost": "Free",
        "size": "550 KB",
        "version": "2.0.1",
        "stars": 1100,
        "last_updated": "Updated on 05/11/2024",
        "os": "Cross-platform",
        "tags": [
            "Vue",
            "Tags",
            "Forms",
            "Autocomplete",
            "Input Field"
        ],
        "source": "https://github.com/JohMun/vue-tags-input"
    },
    {
        "id": "vue-select",
        "name": "Vue Select",
        "description": "Vue Select is a feature-rich select box component with support for single/multi-select, search, tagging, and custom options. It is accessible, keyboard-navigable, and widely used in both small forms and enterprise dashboards.",
        "category": "Frontend",
        "license": "MIT",
        "cost": "Free",
        "size": "1.2 MB",
        "version": "4.0.0",
        "stars": 4100,
        "last_updated": "Updated on 05/11/2024",
        "os": "Cross-platform",
        "tags": [
            "Vue",
            "Select",
            "Dropdown",
            "Tags",
            "Custom Options"
        ],
        "source": "https://vue-select.org/"
    },
    {
        "id": "vue-quill-editor",
        "name": "Vue Quill Editor",
        "description": "Vue Quill Editor is a rich text editor component for Vue based on the Quill.js core. It supports custom toolbars, themes, syntax highlighting, and events. Ideal for blogs, CMSs, and form-based rich content editors.",
        "category": "Frontend",
        "license": "MIT",
        "cost": "Free",
        "size": "2 MB",
        "version": "3.0.0",
        "stars": 3400,
        "last_updated": "Updated on 05/11/2024",
        "os": "Cross-platform",
        "tags": [
            "Vue",
            "Text Editor",
            "Quill",
            "Rich Text",
            "CMS"
        ],
        "source": "https://github.com/surmon-china/vue-quill-editor"
    },
    {
        "id": "vue-editor-js",
        "name": "Vue Editor.js",
        "description": "Vue Editor.js is a wrapper for the Editor.js block-style content editor in Vue.js. It supports blocks for headers, images, lists, embeds, and more. Perfect for creating structured content editing UIs inside Vue applications.",
        "category": "Frontend",
        "license": "MIT",
        "cost": "Free",
        "size": "1.5 MB",
        "version": "2.1.4",
        "stars": 1000,
        "last_updated": "Updated on 05/11/2024",
        "os": "Cross-platform",
        "tags": [
            "Vue",
            "Editor",
            "Blocks",
            "Structured Content",
            "CMS"
        ],
        "source": "https://github.com/ChangJoo-Park/vue-editor-js"
    },
    {
        "id": "vue-wysiwyg",
        "name": "Vue WYSIWYG",
        "description": "Vue WYSIWYG is a lightweight what-you-see-is-what-you-get rich text editor built for Vue.js. It provides simple toolbars for formatting, links, and images, suitable for comment boxes, blogs, and user-generated content.",
        "category": "Frontend",
        "license": "MIT",
        "cost": "Free",
        "size": "1 MB",
        "version": "2.0.0",
        "stars": 1900,
        "last_updated": "Updated on 05/11/2024",
        "os": "Cross-platform",
        "tags": [
            "Vue",
            "WYSIWYG",
            "Text Editor",
            "Formatting",
            "Input"
        ],
        "source": "https://github.com/chmln/vue-wysiwyg"
    },
    {
        "id": "vue-image-lightbox",
        "name": "Vue Image Lightbox",
        "description": "Vue Image Lightbox is a responsive and touch-friendly lightbox component for displaying images in full screen. It supports image groups, navigation arrows, keyboard control, and swipe gestures for mobile.",
        "category": "Frontend",
        "license": "MIT",
        "cost": "Free",
        "size": "850 KB",
        "version": "2.1.0",
        "stars": 1700,
        "last_updated": "Updated on 05/11/2024",
        "os": "Cross-platform",
        "tags": [
            "Vue",
            "Lightbox",
            "Image Viewer",
            "Fullscreen",
            "Touch"
        ],
        "source": "https://github.com/pexea12/vue-image-lightbox"
    },
    {
        "id": "vue-js-modal",
        "name": "Vue-js-modal",
        "description": "Vue-js-modal is a lightweight and customizable modal library for Vue.js. It supports dynamic content, nested modals, transitions, and advanced configuration options. Ideal for dialog boxes, confirmation prompts, and modal-based workflows in Vue apps.",
        "category": "Frontend",
        "license": "MIT",
        "cost": "Free",
        "size": "850 KB",
        "version": "2.0.1",
        "stars": 4600,
        "last_updated": "Updated on 05/11/2024",
        "os": "Cross-platform",
        "tags": [
            "Vue",
            "Modal",
            "Dialog",
            "Transitions",
            "Overlay"
        ],
        "source": "https://github.com/euvl/vue-js-modal"
    },
    {
        "id": "vue-slick-carousel",
        "name": "Vue Slick Carousel",
        "description": "Vue Slick Carousel is a Vue wrapper for the popular Slick carousel. It supports autoplay, responsive design, infinite looping, and navigation controls. Great for image sliders, featured products, and testimonials.",
        "category": "Frontend",
        "license": "MIT",
        "cost": "Free",
        "size": "1 MB",
        "version": "1.1.18",
        "stars": 1500,
        "last_updated": "Updated on 05/11/2024",
        "os": "Cross-platform",
        "tags": [
            "Vue",
            "Carousel",
            "Slider",
            "Images",
            "Responsive"
        ],
        "source": "https://github.com/staskjs/vue-slick-carousel"
    },
    {
        "id": "vue-carousel-3d",
        "name": "Vue Carousel 3D",
        "description": "Vue Carousel 3D is a Vue component for creating 3D carousel effects with customizable depth, tilt, and navigation. It's suitable for product showcases, galleries, and modern visual presentations.",
        "category": "Frontend",
        "license": "MIT",
        "cost": "Free",
        "size": "850 KB",
        "version": "1.0.2",
        "stars": 1600,
        "last_updated": "Updated on 05/11/2024",
        "os": "Cross-platform",
        "tags": [
            "Vue",
            "Carousel",
            "3D",
            "Slider",
            "Gallery"
        ],
        "source": "https://github.com/Wlada/vue-carousel-3d"
    },
    {
        "id": "vue-carousel",
        "name": "Vue Carousel",
        "description": "Vue Carousel is a flexible, responsive carousel component for Vue.js. It supports touch swiping, slide indicators, autoplay, and responsive breakpoints. Often used for marketing sliders, banners, and product highlights.",
        "category": "Frontend",
        "license": "MIT",
        "cost": "Free",
        "size": "1.2 MB",
        "version": "0.18.0",
        "stars": 2200,
        "last_updated": "Updated on 05/11/2024",
        "os": "Cross-platform",
        "tags": [
            "Vue",
            "Slider",
            "Carousel",
            "Touch",
            "Responsive"
        ],
        "source": "https://github.com/SSENSE/vue-carousel"
    },
    {
        "id": "vue-awesome-swiper",
        "name": "Vue Awesome Swiper",
        "description": "Vue Awesome Swiper integrates the SwiperJS library with Vue.js, providing powerful touch sliders with parallax, lazy loading, and responsive options. Perfect for mobile-friendly carousels and full-page sliders.",
        "category": "Frontend",
        "license": "MIT",
        "cost": "Free",
        "size": "1.4 MB",
        "version": "4.1.1",
        "stars": 7800,
        "last_updated": "Updated on 05/11/2024",
        "os": "Cross-platform",
        "tags": [
            "Vue",
            "Swiper",
            "Slider",
            "Mobile",
            "Lazy Load"
        ],
        "source": "https://github.com/surmon-china/vue-awesome-swiper"
    },
    {
        "id": "vue-splide",
        "name": "Vue Splide",
        "description": "Vue Splide is a Vue integration for the lightweight SplideJS slider. It supports vertical and horizontal modes, lazy loading, autoplay, and multiple carousels on the same page. It’s ideal for modern, mobile-first image sliders.",
        "category": "Frontend",
        "license": "MIT",
        "cost": "Free",
        "size": "950 KB",
        "version": "0.7.12",
        "stars": 1900,
        "last_updated": "Updated on 05/11/2024",
        "os": "Cross-platform",
        "tags": [
            "Vue",
            "Splide",
            "Carousel",
            "Lightweight",
            "Touch"
        ],
        "source": "https://splidejs.com/integration/vue-splide/"
    },
    {
        "id": "vue-photo-preview",
        "name": "Vue Photo Preview",
        "description": "Vue Photo Preview provides a responsive lightbox-style image viewer with zoom, swipe, and fullscreen support. It is ideal for mobile devices, portfolios, and photo galleries requiring intuitive UX.",
        "category": "Frontend",
        "license": "MIT",
        "cost": "Free",
        "size": "850 KB",
        "version": "2.1.2",
        "stars": 1300,
        "last_updated": "Updated on 05/11/2024",
        "os": "Cross-platform",
        "tags": [
            "Vue",
            "Image Viewer",
            "Gallery",
            "Zoom",
            "Lightbox"
        ],
        "source": "https://github.com/826327700/vue-photo-preview"
    },
    {
        "id": "vue-image-compare",
        "name": "Vue Image Compare",
        "description": "Vue Image Compare is a Vue component for side-by-side image comparison sliders. It supports vertical and horizontal layouts, custom handles, and responsive design. Useful for before-after UI, photo comparisons, and product demos.",
        "category": "Frontend",
        "license": "MIT",
        "cost": "Free",
        "size": "650 KB",
        "version": "1.0.4",
        "stars": 500,
        "last_updated": "Updated on 05/11/2024",
        "os": "Cross-platform",
        "tags": [
            "Vue",
            "Image Comparison",
            "Slider",
            "Before After",
            "Responsive"
        ],
        "source": "https://github.com/juliandavidmr/vue-twentytwenty"
    },
    {
        "id": "vue-cool-lightbox",
        "name": "Vue Cool Lightbox",
        "description": "Vue Cool Lightbox is a flexible image lightbox plugin for Vue.js. It supports gallery navigation, keyboard shortcuts, zoom, and fullscreen display. It works well for eCommerce product previews and gallery UIs.",
        "category": "Frontend",
        "license": "MIT",
        "cost": "Free",
        "size": "1 MB",
        "version": "2.3.3",
        "stars": 1200,
        "last_updated": "Updated on 05/11/2024",
        "os": "Cross-platform",
        "tags": [
            "Vue",
            "Lightbox",
            "Gallery",
            "Image",
            "Zoom"
        ],
        "source": "https://github.com/devstark-com/vue-cool-lightbox"
    },
    {
        "id": "vue-lightbox",
        "name": "Vue Lightbox",
        "description": "Vue Lightbox is a minimal and lightweight lightbox component for Vue applications. It supports keyboard and touch navigation, dynamic image lists, and custom styling, making it perfect for quick gallery features.",
        "category": "Frontend",
        "license": "MIT",
        "cost": "Free",
        "size": "500 KB",
        "version": "1.3.2",
        "stars": 850,
        "last_updated": "Updated on 05/11/2024",
        "os": "Cross-platform",
        "tags": [
            "Vue",
            "Lightbox",
            "Images",
            "Touch",
            "Responsive"
        ],
        "source": "https://github.com/pexea12/vue-lightbox"
    },
    {
        "id": "vue-draggable-resizable",
        "name": "Vue Draggable Resizable",
        "description": "Vue Draggable Resizable is a Vue component that enables drag-and-resize functionality on elements. It supports snap-to-grid, aspect ratio locking, custom handles, and bounding. Ideal for editors, dashboards, and interactive layouts.",
        "category": "Frontend",
        "license": "MIT",
        "cost": "Free",
        "size": "950 KB",
        "version": "3.0.0",
        "stars": 1800,
        "last_updated": "Updated on 05/11/2024",
        "os": "Cross-platform",
        "tags": [
            "Vue",
            "Draggable",
            "Resizable",
            "Interactive UI",
            "Custom Layout"
        ],
        "source": "https://github.com/mauricius/vue-draggable-resizable"
    },
    {
        "id": "vue-pdf",
        "name": "Vue PDF",
        "description": "Vue PDF is a Vue.js component for rendering PDF documents using PDF.js. It supports zoom, pagination, and dynamic source binding, making it useful for previews, document viewers, and embedded content tools.",
        "category": "Frontend",
        "license": "MIT",
        "cost": "Free",
        "size": "1.5 MB",
        "version": "5.1.0",
        "stars": 2400,
        "last_updated": "Updated on 05/11/2024",
        "os": "Cross-platform",
        "tags": [
            "Vue",
            "PDF",
            "Document Viewer",
            "Preview",
            "PDF.js"
        ],
        "source": "https://github.com/FranckFreiburger/vue-pdf"
    },
    {
        "id": "vue-signature-pad",
        "name": "Vue Signature Pad",
        "description": "Vue Signature Pad is a wrapper around signature_pad for capturing user-drawn signatures in Vue apps. It allows resizing, exporting, clearing, and real-time data capture — perfect for forms, contracts, and e-signatures.",
        "category": "Frontend",
        "license": "MIT",
        "cost": "Free",
        "size": "400 KB",
        "version": "3.1.1",
        "stars": 1200,
        "last_updated": "Updated on 05/11/2024",
        "os": "Cross-platform",
        "tags": [
            "Vue",
            "Signature",
            "Canvas",
            "Drawing",
            "Form Input"
        ],
        "source": "https://github.com/neighborhood999/vue-signature-pad"
    },
    {
        "id": "vue-chartjs",
        "name": "Vue Chart.js",
        "description": "Vue Chart.js is a Vue wrapper for Chart.js, offering declarative charts with two-way data binding and reactive updates. It supports bar, line, pie, radar, and more chart types, ideal for dashboards and data visualization tools.",
        "category": "Frontend",
        "license": "MIT",
        "cost": "Free",
        "size": "1.8 MB",
        "version": "4.2.1",
        "stars": 5100,
        "last_updated": "Updated on 05/11/2024",
        "os": "Cross-platform",
        "tags": [
            "Vue",
            "Chart",
            "Data Visualization",
            "Charts.js",
            "Dashboard"
        ],
        "source": "https://vue-chartjs.org/"
    },
    {
        "id": "vue-echarts",
        "name": "Vue ECharts",
        "description": "Vue ECharts is a Vue 3 and Vue 2 wrapper for Apache ECharts, enabling high-performance, interactive charts. It supports custom themes, real-time updates, and responsive charts — perfect for analytics dashboards.",
        "category": "Frontend",
        "license": "MIT",
        "cost": "Free",
        "size": "2.3 MB",
        "version": "6.2.3",
        "stars": 6200,
        "last_updated": "Updated on 05/11/2024",
        "os": "Cross-platform",
        "tags": [
            "Vue",
            "ECharts",
            "Data",
            "Interactive",
            "Responsive"
        ],
        "source": "https://github.com/ecomfe/vue-echarts"
    },
    {
        "id": "vue-google-charts",
        "name": "Vue Google Charts",
        "description": "Vue Google Charts is a Vue component for Google Charts integration. It supports all major chart types and customization features including tooltips, themes, and dynamic updates. Useful for business dashboards and reports.",
        "category": "Frontend",
        "license": "MIT",
        "cost": "Free",
        "size": "1.3 MB",
        "version": "0.3.2",
        "stars": 800,
        "last_updated": "Updated on 05/11/2024",
        "os": "Cross-platform",
        "tags": [
            "Vue",
            "Google Charts",
            "Dashboard",
            "Data",
            "Graphs"
        ],
        "source": "https://github.com/devstark-com/vue-google-charts"
    },
    {
        "id": "vue-d3-network",
        "name": "Vue D3 Network",
        "description": "Vue D3 Network is a Vue.js component for visualizing network graphs using D3.js. It supports interactivity, zooming, dragging, and directional arrows, making it suitable for data relationships, dependency graphs, and tree structures.",
        "category": "Frontend",
        "license": "MIT",
        "cost": "Free",
        "size": "950 KB",
        "version": "2.0.0",
        "stars": 1200,
        "last_updated": "Updated on 05/11/2024",
        "os": "Cross-platform",
        "tags": [
            "Vue",
            "D3.js",
            "Graph",
            "Network",
            "Interactive"
        ],
        "source": "https://github.com/emiliorizzo/vue-d3-network"
    },
    {
        "id": "vue-grid-layout",
        "name": "Vue Grid Layout",
        "description": "Vue Grid Layout is a responsive draggable and resizable grid system for Vue.js, inspired by React-Grid-Layout. It supports drag-and-drop positioning and layout saving — great for dashboards and widget-based UIs.",
        "category": "Frontend",
        "license": "MIT",
        "cost": "Free",
        "size": "1.6 MB",
        "version": "3.0.0",
        "stars": 6700,
        "last_updated": "Updated on 05/11/2024",
        "os": "Cross-platform",
        "tags": [
            "Vue",
            "Grid",
            "Draggable",
            "Resizable",
            "Dashboard"
        ],
        "source": "https://github.com/jbaysolutions/vue-grid-layout"
    },
    {
        "id": "vue-split-pane",
        "name": "Vue Split Pane",
        "description": "Vue Split Pane is a simple, draggable split-pane layout component. It supports vertical and horizontal splitting, min/max sizes, and real-time resizing. Great for IDE-like interfaces, dashboards, and multi-panel apps.",
        "category": "Frontend",
        "license": "MIT",
        "cost": "Free",
        "size": "550 KB",
        "version": "2.0.1",
        "stars": 1000,
        "last_updated": "Updated on 05/11/2024",
        "os": "Cross-platform",
        "tags": [
            "Vue",
            "Split Pane",
            "Resizable",
            "Panel",
            "Layout"
        ],
        "source": "https://github.com/antoniandre/vue-splitpane"
    },
    {
        "id": "vue-smooth-dnd",
        "name": "Vue Smooth DnD",
        "description": "Vue Smooth DnD is a wrapper for the Smooth-DnD library, offering beautiful drag-and-drop with nesting, animation, and touch support. It’s ideal for Kanban boards, card UIs, and reordering lists in Vue apps.",
        "category": "Frontend",
        "license": "MIT",
        "cost": "Free",
        "size": "1 MB",
        "version": "1.1.3",
        "stars": 1700,
        "last_updated": "Updated on 05/11/2024",
        "os": "Cross-platform",
        "tags": [
            "Vue",
            "Drag and Drop",
            "Lists",
            "Reorder",
            "Kanban"
        ],
        "source": "https://github.com/kutlugsahin/vue-smooth-dnd"
    },
    {
        "id": "vue-form-generator",
        "name": "Vue Form Generator",
        "description": "Vue Form Generator is a schema-based form generation library for Vue.js. It allows developers to define form fields using JSON schemas and supports validations, custom inputs, and conditional rendering. Ideal for admin dashboards and dynamic input interfaces.",
        "category": "Frontend",
        "license": "MIT",
        "cost": "Free",
        "size": "1.1 MB",
        "version": "2.4.4",
        "stars": 2900,
        "last_updated": "Updated on 05/11/2024",
        "os": "Cross-platform",
        "tags": [
            "Vue",
            "Forms",
            "Schema",
            "Validation",
            "Dynamic"
        ],
        "source": "https://github.com/vue-generators/vue-form-generator"
    },
    {
        "id": "vue-json-schema-form",
        "name": "Vue JSON Schema Form",
        "description": "Vue JSON Schema Form is a Vue.js component that generates forms from JSON Schema definitions. It supports custom widgets, conditional fields, form validation, and nested structures. Useful for form-heavy applications and automation tools.",
        "category": "Frontend",
        "license": "MIT",
        "cost": "Free",
        "size": "1.3 MB",
        "version": "2.6.1",
        "stars": 1400,
        "last_updated": "Updated on 05/11/2024",
        "os": "Cross-platform",
        "tags": [
            "Vue",
            "JSON Schema",
            "Forms",
            "Validation",
            "Auto-generate"
        ],
        "source": "https://github.com/koumoul-dev/vue-json-schema-form"
    },
    {
        "id": "vue-formulate",
        "name": "Vue Formulate",
        "description": "Vue Formulate is a powerful form framework for Vue that abstracts away input types, validations, and form states. It provides a single syntax for forms, supports custom validation rules, and integrates easily with Vue CLI and SSR.",
        "category": "Frontend",
        "license": "MIT",
        "cost": "Free",
        "size": "1.7 MB",
        "version": "2.6.3",
        "stars": 2700,
        "last_updated": "Updated on 05/11/2024",
        "os": "Cross-platform",
        "tags": [
            "Vue",
            "Forms",
            "Validation",
            "SSR",
            "Inputs"
        ],
        "source": "https://vueformulate.com/"
    },
    {
        "id": "vue-final-form",
        "name": "Vue Final Form",
        "description": "Vue Final Form is a lightweight form state management library inspired by Final Form. It provides a reactive API to manage field-level validation, submission handling, and form state without bloat. Ideal for highly controlled forms.",
        "category": "Frontend",
        "license": "MIT",
        "cost": "Free",
        "size": "900 KB",
        "version": "1.5.2",
        "stars": 1200,
        "last_updated": "Updated on 05/11/2024",
        "os": "Cross-platform",
        "tags": [
            "Vue",
            "Forms",
            "Validation",
            "State Management",
            "Final Form"
        ],
        "source": "https://github.com/adrien2p/vue-final-form"
    },
    {
        "id": "vee-validate",
        "name": "VeeValidate",
        "description": "VeeValidate is one of the most popular Vue form validation libraries. It supports both template-driven and schema-based validation, custom rules, localization, and TypeScript. Perfect for production-ready, multilingual Vue apps.",
        "category": "Frontend",
        "license": "MIT",
        "cost": "Free",
        "size": "1.2 MB",
        "version": "4.9.0",
        "stars": 11000,
        "last_updated": "Updated on 05/11/2024",
        "os": "Cross-platform",
        "tags": [
            "Vue",
            "Validation",
            "Forms",
            "i18n",
            "TypeScript"
        ],
        "source": "https://vee-validate.logaretm.com/"
    },
    {
        "id": "vuelidate",
        "name": "Vuelidate",
        "description": "Vuelidate is a lightweight model-based validation library for Vue. It enables reactive validations and supports custom validators, nested rules, and async checks. It’s designed to be logic-driven rather than markup-heavy.",
        "category": "Frontend",
        "license": "MIT",
        "cost": "Free",
        "size": "800 KB",
        "version": "2.0.0",
        "stars": 9500,
        "last_updated": "Updated on 05/11/2024",
        "os": "Cross-platform",
        "tags": [
            "Vue",
            "Forms",
            "Validation",
            "Model Driven",
            "Lightweight"
        ],
        "source": "https://vuelidate-next.netlify.app/"
    },
    {
        "id": "vue-use-form",
        "name": "Vue Use Form",
        "description": "Vue Use Form is a composition API-based form handler for Vue 3. It provides form state, error handling, validation, and controlled/uncontrolled input support. Built to be small, performant, and suitable for modern Vue projects.",
        "category": "Frontend",
        "license": "MIT",
        "cost": "Free",
        "size": "600 KB",
        "version": "1.1.1",
        "stars": 800,
        "last_updated": "Updated on 05/11/2024",
        "os": "Cross-platform",
        "tags": [
            "Vue",
            "Forms",
            "Composition API",
            "Validation",
            "Form State"
        ],
        "source": "https://github.com/inocan-group/vue-use-form"
    },
    {
        "id": "vue-form-wizard",
        "name": "Vue Form Wizard",
        "description": "Vue Form Wizard helps build multi-step form wizards using Vue.js. It supports validation per step, navigation controls, progress indicators, and custom layouts. Ideal for onboarding flows, multi-step registrations, and surveys.",
        "category": "Frontend",
        "license": "MIT",
        "cost": "Free",
        "size": "950 KB",
        "version": "0.8.4",
        "stars": 3000,
        "last_updated": "Updated on 05/11/2024",
        "os": "Cross-platform",
        "tags": [
            "Vue",
            "Wizard",
            "Multi-Step",
            "Forms",
            "Progress"
        ],
        "source": "https://github.com/BinarCode/vue-form-wizard"
    },
    {
        "id": "vue-stepper-component",
        "name": "Vue Stepper Component",
        "description": "Vue Stepper Component is a UI component that enables step-by-step forms and workflows. It includes vertical/horizontal layouts, customizable icons, and validation between steps. Commonly used in checkout pages and wizards.",
        "category": "Frontend",
        "license": "MIT",
        "cost": "Free",
        "size": "720 KB",
        "version": "1.2.3",
        "stars": 1000,
        "last_updated": "Updated on 05/11/2024",
        "os": "Cross-platform",
        "tags": [
            "Vue",
            "Stepper",
            "Wizard",
            "Onboarding",
            "Multi-Step"
        ],
        "source": "https://github.com/PygmySlowLoris/vue-stepper-component"
    },
    {
        "id": "vue-easy-form-builder",
        "name": "Vue Easy Form Builder",
        "description": "Vue Easy Form Builder is a drag-and-drop form designer and runtime builder. It supports exporting schema, field mapping, conditional logic, and real-time preview. Designed for admin tools and no-code platforms.",
        "category": "Frontend",
        "license": "MIT",
        "cost": "Free",
        "size": "2.4 MB",
        "version": "1.0.0",
        "stars": 650,
        "last_updated": "Updated on 05/11/2024",
        "os": "Cross-platform",
        "tags": [
            "Vue",
            "Form Builder",
            "Drag and Drop",
            "Schema",
            "Admin UI"
        ],
        "source": "https://github.com/sethmacleod/vue-easy-form-builder"
    },
    {
        "id": "vue-formly",
        "name": "Vue Formly",
        "description": "Vue Formly is a dynamic form rendering library inspired by Angular Formly. It enables the creation of forms based on JSON configuration with built-in support for custom components and validation. Ideal for low-code and admin solutions.",
        "category": "Frontend",
        "license": "MIT",
        "cost": "Free",
        "size": "1.2 MB",
        "version": "2.5.0",
        "stars": 1500,
        "last_updated": "Updated on 05/11/2024",
        "os": "Cross-platform",
        "tags": [
            "Vue",
            "Forms",
            "Dynamic",
            "JSON",
            "Admin"
        ],
        "source": "https://github.com/formly-js/vue-formly"
    },
    {
        "id": "vue-json-editor",
        "name": "Vue JSON Editor",
        "description": "Vue JSON Editor is a wrapper around the popular JSONEditor library. It provides a rich text and tree-based editor for JSON data with validation, schema support, and drag-and-drop nodes. Great for dashboards, API tools, and data config panels.",
        "category": "Frontend",
        "license": "MIT",
        "cost": "Free",
        "size": "1.8 MB",
        "version": "1.0.5",
        "stars": 1000,
        "last_updated": "Updated on 05/11/2024",
        "os": "Cross-platform",
        "tags": [
            "Vue",
            "JSON",
            "Editor",
            "Schema",
            "Config"
        ],
        "source": "https://github.com/fh-vue/vue-json-editor"
    },
    {
        "id": "vue-clipboard2",
        "name": "Vue Clipboard2",
        "description": "Vue Clipboard2 is a Vue.js plugin that makes copying text to clipboard seamless. It’s based on clipboard.js and provides directives to quickly implement copy-to-clipboard functionality in any component.",
        "category": "Frontend",
        "license": "MIT",
        "cost": "Free",
        "size": "400 KB",
        "version": "0.3.1",
        "stars": 1400,
        "last_updated": "Updated on 05/11/2024",
        "os": "Cross-platform",
        "tags": [
            "Vue",
            "Clipboard",
            "Copy",
            "Directive",
            "UX"
        ],
        "source": "https://github.com/Inndy/vue-clipboard2"
    },
    {
        "id": "vue-stripe-checkout",
        "name": "Vue Stripe Checkout",
        "description": "Vue Stripe Checkout is a Vue.js integration of Stripe’s Checkout API. It enables seamless payment workflows with support for single and subscription-based payments. Perfect for e-commerce, donations, and SaaS platforms.",
        "category": "Frontend",
        "license": "MIT",
        "cost": "Free",
        "size": "750 KB",
        "version": "1.4.0",
        "stars": 1200,
        "last_updated": "Updated on 05/11/2024",
        "os": "Cross-platform",
        "tags": [
            "Vue",
            "Payments",
            "Stripe",
            "Checkout",
            "E-commerce"
        ],
        "source": "https://github.com/vue-stripe/vue-stripe"
    },
    {
        "id": "vue-country-flag",
        "name": "Vue Country Flag",
        "description": "Vue Country Flag is a component to display ISO 3166-1 country flags using emoji or SVG styles. It supports over 250 flags and can be used for language switchers, form selectors, and internationalized interfaces.",
        "category": "Frontend",
        "license": "MIT",
        "cost": "Free",
        "size": "500 KB",
        "version": "2.0.5",
        "stars": 900,
        "las_updated": "Updated on 05/11/2024",
        "os": "Cross-platform",
        "tags": [
            "Vue",
            "Flags",
            "Country Code",
            "Emoji",
            "SVG"
        ],
        "source": "https://github.com/P3trur0/vue-countr-flag"
    },
    {
        "id": "vue-world-map",
        "name": "Vue World Map",
        "description": "Vue World Map is a simple and responsive world map component built with SVG. It allows interactivity, click events, country highlighting, and custom tooltip content — great for dashboards and global data visualizations.",
        "category": "Frontend",
        "license": "MIT",
        "cost": "Free",
        "size": "1.1 MB",
        "version": "1.2.1",
        "stars": 600,
        "last_updated": "Updated on 05/11/2024",
        "os": "Cross-platform",
        "tags": [
            "Vue",
            "Map",
            "World",
            "SVG",
            "Visualization"
        ],
        "source": "https://github.com/ManukMinasyan/vue-world-map"
    },
    {
        "id": "vue-prism-editor",
        "name": "Vue Prism Editor",
        "description": "Vue Prism Editor is a lightweight, extensible code editor component for Vue.js that uses PrismJS for syntax highlighting. It supports theme customization, line numbering, and is ideal for embedding editors in web IDEs or documentation tools.",
        "category": "Frontend",
        "license": "MIT",
        "cost": "Free",
        "size": "850 KB",
        "version": "2.0.2",
        "stars": 2100,
        "last_updated": "Updated on 05/11/2024",
        "os": "Cross-platform",
        "tags": [
            "Vue",
            "Code Editor",
            "Prism",
            "Syntax",
            "IDE"
        ],
        "source": "https://github.com/koca/vue-prism-editor"
    },
    {
        "id": "vue-monaco-editor",
        "name": "Vue Monaco Editor",
        "description": "Vue Monaco Editor is a Vue component for integrating Microsoft’s Monaco Editor, the same editor that powers VS Code. It supports TypeScript, JSON, CSS, HTML, and more — ideal for developer-focused applications.",
        "category": "Frontend",
        "license": "MIT",
        "cost": "Free",
        "size": "3 MB",
        "version": "1.0.0",
        "stars": 1800,
        "last_updated": "Updated on 05/11/2024",
        "os": "Cross-platform",
        "tags": [
            "Vue",
            "Monaco",
            "VSCode",
            "Editor",
            "Dev Tools"
        ],
        "source": "https://github.com/FashionBoy/vue-monaco-editor"
    },
    {
        "id": "vue-simple-markdown",
        "name": "Vue Simple Markdown",
        "description": "Vue Simple Markdown is a markdown rendering plugin using Markdown-it. It supports inline HTML, syntax highlighting, and emoji parsing. Great for blogs, documentation, and note-taking interfaces in Vue apps.",
        "category": "Frontend",
        "license": "MIT",
        "cost": "Free",
        "size": "900 KB",
        "version": "1.3.1",
        "stars": 600,
        "last_updated": "Updated on 05/11/2024",
        "os": "Cross-platform",
        "tags": [
            "Vue",
            "Markdown",
            "Renderer",
            "Syntax",
            "HTML"
        ],
        "source": "https://github.com/Vivify-Ideas/vue-simple-markdown"
    },
    {
        "id": "vue-markdown-editor",
        "name": "Vue Markdown Editor",
        "description": "Vue Markdown Editor is a full-featured markdown editor built with Vue and CodeMirror. It supports live preview, toolbar actions, theme customization, and file saving — excellent for docs, wikis, and user-generated content.",
        "category": "Frontend",
        "license": "MIT",
        "cost": "Free",
        "size": "2.2 MB",
        "version": "2.5.3",
        "stars": 1600,
        "last_updated": "Updated on 05/11/2024",
        "os": "Cross-platform",
        "tags": [
            "Vue",
            "Markdown",
            "Editor",
            "CodeMirror",
            "Docs"
        ],
        "source": "https://github.com/code-farmer-i/vue-markdown-editor"
    },
    {
        "id": "vue-mathjax",
        "name": "Vue MathJax",
        "description": "Vue MathJax is a lightweight wrapper for MathJax that enables LaTeX and math expression rendering in Vue.js applications. It supports inline and block formulas, making it perfect for educational tools, scientific writing, and STEM dashboards.",
        "category": "Frontend",
        "license": "MIT",
        "cost": "Free",
        "size": "600 KB",
        "version": "1.1.2",
        "stars": 800,
        "last_updated": "Updated on 05/11/2024",
        "os": "Cross-platform",
        "tags": [
            "Vue",
            "MathJax",
            "LaTeX",
            "Formula",
            "STEM"
        ],
        "source": "https://github.com/justinribeiro/vue-mathjax"
    },
    {
        "id": "vue-latex",
        "name": "Vue LaTeX",
        "description": "Vue LaTeX is a Vue.js plugin for rendering LaTeX using KaTeX. It provides fast, server-independent math typesetting and supports both block and inline rendering. Great for learning platforms, math tools, and scientific interfaces.",
        "category": "Frontend",
        "license": "MIT",
        "cost": "Free",
        "size": "700 KB",
        "version": "1.2.3",
        "stars": 650,
        "last_updated": "Updated on 05/11/2024",
        "os": "Cross-platform",
        "tags": [
            "Vue",
            "KaTeX",
            "Math",
            "LaTeX",
            "Education"
        ],
        "source": "https://github.com/ronin119/vue-latex"
    },
    {
        "id": "vue-video-player",
        "name": "Vue Video Player",
        "description": "Vue Video Player is a video player component based on Video.js for Vue.js. It supports HTML5 video, HLS, and custom controls, making it ideal for media platforms, video tutorials, and e-learning sites.",
        "category": "Frontend",
        "license": "MIT",
        "cost": "Free",
        "size": "1.5 MB",
        "version": "5.0.2",
        "stars": 6700,
        "last_updated": "Updated on 05/11/2024",
        "os": "Cross-platform",
        "tags": [
            "Vue",
            "Video",
            "Media",
            "HLS",
            "Streaming"
        ],
        "source": "https://github.com/surmon-china/vue-video-player"
    },
    {
        "id": "vue-audio",
        "name": "Vue Audio",
        "description": "Vue Audio is a lightweight wrapper for HTML5 audio players in Vue.js. It supports autoplay, loop, volume control, and playlist management. Ideal for podcast apps, learning tools, and audio-driven UIs.",
        "category": "Frontend",
        "license": "MIT",
        "cost": "Free",
        "size": "300 KB",
        "version": "1.0.5",
        "stars": 400,
        "last_updated": "Updated on 05/11/2024",
        "os": "Cross-platform",
        "tags": [
            "Vue",
            "Audio",
            "Music",
            "Player",
            "Podcast"
        ],
        "source": "https://github.com/shershen08/vue-html5-audio"
    },
    {
        "id": "vue-sound-player",
        "name": "Vue Sound Player",
        "description": "Vue Sound Player is a simple and extensible component for embedding sound playback into Vue applications. It supports waveform visualization and click-to-play mechanics. Useful for music platforms and creative UIs.",
        "category": "Frontend",
        "license": "MIT",
        "cost": "Free",
        "size": "450 KB",
        "version": "2.0.0",
        "stars": 300,
        "last_updated": "Updated on 05/11/2024",
        "os": "Cross-platform",
        "tags": [
            "Vue",
            "Audio",
            "Waveform",
            "Sound",
            "Player"
        ],
        "source": "https://github.com/alex-aqua/vue-sound-player"
    },
    {
        "id": "vue-web-audio",
        "name": "Vue Web Audio",
        "description": "Vue Web Audio is a Vue.js interface for the Web Audio API. It allows creating real-time audio visualizations and manipulating audio nodes. Best used for equalizers, mixers, and browser-based music editors.",
        "category": "Frontend",
        "license": "MIT",
        "cost": "Free",
        "size": "1.2 MB",
        "version": "1.1.0",
        "stars": 650,
        "last_updated": "Updated on 05/11/2024",
        "os": "Cross-platform",
        "tags": [
            "Vue",
            "Web Audio API",
            "Visualization",
            "Equalizer",
            "Music"
        ],
        "source": "https://github.com/shinyaigeek/vue-web-audio"
    },
    {
        "id": "vue-player",
        "name": "Vue Player",
        "description": "Vue Player is a Vue wrapper for Plyr, an accessible and customizable HTML5 media player. It supports video, audio, YouTube, and Vimeo integrations. Used in educational platforms and media dashboards.",
        "category": "Frontend",
        "license": "MIT",
        "cost": "Free",
        "size": "1.8 MB",
        "version": "1.3.4",
        "stars": 1800,
        "last_updated": "Updated on 05/11/2024",
        "os": "Cross-platform",
        "tags": [
            "Vue",
            "Plyr",
            "Media",
            "Video",
            "Audio"
        ],
        "source": "https://github.com/redxtech/vue-player"
    },
    {
        "id": "vue-lazyload",
        "name": "Vue Lazyload",
        "description": "Vue Lazyload is a lightweight plugin to lazy-load images in Vue apps. It includes scroll detection, placeholder support, loading indicators, and error fallback images. Ideal for performance optimization on content-heavy sites.",
        "category": "Frontend",
        "license": "MIT",
        "cost": "Free",
        "size": "550 KB",
        "version": "2.1.0",
        "stars": 8000,
        "last_updated": "Updated on 05/11/2024",
        "os": "Cross-platform",
        "tags": [
            "Vue",
            "Lazy Load",
            "Images",
            "Performance",
            "Optimization"
        ],
        "source": "https://github.com/hilongjw/vue-lazyload"
    },
    {
        "id": "vue-content-placeholders",
        "name": "Vue Content Placeholders",
        "description": "Vue Content Placeholders is a plugin for creating skeleton loading screens. Inspired by Facebook's loading UX, it offers animated placeholder blocks for improving perceived performance while data loads.",
        "category": "Frontend",
        "license": "MIT",
        "cost": "Free",
        "size": "650 KB",
        "version": "0.3.3",
        "stars": 2200,
        "last_updated": "Updated on 05/11/2024",
        "os": "Cross-platform",
        "tags": [
            "Vue",
            "Skeleton",
            "Placeholder",
            "Loading",
            "UX"
        ],
        "source": "https://github.com/michalsnik/vue-content-placeholders"
    },
    {
        "id": "vue-lazy-hydration",
        "name": "Vue Lazy Hydration",
        "description": "Vue Lazy Hydration allows you to delay hydration of Vue components until they become visible or interactable. It’s especially useful in SSR (Nuxt.js) applications to improve performance and reduce initial load time.",
        "category": "Frontend",
        "license": "MIT",
        "cost": "Free",
        "size": "500 KB",
        "version": "2.0.2",
        "stars": 1100,
        "last_updated": "Updated on 05/11/2024",
        "os": "Cross-platform",
        "tags": [
            "Vue",
            "SSR",
            "Lazy Load",
            "Performance",
            "Hydration"
        ],
        "source": "https://github.com/maoberlehner/vue-lazy-hydration"
    },
    {
        "id": "vue-infinite-scroll",
        "name": "Vue Infinite Scroll",
        "description": "Vue Infinite Scroll is a lightweight directive for implementing infinite scroll loading in Vue apps. It attaches scroll event handlers to containers and triggers data loading as the user reaches the end. Great for social feeds and long lists.",
        "category": "Frontend",
        "license": "MIT",
        "cost": "Free",
        "size": "400 KB",
        "version": "2.0.2",
        "stars": 3600,
        "last_updated": "Updated on 05/11/2024",
        "os": "Cross-platform",
        "tags": [
            "Vue",
            "Infinite Scroll",
            "Feeds",
            "Pagination",
            "Lists"
        ],
        "source": "https://github.com/PeachScript/vue-infinite-scroll"
    },
    {
        "id": "vue-scrollactive",
        "name": "Vue Scrollactive",
        "description": "Vue Scrollactive adds smooth scroll and active link highlighting to navigation menus. It’s ideal for single-page applications, landing pages, or documentation that requires dynamic menu indicators tied to scroll position.",
        "category": "Frontend",
        "license": "MIT",
        "cost": "Free",
        "size": "450 KB",
        "version": "0.9.0",
        "stars": 1200,
        "last_updated": "Updated on 05/11/2024",
        "os": "Cross-platform",
        "tags": [
            "Vue",
            "Scroll",
            "Navigation",
            "Active Link",
            "SPA"
        ],
        "source": "https://github.com/eddiemf/vue-scrollactive"
    },
    {
        "id": "vue-page-scroll-progress",
        "name": "Vue Page Scroll Progress",
        "description": "Vue Page Scroll Progress adds a customizable scroll progress bar to the top of your app. It reacts to scroll depth and can be styled for use cases like blog reading progress, tutorials, or long content UX.",
        "category": "Frontend",
        "license": "MIT",
        "cost": "Free",
        "size": "300 KB",
        "version": "1.1.0",
        "stars": 600,
        "last_updated": "Updated on 05/11/2024",
        "os": "Cross-platform",
        "tags": [
            "Vue",
            "Scroll",
            "Progress Bar",
            "UX",
            "Reading"
        ],
        "source": "https://github.com/diegoddox/vue-page-scroll-progress"
    },
    {
        "id": "vue-slide-up-down",
        "name": "Vue Slide Up Down",
        "description": "Vue Slide Up Down is a lightweight component for smoothly expanding or collapsing content sections using transition height auto. Great for accordions, FAQs, and hidden menus with minimal CSS.",
        "category": "Frontend",
        "license": "MIT",
        "cost": "Free",
        "size": "200 KB",
        "version": "1.0.0",
        "stars": 900,
        "last_updated": "Updated on 05/11/2024",
        "os": "Cross-platform",
        "tags": [
            "Vue",
            "Transition",
            "Slide",
            "Collapse",
            "FAQ"
        ],
        "source": "https://github.com/danieldiekmeier/vue-slide-up-down"
    },
    {
        "id": "vue-transition-expand",
        "name": "Vue Transition Expand",
        "description": "Vue Transition Expand is a simple Vue directive and component that allows vertical expansion of containers with animated transitions. It’s commonly used for mobile navs, dropdowns, and collapsible sections.",
        "category": "Frontend",
        "license": "MIT",
        "cost": "Free",
        "size": "300 KB",
        "version": "0.2.0",
        "stars": 400,
        "last_updated": "Updated on 05/11/2024",
        "os": "Cross-platform",
        "tags": [
            "Vue",
            "Expand",
            "Transition",
            "Dropdown",
            "Toggle"
        ],
        "source": "https://github.com/rochus/vue-expand-transition"
    },
    {
        "id": "vue-smooth-scrollbar",
        "name": "Vue Smooth Scrollbar",
        "description": "Vue Smooth Scrollbar integrates Smooth Scrollbar.js into Vue for customizable, inertia-based scrollbars. It supports horizontal and vertical scrolling, theming, and API methods for scroll behavior — perfect for modern SPAs.",
        "category": "Frontend",
        "license": "MIT",
        "cost": "Free",
        "size": "1.2 MB",
        "version": "1.1.5",
        "stars": 1100,
        "last_updated": "Updated on 05/11/2024",
        "os": "Cross-platform",
        "tags": [
            "Vue",
            "Scrollbar",
            "Smooth Scroll",
            "Inertia",
            "UX"
        ],
        "source": "https://github.com/dreambo8563/vue-smooth-scrollbar"
    },
    {
        "id": "vue-observe-visibility",
        "name": "Vue Observe Visibility",
        "description": "Vue Observe Visibility is a directive that allows Vue components to detect when they become visible in the viewport. Built on Intersection Observer API, it’s perfect for lazy loading, analytics, and animations on scroll.",
        "category": "Frontend",
        "license": "MIT",
        "cost": "Free",
        "size": "500 KB",
        "version": "1.0.0",
        "stars": 2100,
        "last_updated": "Updated on 05/11/2024",
        "os": "Cross-platform",
        "tags": [
            "Vue",
            "Visibility",
            "Observer",
            "Lazy Load",
            "Scroll"
        ],
        "source": "https://github.com/Akryum/vue-observe-visibility"
    },
    {
        "id": "vue-scroll-reveal",
        "name": "Vue Scroll Reveal",
        "description": "Vue Scroll Reveal integrates ScrollReveal animations into Vue. It adds scroll-based animation directives for fades, slides, and other effects. Great for attention-grabbing landing pages and portfolios.",
        "category": "Frontend",
        "license": "MIT",
        "cost": "Free",
        "size": "800 KB",
        "version": "2.2.0",
        "stars": 1500,
        "last_updated": "Updated on 05/11/2024",
        "os": "Cross-platform",
        "tags": [
            "Vue",
            "Animation",
            "Scroll",
            "Reveal",
            "Landing Page"
        ],
        "source": "https://github.com/ignatiusmb/vue-scroll-reveal"
    },
    {
        "id": "vue-observe-element",
        "name": "Vue Observe Element",
        "description": "Vue Observe Element allows components to react to changes in size or position using ResizeObserver and MutationObserver. Ideal for responsive layout tuning and performance optimization in reactive layouts.",
        "category": "Frontend",
        "license": "MIT",
        "cost": "Free",
        "size": "600 KB",
        "version": "1.0.3",
        "stars": 700,
        "last_updated": "Updated on 05/11/2024",
        "os": "Cross-platform",
        "tags": [
            "Vue",
            "Observer",
            "Resize",
            "Responsive",
            "Mutation"
        ],
        "source": "https://github.com/vue-a11y/vue-observe-element"
    },
    {
        "id": "vue-scrollmagic",
        "name": "Vue ScrollMagic",
        "description": "Vue ScrollMagic integrates the ScrollMagic animation controller into Vue. It allows scroll-based animations and pinning of elements tied to scroll position. Great for storytelling, infographics, and scroll-triggered content.",
        "category": "Frontend",
        "license": "MIT",
        "cost": "Free",
        "size": "1.1 MB",
        "version": "0.2.4",
        "stars": 950,
        "last_updated": "Updated on 05/11/2024",
        "os": "Cross-platform",
        "tags": [
            "Vue",
            "Scroll",
            "Animation",
            "Pin",
            "Trigger"
        ],
        "source": "https://github.com/jofftiquez/vue-scrollmagic"
    },
    {
        "id": "vue-backtotop",
        "name": "Vue BackToTop",
        "description": "Vue BackToTop is a simple Vue component that adds a scroll-to-top button with customizable styling and behavior. It appears after scrolling down a certain distance and is useful in long-form content or infinite scroll interfaces.",
        "category": "Frontend",
        "license": "MIT",
        "cost": "Free",
        "size": "300 KB",
        "version": "2.1.0",
        "stars": 1000,
        "last_updated": "Updated on 05/11/2024",
        "os": "Cross-platform",
        "tags": [
            "Vue",
            "Scroll",
            "Back to Top",
            "UX",
            "Button"
        ],
        "source": "https://github.com/xlsdg/vue-backtotop"
    },
    {
        "id": "vue-headroom",
        "name": "Vue Headroom",
        "description": "Vue Headroom is a wrapper for Headroom.js that enables smart header visibility control based on scroll behavior. It hides or reveals navigation bars as users scroll, improving the mobile and desktop navigation experience.",
        "category": "Frontend",
        "license": "MIT",
        "cost": "Free",
        "size": "450 KB",
        "version": "0.1.5",
        "stars": 700,
        "last_updated": "Updated on 05/11/2024",
        "os": "Cross-platform",
        "tags": [
            "Vue",
            "Scroll",
            "Navbar",
            "Animation",
            "Headroom"
        ],
        "source": "https://github.com/ankurk91/vue-headroom"
    },
    {
        "id": "vue-sticky-directive",
        "name": "Vue Sticky Directive",
        "description": "Vue Sticky Directive enables sticky positioning of elements with polyfill fallback support. It’s used for headers, toolbars, or sidebars that remain fixed as the user scrolls past a certain point.",
        "category": "Frontend",
        "license": "MIT",
        "cost": "Free",
        "size": "300 KB",
        "version": "1.0.4",
        "stars": 400,
        "last_updated": "Updated on 05/11/2024",
        "os": "Cross-platform",
        "tags": [
            "Vue",
            "Sticky",
            "Directive",
            "Position",
            "Scroll"
        ],
        "source": "https://github.com/meforma/vue-sticky-directive"
    },
    {
        "id": "vue-sticky",
        "name": "Vue Sticky",
        "description": "Vue Sticky is a minimal sticky container plugin for Vue. It uses native position: sticky behavior with fallbacks, and allows for sticky headers, sections, or banners across all modern browsers.",
        "category": "Frontend",
        "license": "MIT",
        "cost": "Free",
        "size": "350 KB",
        "version": "1.3.0",
        "stars": 800,
        "last_updated": "Updated on 05/11/2024",
        "os": "Cross-platform",
        "tags": [
            "Vue",
            "Sticky",
            "Layout",
            "Scroll",
            "Fallback"
        ],
        "source": "https://github.com/rubennorte/vue-sticky"
    },
    {
        "id": "vue-affix",
        "name": "Vue Affix",
        "description": "Vue Affix is a component that affixes elements to the top or bottom of the viewport on scroll. Inspired by Bootstrap’s affix component, it is used for sticky navigation bars, ads, or side elements.",
        "category": "Frontend",
        "license": "MIT",
        "cost": "Free",
        "size": "400 KB",
        "version": "1.1.0",
        "stars": 500,
        "last_updated": "Updated on 05/11/2024",
        "os": "Cross-platform",
        "tags": [
            "Vue",
            "Affix",
            "Sticky",
            "Scroll",
            "Layout"
        ],
        "source": "https://github.com/eddiemf/vue-affix"
    },
    {
        "id": "vue-responsive",
        "name": "Vue Responsive",
        "description": "Vue Responsive is a responsive utility plugin that allows developers to conditionally render or modify behavior based on viewport size. It works well with SSR and Nuxt, helping build mobile-first layouts.",
        "category": "Frontend",
        "license": "MIT",
        "cost": "Free",
        "size": "600 KB",
        "version": "1.0.3",
        "stars": 300,
        "last_updated": "Updated on 05/11/2024",
        "os": "Cross-platform",
        "tags": [
            "Vue",
            "Responsive",
            "Mobile",
            "SSR",
            "Breakpoint"
        ],
        "source": "https://github.com/reinerBa/vue-responsive"
    },
    {
        "id": "vue-screen-size",
        "name": "Vue Screen Size",
        "description": "Vue Screen Size is a reactive screen size detection plugin. It provides Vue components with breakpoints and helper functions for conditionally displaying content based on screen width or orientation.",
        "category": "Frontend",
        "license": "MIT",
        "cost": "Free",
        "size": "500 KB",
        "version": "1.1.1",
        "stars": 800,
        "last_updated": "Updated on 05/11/2024",
        "os": "Cross-platform",
        "tags": [
            "Vue",
            "Screen Size",
            "Breakpoint",
            "Mobile First",
            "Responsive"
        ],
        "source": "https://github.com/FranckFreiburger/vue-screen-size"
    },
    {
        "id": "vue-mq",
        "name": "Vue MQ",
        "description": "Vue MQ is a media query plugin for Vue.js. It allows developers to define custom breakpoints and respond to them in templates or computed logic. Great for building adaptive, responsive Vue interfaces.",
        "category": "Frontend",
        "license": "MIT",
        "cost": "Free",
        "size": "300 KB",
        "version": "1.0.1",
        "stars": 1700,
        "last_updated": "Updated on 05/11/2024",
        "os": "Cross-platform",
        "tags": [
            "Vue",
            "Media Query",
            "Responsive",
            "Mobile",
            "Layout"
        ],
        "source": "https://github.com/AlexandreBonaventure/vue-mq"
    },
    {
        "id": "vue-responsive-components",
        "name": "Vue Responsive Components",
        "description": "Vue Responsive Components is a collection of components that automatically resize or swap content based on the container or screen. It helps manage adaptive design patterns like image swaps or layout toggling.",
        "category": "Frontend",
        "license": "MIT",
        "cost": "Free",
        "size": "950 KB",
        "version": "1.0.0",
        "stars": 600,
        "last_updated": "Updated on 05/11/2024",
        "os": "Cross-platform",
        "tags": [
            "Vue",
            "Responsive",
            "Component",
            "Resize",
            "Breakpoint"
        ],
        "source": "https://github.com/antoniandre/vue-responsive-components"
    },
    {
        "id": "vue-element-resize-detector",
        "name": "Vue Element Resize Detector",
        "description": "Vue Element Resize Detector is a plugin for detecting DOM element size changes. It uses ResizeObserver under the hood and emits reactive size updates — essential for dynamic UIs and interactive layouts.",
        "category": "Frontend",
        "license": "MIT",
        "cost": "Free",
        "size": "400 KB",
        "version": "2.0.0",
        "stars": 1100,
        "last_updated": "Updated on 05/11/2024",
        "os": "Cross-platform",
        "tags": [
            "Vue",
            "Resize",
            "Observer",
            "Layout",
            "Responsive"
        ],
        "source": "https://github.com/kazup0n/vue-element-resize-detector"
    }
]
